{
  "application_name": "1Password (Password Manager, Extended Access Management, and Trelica by 1Password)",
  "attack_paths": [
    {
      "scenario_name": "T1555.005 – Enterprise Vault Secret Dump via Compromised 1Password Business Admin",
      "hypothesis": {
        "scenario_name": "T1555.005 – Enterprise Vault Secret Dump via Compromised 1Password Business Admin",
        "attack_target": "Exfiltrate credentials and secrets from all high‑value shared vaults in a 1Password Business tenant (logins, API credentials, SSH keys, secure notes, TOTP secrets) using only legitimate admin and automation interfaces.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Exfiltration (TA0010)",
        "preconditions": "The organization uses 1Password Business with some administrators unlocking via SSO and others still using account password + Secret Key (Emergency Kits may exist). Events Reporting and Secrets Automation (CLI, service accounts, Connect) are enabled. The attacker can phish users or steal files but initially has no access to the tenant.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Compromise Over‑Privileged Admin Account",
            "step_description": "Obtain SSO credentials/MFA for a 1Password admin or steal their Emergency Kit + password, then sign in from an attacker‑controlled device to gain full admin access.",
            "step_mitre_technique": "T1078 – Valid Accounts",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Map Vaults, Groups, Service Accounts, and Connect",
            "step_description": "Use the Business admin console and 1Password CLI to enumerate all vaults, users, groups, service accounts, and Connect servers and identify high‑value shared vaults and automation paths.",
            "step_mitre_technique": "T1087 – Account Discovery; T1069 – Permission Groups Discovery; T1526 – Cloud Service Discovery",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Quietly Broaden Access to Sensitive Vaults",
            "step_description": "Adjust vault ACLs, group memberships, and service‑account scopes so that the compromised admin and selected service accounts/Connect instances gain read access to all prioritized vaults without drawing attention.",
            "step_mitre_technique": "T1098 – Account Manipulation",
            "step_mitre_tactic": "Privilege Escalation (TA0004)"
          },
          {
            "step_name": "Bulk Harvest Secrets via CLI and Connect",
            "step_description": "Use 1Password CLI and Connect APIs with compromised identities to systematically enumerate items and download all secret‑bearing fields from targeted vaults.",
            "step_mitre_technique": "T1555.005 – Credentials from Password Stores: Password Managers; T1119 – Automated Collection",
            "step_mitre_tactic": "Collection (TA0009)"
          },
          {
            "step_name": "Exfiltrate Harvested Secrets to Attacker Infrastructure",
            "step_description": "Compress and encrypt harvested data and send it to attacker‑controlled cloud storage or C2 endpoints over HTTPS or other web services, leaving 1Password audit logs showing only legitimate‑looking access.",
            "step_mitre_technique": "T1020 – Automated Exfiltration; T1567.002 – Exfiltration Over Web Service: Exfiltration to Cloud Storage",
            "step_mitre_tactic": "Exfiltration (TA0010)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001) via Valid Accounts (T1078)",
          "method_steps": [
            "Identify likely 1Password Business admins by mining LinkedIn, email headers, and company org charts for IT, security, and DevOps leadership tied to the corporate domain.",
            "Use open information, leaked documentation, or guessing patterns to derive the tenant sign‑in address and confirm that 1Password Business is in use.",
            "Run targeted phishing against identified admins, using look‑alike IdP or 1Password sign‑in pages to capture either (a) IdP SSO credentials + MFA, or (b) 1Password account password; in parallel, search for stored Emergency Kit PDFs (email, cloud drives, ticket systems, backups).",
            "If an Emergency Kit PDF for an admin is found, extract sign‑in URL, email, and Secret Key, and combine with the phished/guessed account password to satisfy the 1Password password + Secret Key model.",
            "From an attacker‑controlled machine, sign in to 1Password.com using either SSO (with stolen IdP credentials/MFA) or password + Secret Key from the Emergency Kit, completing any MFA challenges.",
            "Install and configure 1Password CLI on the same host, authenticating as the compromised admin to establish a long‑lived, scriptable foothold that 1Password treats as a legitimate administrator profile."
          ],
          "capabilities_used": [
            "End-to-End Encryption and Secret Key Model",
            "Emergency Kit for Account Recovery",
            "Single Sign-On and Unlock with SSO",
            "1Password CLI"
          ],
          "interfaces_used": [
            "1Password web sign‑in and admin console (https://start.1password.com/signin/)",
            "IdP SSO login pages integrated with Unlock with SSO",
            "1Password CLI (`op`) authentication flow"
          ],
          "data_accessed": [
            "Admin IdP credentials and MFA responses",
            "Admin 1Password account passwords",
            "Admin Secret Keys and tenant sign‑in address from Emergency Kit PDFs",
            "CLI session configuration for the compromised admin account"
          ],
          "preconditions_required": [
            "Organization uses 1Password Business with at least one over‑privileged administrator.",
            "Admins either unlock with SSO or still maintain a 1Password account password and Secret Key (Emergency Kit).",
            "Attacker can reach 1Password SaaS and the IdP from their infrastructure.",
            "At least one successful phishing or data‑theft event yielding either SSO credentials+MFA or Emergency Kit + password."
          ],
          "constraints_encountered": [
            "Strong MFA and conditional access on the IdP may make SSO credential theft harder or require real‑time relay.",
            "Some tenants disable Emergency Kits for admins or SSO‑only configurations, removing that path.",
            "New device sign‑ins and CLI enrollments generate audit events and possibly user notifications."
          ],
          "evasion_considerations": [
            "Use infrastructure in geolocations/ASNs consistent with the victim admin to reduce anomaly scores.",
            "Time first logins during business hours and around normal maintenance windows.",
            "Limit number of attacker devices that enroll the admin; reuse a single host and CLI profile.",
            "Avoid immediate large configuration or data‑access changes after initial login to delay suspicion."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "In the Business admin console, browse People and Groups to enumerate all users, guests, service accounts, and groups, noting which are owners/admins and which appear to be automation identities.",
            "In the Vaults section, list all vaults and capture names, descriptions, and any visible classification; flag vaults containing terms like \"prod\", \"infra\", \"root\", \"payments\", or \"secrets\" as likely high value.",
            "Using 1Password CLI, programmatically list all vaults and dump metadata (IDs, names, descriptions, item counts) into structured local files.",
            "For each vault, use CLI or admin UI to enumerate member users and groups and their roles (read‑only, contributor, manager), building a mapping of vault → principals → permissions.",
            "Enumerate service accounts and Connect servers from the admin Settings/Integrations pages, recording which vaults each service account and Connect instance can access.",
            "If Events Reporting is enabled, query recent Events API data or inspect SIEM dashboards to see which vaults and service accounts experience heavy item‑access activity, using that to prioritize truly critical vaults."
          ],
          "capabilities_used": [
            "Team and Business Account Administration",
            "Enterprise Password Manager for Workforce",
            "1Password CLI",
            "1Password Service Accounts",
            "1Password Connect Servers and SDKs",
            "Insights, Reports, and Activity Log",
            "1Password Events API / Events Reporting"
          ],
          "interfaces_used": [
            "Business admin console (People, Groups, Vaults, Settings)",
            "1Password CLI `op` commands for listing vaults/users/groups",
            "Service account and Connect configuration UIs in the admin console",
            "Events API endpoints or existing SIEM dashboards"
          ],
          "data_accessed": [
            "Full list of vaults and associated metadata",
            "Vault access‑control lists (users, groups, roles)",
            "Directory of members, guests, admins, and service accounts",
            "Service account scopes and Connect server configurations",
            "Audit events showing which principals access which vaults"
          ],
          "preconditions_required": [
            "Compromised admin has rights to view People, Groups, Vaults, and Settings.",
            "CLI is authenticated as the compromised admin.",
            "Events Reporting/Connect/Service Accounts are enabled to fully expose automation paths."
          ],
          "constraints_encountered": [
            "Some features (Events Reporting, Connect, Service Accounts) may not be enabled on all plans.",
            "Large tenants may produce very large datasets, risking rate limits or visible spikes in admin/API activity.",
            "Some internal Connect endpoints may not be network‑reachable from the attacker’s current host."
          ],
          "evasion_considerations": [
            "Throttle CLI/API calls and intersperse them with normal browsing to resemble an active admin.",
            "Avoid creating new integrations or tokens during discovery—only read existing configuration.",
            "Perform bulk listing during normal working hours to blend with expected admin activity."
          ]
        },
        {
          "tactic_name": "Privilege Escalation (TA0004)",
          "method_steps": [
            "Using the discovery map, identify existing groups and service accounts that already have broad access and include the compromised admin as a member, preferring these as escalation vehicles.",
            "For each high‑value vault that does not yet permit attacker access, add one of these existing groups to the vault in the admin UI or via CLI with the minimum necessary role (typically read‑only).",
            "Where group‑based access is too noisy, expand the scope of an existing service account that fronts CI/CD or infrastructure automation to include selected sensitive vaults, so that additional secrets become available to that automation identity.",
            "Avoid directly adding the attacker’s user identity as an explicit member on many sensitive vaults, relying instead on group and service‑account membership to reduce visibility in per‑vault member lists.",
            "If SCIM Bridge is in use, ensure that any groups used for escalation are backed by stable IdP groups; if needed, adjust IdP membership or mappings so that SCIM sync will not later remove the attacker or service accounts from those groups.",
            "Validate escalated access by using CLI or Connect under the rescaled principals to read a small sample of items from newly accessible vaults, confirming that coverage is complete."
          ],
          "capabilities_used": [
            "Team and Business Account Administration",
            "Enterprise Password Manager for Workforce",
            "1Password Service Accounts",
            "Service Accounts Subsystem",
            "1Password Connect Servers and SDKs",
            "Automated Provisioning via SCIM Bridge",
            "1Password CLI"
          ],
          "interfaces_used": [
            "Admin console vault and group management screens",
            "Service account and Connect configuration interfaces",
            "SCIM Bridge/Provisioning settings pages",
            "1Password CLI for scripted permission changes and verification"
          ],
          "data_accessed": [
            "Vault ACLs before and after modification",
            "Group membership lists and IdP–1Password mapping rules",
            "Service account scopes and tokens",
            "Sample items from newly accessible vaults"
          ],
          "preconditions_required": [
            "Admin role with rights to modify vault memberships and manage service accounts.",
            "Existing groups/service accounts that already look legitimate and can be repurposed.",
            "Visibility into SCIM mappings if SCIM is present."
          ],
          "constraints_encountered": [
            "All ACL and service‑account changes are logged and may be exported to SIEM.",
            "SCIM may overwrite local group membership if changes conflict with IdP state.",
            "Over‑broad changes (e.g., adding global groups to ultra‑sensitive vaults) may be noticed in audits."
          ],
          "evasion_considerations": [
            "Make small, incremental changes, spreading them over time and vaults.",
            "Leverage existing automation/service accounts instead of creating obviously privileged new ones.",
            "Grant read‑only roles where possible and align changes with plausible business reasons (e.g., new automation rollout)."
          ]
        },
        {
          "tactic_name": "Collection (TA0009)",
          "method_steps": [
            "Prepare an attacker‑controlled VM or CI runner with 1Password CLI installed and network access to 1Password SaaS and any accessible Connect servers.",
            "Load the inventory of target vault IDs and item categories produced during discovery into a local script or configuration file.",
            "Authenticate the CLI as the compromised admin and as any over‑privileged service accounts by passing tokens or using stored profiles, and verify access with a small test query.",
            "For each target vault, use CLI commands to list all items and filter on high‑value categories (logins, API credentials, SSH keys, database credentials, secure notes, documents).",
            "Iterate through the filtered item list and fetch full item details as JSON, parsing out secret‑bearing fields (passwords, API keys, SSH private keys, certificates, recovery phrases, etc.) and TOTP seeds.",
            "In parallel, call any reachable 1Password Connect servers using their access tokens and SDKs to enumerate items from vaults now in scope, repeating the same parse-and-extract process.",
            "Normalize and store all harvested values into encrypted local storage (e.g., an encrypted archive or database) grouped by vault, system, and credential type, ready for later use or exfiltration.",
            "Optionally schedule the script as a recurring job to pull only updated or newly created items at intervals, maintaining an up‑to‑date secret cache while keeping ongoing read volume modest."
          ],
          "capabilities_used": [
            "Secure Item Types and Digital Wallet",
            "Two-Factor Authenticator (One-Time Passwords)",
            "Enterprise Password Manager for Workforce",
            "1Password CLI",
            "1Password Service Accounts",
            "1Password Connect Servers and SDKs",
            "CLI- and Service-Account–Driven Secret Automation"
          ],
          "interfaces_used": [
            "1Password CLI batch item listing and get commands",
            "Service account token authentication to CLI",
            "1Password Connect REST API and SDKs"
          ],
          "data_accessed": [
            "Login usernames/passwords for internal and external services",
            "API keys, OAuth client secrets, and database credentials",
            "SSH private keys and associated metadata",
            "Secure note contents and attached documents",
            "TOTP shared secrets for MFA accounts"
          ],
          "preconditions_required": [
            "Escalated read access to all targeted vaults under at least one identity (admin or service account).",
            "CLI configured for non‑interactive authentication on the attacker host.",
            "Network reachability to 1Password SaaS and any targeted Connect servers."
          ],
          "constraints_encountered": [
            "High‑volume item reads generate many audit events that may stand out.",
            "API rate limits or performance throttling may slow aggressive collection.",
            "Some document/attachment downloads are large and more conspicuous."
          ],
          "evasion_considerations": [
            "Throttle item reads and spread large pulls over time and across identities.",
            "Run collection from hosts and agents that already have legitimate 1Password automation traffic.",
            "Focus on truly high‑value vaults first to minimize volume while achieving impact."
          ]
        },
        {
          "tactic_name": "Exfiltration (TA0010)",
          "method_steps": [
            "On the attacker‑controlled host that performed collection, package all harvested secrets into one or more compressed archives, separating by sensitivity if desired (e.g., infra keys vs. general logins).",
            "Encrypt the archives locally with a strong symmetric key or the attacker’s public key so that even if host artifacts are discovered later, raw secrets are not trivially readable.",
            "Choose an exfiltration channel that blends with normal outbound traffic from that environment—such as HTTPS uploads to a large public cloud storage provider or code‑hosting service rather than a bespoke C2 domain.",
            "Upload encrypted archives over HTTPS using client tools or scripts (curl, SDKs, cloud CLIs) from the same infrastructure that normally runs CI/CD or administration tasks, so source IPs and TLS fingerprints appear routine.",
            "Optionally, split archives into smaller chunks and distribute across multiple destinations (e.g., multiple cloud buckets or paste‑like services) to avoid suspiciously large single transfers.",
            "Once uploads are verified, securely wipe or overwrite local copies and intermediate files and logs that might contain plaintext secrets or item JSON, retaining only what is necessary for continued, lower‑volume incremental collection."
          ],
          "capabilities_used": [
            "CLI- and Service-Account–Driven Secret Automation (for running collection on automation hosts that have broad outbound network access)",
            "Cross-Platform Apps and Browser Extensions (to the extent an admin workstation is used as an exfiltration origin)",
            "Enterprise Password Manager for Workforce (as the original concentration point for all exfiltrated data)"
          ],
          "interfaces_used": [
            "Local OS networking stack on the automation host or CI runner",
            "Standard HTTPS clients (curl, cloud CLI/SDKs) to public cloud/SaaS endpoints",
            "Potentially, browser or desktop app upload workflows from an admin workstation"
          ],
          "data_accessed": [
            "Structured stash of harvested secrets (credentials, keys, secure notes, TOTP seeds)",
            "Any temporary JSON exports or logs containing item contents held on disk before exfiltration"
          ],
          "preconditions_required": [
            "Successful prior collection phase with local access to harvested data.",
            "Outbound HTTPS connectivity from the collection host to chosen cloud or C2 endpoints.",
            "Ability to run arbitrary scripts or tools on that host without restrictive egress controls."
          ],
          "constraints_encountered": [
            "Network egress monitoring or DLP at the organization may flag large, unusual uploads.",
            "Some CI runners or admin hosts may have outbound firewall restrictions or TLS inspection.",
            "Retaining large local archives increases forensic exposure if the host is later investigated."
          ],
          "evasion_considerations": [
            "Use widely trusted cloud providers and services (e.g., generic object storage) as exfiltration destinations to blend into normal traffic.",
            "Shape transfer sizes and timings to match typical CI/CD artifact uploads or backup jobs.",
            "Encrypt data before exfiltration and securely delete plaintext and verbose logs from disk after successful upload.",
            "If possible, piggyback on existing backup or artifact pipelines by injecting stolen data into their normal payloads, so no new outbound flows are created."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Compromise an over‑privileged 1Password Business administrator using stolen SSO credentials/MFA or a stolen Emergency Kit plus account password.",
        "Use the admin console and 1Password CLI to enumerate all vaults, users, groups, service accounts, and Connect servers and identify high‑value shared vaults.",
        "Quietly broaden access to sensitive vaults by modifying group memberships and service‑account scopes so that a small set of principals can read every target vault.",
        "Use 1Password CLI and Connect APIs under those principals to systematically harvest login credentials, API keys, SSH keys, secure notes, and TOTP secrets from all prioritized vaults.",
        "Compress and encrypt harvested data on an attacker‑controlled host, then exfiltrate it over HTTPS to attacker‑controlled cloud storage or C2 infrastructure while keeping 1Password‑side activity within normal admin/automation patterns."
      ]
    },
    {
      "scenario_name": "T1555.004 – CI/CD Secret Dump via Compromised 1Password Service Account and Connect",
      "hypothesis": {
        "scenario_name": "T1555.004 – CI/CD Secret Dump via Compromised 1Password Service Account and Connect",
        "attack_target": "Steal infrastructure and CI/CD secrets (API keys, database credentials, cloud access keys, SSH keys) managed by 1Password and exposed to pipelines and applications via service accounts, CLI, and Connect, then exfiltrate them from the CI/CD or runtime environment.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Exfiltration (TA0010)",
        "preconditions": "The victim uses 1Password Service Accounts + CLI and/or 1Password Connect to inject secrets into CI/CD pipelines and applications. Service‑account tokens and Connect access tokens are stored in pipeline settings, environment variables, or configuration files on build agents or application hosts. The attacker has compromised at least one CI/CD runner, deployment pipeline configuration, or application host.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Steal 1Password Service Account or Connect Tokens from CI/CD or Runtime",
            "step_description": "From a compromised CI/CD runner or application host, locate 1Password service‑account credentials or Connect access tokens in environment variables, config files, or secret stores.",
            "step_mitre_technique": "T1528 – Steal Application Access Token; T1552.001 – Unsecured Credentials: Credentials in Files",
            "step_mitre_tactic": "Initial Access (TA0001) in 1Password context"
          },
          {
            "step_name": "Enumerate Accessible Vaults and Items with CLI/Connect",
            "step_description": "Use the stolen tokens with 1Password CLI or Connect REST APIs to list all vaults and items within the service account’s or Connect server’s scope and identify high‑value secrets.",
            "step_mitre_technique": "T1555.004 – Credentials from Password Stores: Cloud Secrets Management Stores; T1087 – Account Discovery",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Automate Secret Retrieval Across All Scoped Vaults",
            "step_description": "Script bulk retrieval of all API credentials, database passwords, SSH keys, and other secrets from the accessible vaults using the stolen service‑account and/or Connect tokens.",
            "step_mitre_technique": "T1119 – Automated Collection; T1555.004 – Credentials from Cloud Secrets Managers",
            "step_mitre_tactic": "Collection (TA0009)"
          },
          {
            "step_name": "Exfiltrate Secrets via CI/CD or Application Egress",
            "step_description": "Embed stolen secrets into build artifacts, logs, or outbound HTTPS requests to attacker‑controlled endpoints from the compromised CI/CD runner or app host.",
            "step_mitre_technique": "T1020 – Automated Exfiltration; T1567 – Exfiltration Over Web Service",
            "step_mitre_tactic": "Exfiltration (TA0010)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001) – Steal Service Account / Connect Tokens",
          "method_steps": [
            "Compromise a CI/CD runner, pipeline configuration, or application host that is known (or suspected) to use 1Password CLI, service accounts, or Connect to obtain secrets.",
            "Inspect CI/CD configuration (pipeline definitions, project variables, secret stores) or application config for 1Password‑related environment variables and secrets (e.g., service‑account tokens, secret references, Connect URLs and tokens).",
            "Search filesystem on the compromised host (home directories, /etc, deployment directories, container images) for `.env` files, YAML/TOML/JSON configs, or shell scripts that embed 1Password service‑account tokens or Connect tokens.",
            "Capture any discovered 1Password service‑account tokens and Connect access tokens, along with tenant URLs and account identifiers, and test a simple CLI or API call from the compromised host to confirm they are valid.",
            "Optionally, pivot from the compromised host to any associated secrets management or orchestration layers (e.g., Kubernetes secrets, Terraform variables) that may also hold 1Password tokens used by Connect or CLI automation."
          ],
          "capabilities_used": [
            "1Password Service Accounts",
            "1Password CLI",
            "1Password Connect Servers and SDKs",
            "1Password Environments and Secret References",
            "CLI- and Service-Account–Driven Secret Automation"
          ],
          "interfaces_used": [
            "CI/CD configuration UIs and APIs (e.g., GitHub Actions, GitLab CI, Jenkins, etc.)",
            "Local filesystem and environment variables on build agents or app hosts",
            "1Password CLI authentication using service‑account tokens",
            "1Password Connect REST API authentication using Connect tokens"
          ],
          "data_accessed": [
            "Service‑account access tokens and associated account IDs",
            "1Password Connect API URLs and tokens",
            "Secret-reference strings mapping to 1Password items",
            "Existing runtime‑resolved secrets in CI/CD job environments"
          ],
          "preconditions_required": [
            "Compromise of at least one CI/CD runner, job configuration, or application host that uses 1Password integrations.",
            "Service‑account or Connect tokens are stored or accessible on those systems and not fully hardware‑isolated.",
            "Outbound connectivity from that environment to 1Password SaaS or internal Connect endpoints."
          ],
          "constraints_encountered": [
            "Tokens could be stored only in external secret managers with tight access controls.",
            "Connect endpoints might be reachable only from restricted networks.",
            "Some tokens may be scoped narrowly to a few vaults, limiting coverage."
          ],
          "evasion_considerations": [
            "Avoid modifying CI/CD pipelines; rely on read‑only inspection of configs and environment.",
            "Run token‑verifying CLI/Connect calls from the same hosts and user accounts that normally perform builds or deploys.",
            "Minimize noisy failed login attempts with obviously incorrect tokens."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "From the compromised host, authenticate 1Password CLI with the stolen service‑account token and list all vaults that the service account can access, capturing vault IDs and names.",
            "For each vault, use CLI to enumerate item titles and types, flagging high‑value categories (API Credential, Database, SSH Key, Server, etc.).",
            "If a Connect server token is available, send API requests to enumerate vaults and items exposed by that Connect instance and correlate them with CLI results.",
            "Build a map of vault → item types → number of items to quickly identify vaults rich in infrastructure and CI/CD secrets.",
            "Optionally, query Events API (if the service account has rights or logs exist in SIEM) to understand how frequently these vaults and items are accessed by automation, prioritizing those most used in production."
          ],
          "capabilities_used": [
            "1Password Service Accounts",
            "1Password CLI",
            "1Password Connect Servers and SDKs",
            "Secure Item Types and Digital Wallet",
            "1Password Events API (if accessible)"
          ],
          "interfaces_used": [
            "1Password CLI list commands for vaults and items",
            "1Password Connect REST API or SDKs",
            "Events API or existing SIEM dashboards for usage context"
          ],
          "data_accessed": [
            "List of vaults and items accessible to the service account/Connect token",
            "Item metadata (titles, URLs, categories)",
            "Usage statistics from audit logs (if consulted)"
          ],
          "preconditions_required": [
            "Valid, working service‑account or Connect tokens from the initial access phase.",
            "Permissions on those tokens to list items, not just read on demand via secret references."
          ],
          "constraints_encountered": [
            "Service‑account scopes may deliberately exclude some sensitive vaults.",
            "Connect instances might only be configured for a subset of vaults (e.g., only production)."
          ],
          "evasion_considerations": [
            "Throttle CLI/Connect list calls to resemble periodic automation rather than one‑off enumeration.",
            "Perform enumeration at times when CI/CD or apps normally run secret fetches (deployment windows)."
          ]
        },
        {
          "tactic_name": "Collection (TA0009)",
          "method_steps": [
            "Write a script that authenticates with the stolen service‑account token and iterates over each accessible vault ID obtained during discovery.",
            "For each vault, list items and filter for high‑value categories such as API Credential, Database, SSH Key, and any secrets labeled as production or critical.",
            "Fetch full item payloads via CLI or Connect API and parse out secret fields (API keys, DB credentials, SSH private keys, certificates, etc.).",
            "Store all harvested secrets in encrypted files or an attacker‑controlled in‑memory datastore on the compromised host.",
            "If the service account is used across multiple environments (e.g., prod and staging pipelines), repeat the process for each environment to maximize coverage."
          ],
          "capabilities_used": [
            "1Password Service Accounts",
            "1Password CLI",
            "1Password Connect Servers and SDKs",
            "Secure Item Types and Digital Wallet",
            "CLI- and Service-Account–Driven Secret Automation"
          ],
          "interfaces_used": [
            "1Password CLI item get commands",
            "1Password Connect REST API for item retrieval"
          ],
          "data_accessed": [
            "API keys and tokens used by CI/CD pipelines and applications",
            "Database usernames/passwords and connection strings",
            "SSH private keys for infrastructure access",
            "Other sensitive configuration secrets used in automation"
          ],
          "preconditions_required": [
            "Discovery of which vaults/items the stolen tokens can see.",
            "Sufficient token permissions to read item contents."
          ],
          "constraints_encountered": [
            "Bulk reads might increase observable API traffic or CI/CD runtime duration.",
            "Some pipelines might have runtime checks that fail if suspicious extra commands run."
          ],
          "evasion_considerations": [
            "Piggyback collection on existing CI/CD jobs (e.g., add a step within a compromised job) so that secret access appears as part of a normal run.",
            "Limit each run to a subset of vaults and rotate which are targeted to distribute volume.",
            "Encrypt and minimize local storage of secrets to reduce forensic footprint."
          ]
        },
        {
          "tactic_name": "Exfiltration (TA0010)",
          "method_steps": [
            "Package harvested secrets into encrypted archives on the compromised runner or host.",
            "Use existing CI/CD artifacts (e.g., build logs, artifacts, or container images) as a covert carrier: embed encrypted blobs in artifacts that are automatically uploaded to external artifact storage or registries the attacker can later access.",
            "Alternatively, send encrypted blobs via HTTPS from the compromised host to attacker‑controlled cloud storage or a dead‑drop service (e.g., object storage, paste‑like services) using general purpose tools already present in the environment.",
            "If egress controls are strict, encode stolen data into DNS queries, outbound webhook payloads, or telemetry messages that the environment is allowed to send, exfiltrating it slowly but stealthily.",
            "After confirming retrieval, securely delete temporary files and obfuscate scripts or pipeline modifications to reduce the chance of retrospective detection."
          ],
          "capabilities_used": [
            "Developer SDKs, CI/CD, and VS Code Integrations (for artifact and job workflows)",
            "CLI- and Service-Account–Driven Secret Automation (jobs that already send artifacts/logs externally)",
            "SIEM, Slack, and other outbound integrations as potential covert carriers"
          ],
          "interfaces_used": [
            "CI/CD artifact upload mechanisms and external registries",
            "Standard HTTPS connections to public cloud/SaaS endpoints",
            "Any allowed webhook/telemetry channels from the CI/CD system"
          ],
          "data_accessed": [
            "Encrypted bundles of CI/CD and infrastructure secrets collected from 1Password"
          ],
          "preconditions_required": [
            "Completed local collection and access to outbound network channels from the compromised environment.",
            "Ability to modify or insert steps into CI/CD pipelines or application code paths, or to run arbitrary tools on the host."
          ],
          "constraints_encountered": [
            "DLP or egress monitoring may inspect artifacts and outbound payloads for anomalies.",
            "Large or unusual artifacts might be noticed by developers or ops teams."
          ],
          "evasion_considerations": [
            "Match artifact sizes and upload timing to typical build patterns.",
            "Prefer encrypted exfiltration channels that defenders cannot easily inspect for content.",
            "Use incremental exfiltration across many jobs/runs to avoid conspicuous spikes."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Compromise a CI/CD runner or application host that uses 1Password integrations.",
        "Steal 1Password service‑account and/or Connect tokens from configuration, environment variables, or secret stores on that host.",
        "Use the stolen tokens with 1Password CLI and/or Connect APIs to enumerate all accessible vaults and items and identify high‑value infrastructure secrets.",
        "Script automated retrieval of API keys, database credentials, SSH keys, and other secrets from those vaults onto the compromised host.",
        "Embed or upload encrypted bundles of stolen secrets via normal CI/CD artifact flows or HTTPS to attacker‑controlled destinations."
      ]
    },
    {
      "scenario_name": "T1098 – SaaS Privilege Escalation via Trelica Workflow and Access-Review Abuse",
      "hypothesis": {
        "scenario_name": "T1098 – SaaS Privilege Escalation via Trelica Workflow and Access-Review Abuse",
        "attack_target": "Leverage Trelica by 1Password to silently grant the attacker administrative roles in one or more high‑value SaaS applications (e.g., Salesforce, Google Workspace, Slack) by manipulating SaaS governance workflows and access reviews, without directly compromising the SaaS apps.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Privilege Escalation (TA0004)",
        "preconditions": "The organization uses Trelica by 1Password for SaaS governance and automates onboarding/offboarding and access changes via workflows and access reviews. Trelica connectors are authorized to manage users/roles in major SaaS apps. The attacker can obtain Trelica admin‑level access (for example via stolen SSO credentials stored in 1Password).",
        "attack_flow_hypothesis": [
          {
            "step_name": "Compromise Trelica Admin Account",
            "step_description": "Steal credentials/MFA for a Trelica administrator (often via 1Password compromise or IdP SSO phishing) and sign into the Trelica admin console.",
            "step_mitre_technique": "T1078 – Valid Accounts",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Map SaaS Inventory, Roles, and Workflows",
            "step_description": "Use Trelica dashboards to discover all connected SaaS apps, existing role assignments, and workflow definitions that manage provisioning and access reviews.",
            "step_mitre_technique": "T1526 – Cloud Service Discovery; T1087 – Account Discovery; T1069 – Permission Groups Discovery",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Manipulate Workflows and Access Reviews to Grant Elevated Roles",
            "step_description": "Alter onboarding workflows, access‑change workflows, or access‑review logic so that the attacker’s identity (or a new backdoor account) is automatically granted admin roles in selected SaaS apps.",
            "step_mitre_technique": "T1098 – Account Manipulation; T1136.003 – Create Account: Cloud Account; T1078.004 – Valid Accounts: Cloud Accounts",
            "step_mitre_tactic": "Privilege Escalation (TA0004)"
          },
          {
            "step_name": "Establish Persistence via Governance Backdoors",
            "step_description": "Create additional workflows or rules ensuring that if elevated access is later removed, Trelica will regrant it during future reviews or lifecycle events, and optionally create shadow admin accounts.",
            "step_mitre_technique": "T1098 – Account Manipulation; T1136 – Create Account",
            "step_mitre_tactic": "Persistence (TA0003)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001)",
          "method_steps": [
            "Identify which IdP and SSO apps are used for Trelica by reviewing public documentation, internal screenshots, or 1Password vault items describing Trelica onboarding.",
            "From a prior or parallel 1Password compromise, locate Trelica login URLs, tenant names, and any stored Trelica or IdP credentials (login items for Trelica, Okta, Entra, etc.).",
            "Phish a Trelica administrator or IT/Security owner with an IdP‑themed or Trelica‑themed lure to capture SSO credentials and MFA responses, or reuse already‑stolen IdP admin credentials that have access to Trelica.",
            "Sign into the IdP and then into Trelica’s admin portal using the compromised credentials, confirming admin or configuration rights in the Trelica UI.",
            "Optionally, create a local Trelica session token or API key (if supported) for use in later scripted interactions with Trelica APIs or the MCP server."
          ],
          "capabilities_used": [
            "Trelica by 1Password (SaaS Governance and Spend Optimization)",
            "Identity Provider and Authentication Integrations",
            "Enterprise Password Manager for Workforce (as the store for Trelica/IdP credentials)"
          ],
          "interfaces_used": [
            "IdP SSO login pages for Trelica",
            "Trelica admin dashboards (discovery, workflows, access reviews)"
          ],
          "data_accessed": [
            "Trelica admin account credentials and associated IdP SSO assertions",
            "Trelica tenant URLs and organization identifiers"
          ],
          "preconditions_required": [
            "Trelica is deployed and integrated with the organization’s IdP.",
            "At least one Trelica admin account exists and uses SSO or stored credentials.",
            "Attacker can obtain those credentials or their IdP equivalent."
          ],
          "constraints_encountered": [
            "Strong MFA or hardware tokens at the IdP increase difficulty of compromise.",
            "Trelica may log admin sign‑ins and unusual locations."
          ],
          "evasion_considerations": [
            "Reuse victim’s typical IdP sign‑in location and time‑of‑day patterns.",
            "Minimize initial changes in Trelica on first login; perform reconnaissance first."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "In Trelica’s discovery dashboards, view the full catalog of SaaS and AI applications, noting which are marked as business‑critical and which show Trelica has write‑capable connectors.",
            "Open user‑to‑application relationship views to identify existing admins and privileged roles per app (e.g., Salesforce Admin, Workspace Super Admin, Slack Owner).",
            "Inspect workflow definitions for onboarding, offboarding, and access changes, looking for those that create or update accounts in target SaaS apps and the conditions that trigger them.",
            "Review access review campaigns to see how decisions (approve/revoke/keep elevated) map to automated actions on connected SaaS apps.",
            "If Trelica MCP Server is configured, use it (or an attached AI agent) to export current assignments and roles as a machine‑readable inventory, further clarifying which apps and identities are most valuable."
          ],
          "capabilities_used": [
            "Trelica by 1Password (SaaS Governance and Spend Optimization)",
            "Trelica SaaS Governance Administration",
            "Trelica SaaS Discovery and Workflow Automation",
            "Trelica MCP Server for AI Integrations"
          ],
          "interfaces_used": [
            "Trelica admin dashboards (discovery, access, workflows, access reviews)",
            "Trelica MCP Server endpoint (if available)"
          ],
          "data_accessed": [
            "Catalog of SaaS/AI applications and their criticality",
            "User‑to‑application mappings and role/entitlement levels",
            "Workflow definitions and triggers",
            "Access review scopes and historical decisions"
          ],
          "preconditions_required": [
            "Trelica admin access from the initial access phase.",
            "Connectors configured for the SaaS apps of interest."
          ],
          "constraints_encountered": [
            "Some apps may be discovery‑only; Trelica might not be able to change their access.",
            "MCP integration may not be enabled or may use reduced‑scope accounts."
          ],
          "evasion_considerations": [
            "Avoid exporting full datasets when not necessary; browse incrementally.",
            "Blend exploration with normal admin actions (e.g., reviewing existing workflows)."
          ]
        },
        {
          "tactic_name": "Privilege Escalation (TA0004)",
          "method_steps": [
            "Identify one or more target SaaS applications where Trelica workflows are authorized to create or modify accounts/roles and where an escalation will have high value (e.g., productivity suite, CRM, identity provider).",
            "Select a victim identity to elevate—either the attacker’s compromised user, another compromised identity, or a newly created low‑profile account that already exists across the org.",
            "Edit onboarding or role‑change workflows so that when certain conditions are met (e.g., membership in a group, department tag, campaign outcome), the workflow grants admin‑level or owner‑level roles in the target SaaS to the chosen identity.",
            "Modify access‑review campaigns to either (a) default to “keep” elevated access for the attacker’s identity or (b) auto‑approve any suggested role upgrades tied to that identity.",
            "Trigger the modified workflow: for example, adjust the victim’s attributes in the source system (IdP/HRIS) so that Trelica executes the workflow and pushes the elevated assignment to the SaaS via its connector.",
            "Log into the target SaaS directly (using valid credentials or SSO) as the now‑elevated account to verify that admin/owner privileges have been granted."
          ],
          "capabilities_used": [
            "Trelica SaaS Governance Administration",
            "Trelica SaaS Discovery and Workflow Automation",
            "Access Reviews in Trelica",
            "Identity Provider and Authentication Integrations"
          ],
          "interfaces_used": [
            "Trelica workflow configuration UI",
            "Trelica access‑review configuration and decision UI",
            "Trelica connectors to SaaS apps and IdPs"
          ],
          "data_accessed": [
            "Workflow logic and action definitions targeting specific SaaS apps",
            "Access‑review scopes and decision mappings",
            "User identity attributes and group assignments feeding workflows"
          ],
          "preconditions_required": [
            "Trelica admin permissions to modify workflows and access reviews.",
            "Connectors with sufficient privileges in target SaaS apps to change roles.",
            "An identity that can be plausibly elevated without immediate suspicion."
          ],
          "constraints_encountered": [
            "Changes to workflows and access reviews are auditable within Trelica.",
            "Downstream SaaS apps may have their own logging and anomaly detection for new admins."
          ],
          "evasion_considerations": [
            "Make minimal, targeted changes to existing workflows instead of creating obviously malicious new ones.",
            "Tie escalation conditions to plausible business logic (e.g., membership in a leadership group).",
            "Delay use of new admin privileges and spread actions over time to look like routine admin work."
          ]
        },
        {
          "tactic_name": "Persistence (TA0003)",
          "method_steps": [
            "Create or modify additional Trelica workflows such that when certain periodic events occur (e.g., re‑onboarding, department change, license optimization runs), they reassert the attacker’s elevated SaaS roles if they have been removed.",
            "Adjust license‑optimization rules so they never flag the attacker’s SaaS accounts for downgrade or removal, even if utilization appears low.",
            "Add a low‑visibility secondary account (e.g., a generic ops or bot account) into privileged SaaS roles using the same mechanism, ensuring a backup admin if the main identity is revoked.",
            "Ensure access‑review campaigns are configured so that reviewer assignments for the attacker’s entitlements go to a sympathetic or compromised reviewer (or are automatically approved), reducing the chance that reviewers remove elevated access.",
            "Regularly check Trelica dashboards and SaaS admin consoles to confirm that elevated roles remain in place or are restored after any changes, adjusting workflows as necessary."
          ],
          "capabilities_used": [
            "Trelica SaaS Governance Administration",
            "Trelica SaaS Discovery and Workflow Automation",
            "Trelica SaaS Inventory and License Optimization",
            "Access Reviews in Trelica"
          ],
          "interfaces_used": [
            "Trelica workflow and policy configuration UIs",
            "Trelica access‑review scheduling and assignment UIs"
          ],
          "data_accessed": [
            "Workflow and policy configuration governing account lifecycle and license optimization",
            "Access‑review assignments and historical decisions for high‑privilege roles"
          ],
          "preconditions_required": [
            "Successful initial privilege escalation in at least one target SaaS app.",
            "Ongoing Trelica admin control to adjust workflows and policies."
          ],
          "constraints_encountered": [
            "Periodic governance reviews might scrutinize unusual workflow logic.",
            "External compliance or audit teams may request independent review of admin-role assignments."
          ],
          "evasion_considerations": [
            "Keep persistence logic subtle (e.g., conditional re‑granting under rare conditions) rather than always forcing elevation.",
            "Align long‑lived elevated roles with job titles or responsibilities that appear plausible for the chosen identities.",
            "Ensure that additional backdoor accounts blend into existing naming conventions and groups."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Compromise a Trelica administrator through stolen SSO or credentials stored in 1Password.",
        "Use Trelica’s discovery and governance views (and optionally MCP) to map all SaaS apps, roles, and automation workflows.",
        "Quietly modify onboarding/access‑change workflows and access‑review logic so that a chosen identity is granted admin‑level roles in one or more high‑value SaaS apps.",
        "Trigger those workflows via attribute/group changes, then log into the SaaS apps to verify elevated privileges.",
        "Create subtle, long‑lived workflow and review rules that automatically regrant or preserve these admin roles for persistence."
      ]
    },
    {
      "scenario_name": "T1556/T1562 – Device Trust Bypass to Access SSO-Protected SaaS from a Rogue Device",
      "hypothesis": {
        "scenario_name": "T1556/T1562 – Device Trust Bypass to Access SSO-Protected SaaS from a Rogue Device",
        "attack_target": "Use a stolen corporate SSO identity to access high‑value SaaS and web apps from an unmanaged or compromised device by weakening or routing around 1Password Device Trust and Extended Access Management enforcement.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Collection (TA0009)",
        "preconditions": "The organization uses 1Password Device Trust and Extended Access Management to gate access to key SaaS apps via IdP integrations. The attacker has valid SSO credentials (and MFA) for an end user or admin but their current device would normally be considered non‑compliant. At least one privileged identity has admin rights over Device Trust / Extended Access or IdP app configuration.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Obtain Valid SSO Credentials for a User in Scope of Device Trust",
            "step_description": "Steal or phish SSO credentials/MFA for a user whose access to protected apps is normally subject to Device Trust and Extended Access policies.",
            "step_mitre_technique": "T1078 – Valid Accounts",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Discover Device Trust and Extended Access Policy Surface",
            "step_description": "From within the 1Password Business admin console and IdP, enumerate Device Trust checks, covered applications, policy mappings, and any exemptions.",
            "step_mitre_technique": "T1526 – Cloud Service Discovery; T1087 – Account Discovery",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Weaken or Route Around Device Trust Enforcement",
            "step_description": "Modify Device Trust/Extended Access settings or IdP app configurations so that the attacker’s device is treated as compliant or the target SaaS apps no longer require device assurance.",
            "step_mitre_technique": "T1556 – Modify Authentication Process; T1553 – Subvert Trust Controls",
            "step_mitre_tactic": "Defense Evasion (TA0005)"
          },
          {
            "step_name": "Access Protected SaaS Apps and Collect Data",
            "step_description": "Use the now‑unblocked SSO flows from the rogue device to sign into protected SaaS apps and download sensitive data or configure further backdoors.",
            "step_mitre_technique": "T1078 – Valid Accounts; T1114 – Email Collection / T1213.003 – Data from Cloud-Based Repositories (depending on app)",
            "step_mitre_tactic": "Collection (TA0009)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001)",
          "method_steps": [
            "Target users whose access is known to be governed by Device Trust (e.g., based on internal comms or error messages mentioning device compliance) and who have valuable SaaS access (finance, HR, engineering).",
            "Phish one or more such users with realistic IdP or VPN login prompts to capture their SSO credentials and either immediate or relayable MFA factors.",
            "Attempt standard SSO login to a protected app from the attacker’s unmanaged device; observe any Device Trust block messages to confirm policy enforcement.",
            "If another machine within the victim network is already compromised and Device Trust‑compliant, use it as an initial foothold to explore policies while preparing to weaken them for the attacker’s external device."
          ],
          "capabilities_used": [
            "Identity Provider and Authentication Integrations",
            "Device Trust (Core and Connect)",
            "Extended Access Management Platform"
          ],
          "interfaces_used": [
            "IdP SSO login pages for corporate apps and 1Password",
            "SSO error and Device Trust block pages"
          ],
          "data_accessed": [
            "Valid SSO credentials and MFA for one or more users in Device Trust policy scope"
          ],
          "preconditions_required": [
            "Organization uses an IdP integrated with 1Password Device Trust/Extended Access.",
            "Attacker can capture at least one user’s IdP credentials and MFA."
          ],
          "constraints_encountered": [
            "Device Trust may already block the attacker’s environment, requiring higher‑privilege access to change policies.",
            "SSO and Device Trust events are likely logged and may feed into SIEM."
          ],
          "evasion_considerations": [
            "Prefer compromising a user who already uses multiple devices to make new device usage less suspicious.",
            "Use infrastructure with similar geolocation to the user’s normal sign‑in patterns."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "Leverage a compromised user that also has 1Password or security admin rights—or escalate to such an account through a parallel scenario—to log into the 1Password Business admin console.",
            "Navigate to Device Trust configuration and Extended Device Compliance screens to list defined posture checks, enforcement modes (block vs remediate), and the apps/websites covered.",
            "View which IdPs and VPNs are integrated (e.g., Okta, Entra ID, Tailscale) and which SSO apps rely on Device Trust signals.",
            "Inspect Extended Access Management dashboards to see identity–app–device relationships and note any groups or identities exempted from device checks.",
            "In the IdP admin console, inspect SSO and SCIM app definitions for 1Password and protected SaaS apps to confirm how Device Trust is invoked (e.g., as a conditional access control or external signal) and whether alternate non‑Device‑Trust‑gated SSO flows exist."
          ],
          "capabilities_used": [
            "Device Trust Administration and Extended Device Compliance",
            "Extended Access Management Platform",
            "Identity Provider and Authentication Integrations",
            "Team and Business Account Administration"
          ],
          "interfaces_used": [
            "1Password Business admin console Device Trust/Extended Access settings",
            "IdP admin portals for SSO and conditional access"
          ],
          "data_accessed": [
            "List of Device Trust checks and enforcement modes",
            "Mapping of identities and apps to Device Trust and Extended Access policies",
            "SSO app and conditional access configurations that incorporate Device Trust"
          ],
          "preconditions_required": [
            "Administrative access to 1Password Device Trust / Extended Access settings or IdP config.",
            "Initial compromised identity can be escalated or pivoted to such an admin."
          ],
          "constraints_encountered": [
            "Policy views and change rights may be restricted to a small number of security admins.",
            "Configuration changes are logged and possibly monitored."
          ],
          "evasion_considerations": [
            "Limit initial discovery to viewing configuration without making changes.",
            "Avoid downloading large configuration exports if they would be anomalous."
          ]
        },
        {
          "tactic_name": "Defense Evasion (TA0005)",
          "method_steps": [
            "In Device Trust, relax or disable specific checks that are blocking the attacker’s device (e.g., OS version, disk encryption) or change enforcement from \"block\" to \"warn/remediate\" for the relevant tags or device groups.",
            "Remove target SaaS apps from Extended Device Compliance coverage or reclassify them so they are treated as unmanaged/unprotected, effectively bypassing Device Trust for those apps.",
            "In Extended Access policies, carve out a group (or specific user) that is exempt from Device Trust requirements, then ensure the compromised identity is placed in that group via IdP groups or SCIM mappings.",
            "In the IdP, adjust conditional access policies or SSO app definitions so that the 1Password/Device Trust integration is not consulted for the attacker’s sessions—for example, by modifying conditions on device compliance attributes or network ranges.",
            "Optionally, ensure Device Trust/Extended Access logging and alerting is narrowed or Events Reporting for related configuration changes is disabled or redirected if the attacker has sufficient rights."
          ],
          "capabilities_used": [
            "Device Trust (Core and Connect)",
            "Device Trust Administration and Extended Device Compliance",
            "Extended Access Management Platform",
            "Identity Provider and Authentication Integrations",
            "Security Policies and Business Settings",
            "Events Reporting and SIEM Integrations"
          ],
          "interfaces_used": [
            "Device Trust and Extended Device Compliance configuration UIs",
            "Extended Access Management policy configuration",
            "IdP conditional‑access and SSO app configuration interfaces",
            "Events Reporting/Events API and SIEM integration settings"
          ],
          "data_accessed": [
            "Device compliance and policy configurations",
            "Group and exemption mappings for Device Trust/Extended Access",
            "Conditional‑access rules in the IdP related to device state"
          ],
          "preconditions_required": [
            "Administrative control over Device Trust/Extended Access and/or IdP policies.",
            "Ability to assign the attacker’s account into appropriate groups or exemptions."
          ],
          "constraints_encountered": [
            "Material changes in device and access policies may be noticed by security teams.",
            "Some apps might require device assurance regardless of Trelica/1Password settings (app‑side policy)."
          ],
          "evasion_considerations": [
            "Make narrowly scoped, reversible policy changes targeting only a subset of users/apps.",
            "Align changes with plausible operational narratives (e.g., temporary relaxation for a rollout).",
            "Avoid disabling Device Trust globally; instead, carve out precise bypasses."
          ]
        },
        {
          "tactic_name": "Collection (TA0009)",
          "method_steps": [
            "From the attacker’s rogue device, initiate SSO flows to protected SaaS apps (e.g., email, document storage, CRM) that were previously blocked by Device Trust.",
            "Use the stolen SSO credentials and now‑weakened Device Trust/Extended Access enforcement to log into these apps without being challenged for compliant‑device posture.",
            "Within each SaaS app, search and export sensitive data: mailboxes, file repositories, CRM datasets, or admin configuration that can be used for further attacks.",
            "Optionally, create API tokens or app passwords from within these SaaS apps for later automated access that no longer depends on interactive SSO from the rogue device."
          ],
          "capabilities_used": [
            "Extended Access Management Platform (for initial mapping of app protections)",
            "Device Trust (as a gate now bypassed)",
            "Identity Provider and Authentication Integrations"
          ],
          "interfaces_used": [
            "SSO login flows from the attacker’s unmanaged device",
            "Web UIs and APIs of protected SaaS applications"
          ],
          "data_accessed": [
            "Emails, files, CRM records, or other SaaS‑resident sensitive data",
            "Newly created SaaS API tokens/app passwords for persistence"
          ],
          "preconditions_required": [
            "Device Trust and Extended Access policies have been weakened or bypassed for the attacker’s identity/apps.",
            "The attacker still holds valid SSO session or can re‑authenticate."
          ],
          "constraints_encountered": [
            "SaaS apps may still enforce their own risk‑based or device checks.",
            "Bulk export actions may be logged and flagged within those apps."
          ],
          "evasion_considerations": [
            "Favor in‑app browsing and targeted exports over huge one‑time dumps.",
            "Spread data access over time to resemble normal heavy user behavior."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Steal SSO credentials and MFA for a user subject to Device Trust and Extended Access policies.",
        "Gain or pivot to an account with admin rights over 1Password Device Trust/Extended Access or the IdP and map how device assurance is enforced for key apps.",
        "Quietly relax or route around Device Trust enforcement (e.g., by exempting the attacker’s account, removing certain apps from coverage, or weakening IdP conditional‑access rules).",
        "From an unmanaged or compromised device, use SSO to access previously protected SaaS apps, then browse and export sensitive data and create additional access tokens for future use."
      ]
    },
    {
      "scenario_name": "T1550.001 – Events API Token Theft for Tenant Recon and Monitoring Evasion",
      "hypothesis": {
        "scenario_name": "T1550.001 – Events API Token Theft for Tenant Recon and Monitoring Evasion",
        "attack_target": "Steal 1Password Events API / Events Reporting tokens to continuously harvest detailed audit logs (sign‑ins, admin changes, item‑access events), use them for reconnaissance on high‑value identities and vaults, and potentially reconfigure monitoring to reduce chances of subsequent detection.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Discovery (TA0007)",
        "preconditions": "The organization has enabled Events Reporting and integrated 1Password with a SIEM using the Events API. One or more Events API tokens are stored in 1Password vaults, SIEM or connector configs, or on integration hosts. The attacker can compromise either a 1Password admin with Events Reporting rights or a system that holds Events Reporting configuration.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Compromise Events Reporting Admin or Connector Host",
            "step_description": "Obtain access to either a 1Password Business admin who manages Events Reporting or to the SIEM/integration host that stores Events API tokens.",
            "step_mitre_technique": "T1078 – Valid Accounts; T1204 – User Execution (for malware on connector hosts)",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Steal Events API Tokens",
            "step_description": "Locate and extract Events API tokens or API Credential items from 1Password or from configuration files/environment variables on the connector host.",
            "step_mitre_technique": "T1550.001 – Use Alternate Authentication Material; T1552.001 – Unsecured Credentials: Credentials in Files; T1555.005 – Credentials from Password Managers",
            "step_mitre_tactic": "Credential Access (TA0006)"
          },
          {
            "step_name": "Harvest Audit Logs via Events API",
            "step_description": "Use the stolen tokens to query the Events API directly from attacker infrastructure, pulling sign‑in, item‑access, and admin‑change events for reconnaissance and target selection.",
            "step_mitre_technique": "T1530 – Data from Cloud Storage Object; T1119 – Automated Collection",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Optionally Impair Monitoring",
            "step_description": "If possible, adjust Events Reporting or SIEM ingestion so that future suspicious activity is not or only partially logged or alerted on.",
            "step_mitre_technique": "T1562.008 – Impair Defenses: Disable or Modify Cloud Logs; T1098 – Account Manipulation",
            "step_mitre_tactic": "Defense Evasion (TA0005)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001)",
          "method_steps": [
            "Identify which team operates Events Reporting and SIEM integrations (e.g., SecOps, Platform Engineering) via documentation or internal org charts, and find associated 1Password admins and integration hosts.",
            "Phish or otherwise compromise a 1Password Business admin with rights to configure Events Reporting and SIEM integrations, or compromise a SIEM/integration host using malware, RCE, or credentials already obtained from another vector.",
            "On a compromised admin account, log into the 1Password Business admin console and verify that Events Reporting is enabled and SIEM integrations are configured.",
            "On a compromised connector host, confirm that scripts or collectors are running jobs that periodically call 1Password Events API and forward data to SIEM."
          ],
          "capabilities_used": [
            "Team and Business Account Administration",
            "Events Reporting and SIEM Integrations",
            "1Password Events API"
          ],
          "interfaces_used": [
            "1Password Business admin console (Events Reporting/Integrations settings)",
            "SIEM or connector host OS and configuration files"
          ],
          "data_accessed": [
            "Admin login session or OS‑level access on connector host",
            "Overview of existing Events Reporting configuration"
          ],
          "preconditions_required": [
            "Events Reporting is enabled and at least one Events API token exists.",
            "Either a 1Password admin or the integration host can be compromised."
          ],
          "constraints_encountered": [
            "Events Reporting is optional and may not be deployed in all tenants.",
            "High‑privilege accounts and integration hosts may have additional monitoring."
          ],
          "evasion_considerations": [
            "Favor compromising integration hosts, which may be less interactive and more static, over highly monitored admin workstations.",
            "Minimize visible changes in the admin console during reconnaissance."
          ]
        },
        {
          "tactic_name": "Credential Access (TA0006)",
          "method_steps": [
            "If acting as a compromised admin, search business vaults for API Credential items referencing Events API, SIEM, or Splunk/Elastic connectors, and display those items in 1Password apps or CLI.",
            "Extract any Events API tokens or API keys from those items and store them securely on an attacker‑controlled host.",
            "On a compromised connector host, inspect scripts (e.g., Python, shell) and config files for hard‑coded or environment‑substituted Events API tokens and endpoints.",
            "Dump relevant environment variables and credentials stores (CI/CD variables, OS keyrings) that may hold the Events API tokens used by collectors.",
            "Verify that the tokens are valid using a test HTTP request against the Events API endpoints."
          ],
          "capabilities_used": [
            "Secure Item Types and Digital Wallet (API Credential items)",
            "1Password CLI",
            "Events Reporting Streaming to SIEM"
          ],
          "interfaces_used": [
            "1Password apps/CLI to read API Credential items",
            "Connector host filesystem and environment",
            "Events API HTTP endpoints"
          ],
          "data_accessed": [
            "Events API bearer tokens/API keys",
            "Events API endpoint URLs and tenant identifiers"
          ],
          "preconditions_required": [
            "Events API tokens are stored either in 1Password vaults or on connector hosts.",
            "Attacker has rights or OS‑level access sufficient to read those locations."
          ],
          "constraints_encountered": [
            "Tokens may be stored only inside dedicated secret stores with strict access controls.",
            "Rotation of tokens during attack may invalidate them unexpectedly."
          ],
          "evasion_considerations": [
            "Avoid editing or rotating tokens from the admin console; simply read and reuse them.",
            "Do not disable or stop existing collectors while extracting tokens."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "From an attacker‑controlled host, send authenticated HTTPS requests to the Events API using the stolen token, starting with a small time window (e.g., last 24–72 hours) to verify scope.",
            "Harvest sign‑in events to identify admin/owner accounts, privileged service accounts, and high‑activity users, clustering by IP range, device, and geography.",
            "Harvest vault and item‑access events to see which vaults and items are most frequently accessed and by which principals, particularly focusing on service accounts and Connect servers.",
            "Harvest admin‑action events to see recent changes in vault permissions, service‑account scopes, SCIM/SSO configuration, and Device Trust settings to understand current security posture and potential misconfigurations.",
            "Iteratively expand the time range and paginate through events to build a full historical view, storing logs in attacker‑controlled storage for offline analysis."
          ],
          "capabilities_used": [
            "1Password Events API",
            "Events Reporting and SIEM Integrations",
            "Events and Audit Logs"
          ],
          "interfaces_used": [
            "Events API HTTP endpoints from attacker infrastructure"
          ],
          "data_accessed": [
            "Sign‑in events with user, IP, device, and outcome metadata",
            "Vault and item‑access events (view, edit, copy) mapped to actors and vaults",
            "Administrative change events (policy, SCIM, SSO, Device Trust, service accounts)"
          ],
          "preconditions_required": [
            "Valid Events API token stolen in the previous phase.",
            "Outbound Internet access from attacker infrastructure to 1Password Events API endpoints."
          ],
          "constraints_encountered": [
            "API rate limits may restrict how quickly bulk history can be retrieved.",
            "Very large tenants may require significant time and storage to collect full histories."
          ],
          "evasion_considerations": [
            "Throttle Events API queries to mimic normal SIEM polling intervals.",
            "Use filters (time range, event types) to avoid obvious one‑shot full exports.",
            "If possible, reuse the same IP ranges or cloud providers as the legitimate SIEM integration."
          ]
        },
        {
          "tactic_name": "Defense Evasion (TA0005)",
          "method_steps": [
            "If acting as a compromised admin, review Events Reporting configuration in the 1Password admin console to understand which events are exported and to where.",
            "Subtly adjust Events Reporting filters (if configurable) to exclude or down‑scope certain event types (e.g., service‑account usage) while leaving others intact to avoid obvious gaps.",
            "If integration scripts on the connector host are editable, introduce small delays, sampling, or filtering that reduce the volume of events sent to SIEM, especially for the identities the attacker plans to abuse.",
            "Avoid fully disabling Events Reporting or deleting integrations, which would be immediately obvious; instead, tune them such that particular classes of actions (or specific identities) are less visible.",
            "Monitor harvested events going forward to verify that suspicious activity performed during other scenarios is present in attacker logs but not fully reflected in the organization’s SIEM, adjusting filters if necessary."
          ],
          "capabilities_used": [
            "Events Reporting and SIEM Integrations",
            "1Password Events API",
            "Team and Business Account Administration"
          ],
          "interfaces_used": [
            "1Password admin console Events Reporting/settings UIs",
            "Connector host integration scripts",
            "Events API for verification"
          ],
          "data_accessed": [
            "Current Events Reporting configuration and filters",
            "Integration credentials and destinations"
          ],
          "preconditions_required": [
            "Admin‑level control over Events Reporting settings or integration scripts.",
            "Understanding of current monitoring expectations in the organization."
          ],
          "constraints_encountered": [
            "Any change in logging configuration may be change‑managed and reviewed by SecOps.",
            "Over‑aggressive filtering might trigger anomalies in SIEM dashboards."
          ],
          "evasion_considerations": [
            "Prefer minor adjustments to sampling, not wholesale disabling of event types.",
            "Time configuration changes to coincide with planned SIEM or logging maintenance.",
            "Ensure some benign events continue to flow to avoid obvious drops in volume."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Compromise either a 1Password Business admin with Events Reporting rights or a SIEM/integration host that runs the Events API collector.",
        "Steal 1Password Events API tokens from 1Password API Credential items or from connector configuration files/environment variables.",
        "Use the stolen tokens from attacker infrastructure to repeatedly query the Events API and harvest detailed sign‑in, admin, vault, and item‑access events.",
        "Analyze harvested logs to map high‑value identities, vaults, and automation paths and plan follow‑on attacks while optionally tuning Events Reporting and SIEM ingestion to reduce visibility into future malicious activity."
      ]
    },
    {
      "scenario_name": "T1078/T1098 – 1Password Admin Takeover via Emergency Kits and Delegated Recovery",
      "hypothesis": {
        "scenario_name": "T1078/T1098 – 1Password Admin Takeover via Emergency Kits and Delegated Recovery",
        "attack_target": "Gain and maintain persistent control over multiple 1Password Business admin/organizer accounts by stealing Emergency Kits and abusing delegated/bulk recovery capabilities, enabling long‑term control of vaults even if some credentials are rotated.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Persistence (TA0003)",
        "preconditions": "The organization permits Emergency Kits for some or all accounts (or has not strictly disabled them for admins), and uses delegated recovery for families or business accounts. At least one highly privileged user mishandles their Emergency Kit or stores it in a location the attacker can access. Recovery roles exist and are assigned to specific admins or groups.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Steal an Emergency Kit or Admin Credentials",
            "step_description": "Obtain an Emergency Kit PDF (or equivalent password and Secret Key) for at least one admin/organizer, or otherwise compromise a recovery‑capable admin account.",
            "step_mitre_technique": "T1552.001 – Credentials in Files; T1078 – Valid Accounts",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Sign In as Admin and Gain Recovery Capabilities",
            "step_description": "Use Emergency Kit data to sign in as that admin from an attacker device, then confirm or assign recovery roles to ensure the attacker can initiate recoveries for other accounts.",
            "step_mitre_technique": "T1098 – Account Manipulation",
            "step_mitre_tactic": "Privilege Escalation (TA0004)"
          },
          {
            "step_name": "Use Delegated/Bulk Recovery to Take Over Additional Admins",
            "step_description": "Initiate delegated or bulk recovery flows via the UI or CLI for other admins/organizers and complete recovery as the attacker, resetting their credentials and Secret Keys.",
            "step_mitre_technique": "T1098 – Account Manipulation; T1136 – Create Account (new recovery‑capable identities)",
            "step_mitre_tactic": "Credential Access (TA0006) / Privilege Escalation (TA0004)"
          },
          {
            "step_name": "Establish Backdoor Admin and Recovery Identities",
            "step_description": "Create additional admin or service accounts, assign them recovery rights, and generate/store their Emergency Kits in attacker‑controlled locations for durable persistence.",
            "step_mitre_technique": "T1136 – Create Account; T1078 – Valid Accounts",
            "step_mitre_tactic": "Persistence (TA0003)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001)",
          "method_steps": [
            "Search for Emergency Kit PDFs in likely storage locations such as corporate cloud drives, email attachments, personal cloud storage, ticket attachments, or endpoint backups of family/business admins.",
            "Use broader endpoint compromise to scan local disks of admins’ machines for filenames or content patterns matching Emergency Kits (e.g., containing \"Secret Key\" and the 1Password sign‑in URL).",
            "If an Emergency Kit is found, extract the Secret Key, sign‑in address, and account email from the PDF; if the password field is filled in, record the account password as well.",
            "If the password is missing, rely on separate credential theft (phishing, keylogging, reuse from other breaches) to obtain the admin’s 1Password account password.",
            "From an attacker‑controlled device, sign in to 1Password.com using the data from the Emergency Kit and password, completing any 2FA required, and enroll the attacker device as a trusted client for this admin account."
          ],
          "capabilities_used": [
            "Emergency Kit for Account Recovery",
            "End-to-End Encryption and Secret Key Model",
            "Enterprise Password Manager for Workforce"
          ],
          "interfaces_used": [
            "1Password account management and sign‑in UI",
            "1Password apps or CLI for enrollment of a new device"
          ],
          "data_accessed": [
            "Admin Secret Keys, sign‑in URLs, and account emails",
            "Admin account passwords (from the Kit or separate theft)"
          ],
          "preconditions_required": [
            "At least one admin or organizer has generated and stored an Emergency Kit insecurely.",
            "The organization has not globally disabled Emergency Kit creation for those roles."
          ],
          "constraints_encountered": [
            "Some tenants disable Emergency Kits for business users or require SSO‑only unlock.",
            "Initial sign‑in from a new device may trigger alerts or be logged conspicuously."
          ],
          "evasion_considerations": [
            "Prefer Emergency Kits for admins who travel or work remotely (more likely to have stored kits off‑network).",
            "Use infrastructure consistent with the admin’s usual geography/IP when enrolling the attacker device."
          ]
        },
        {
          "tactic_name": "Privilege Escalation (TA0004)",
          "method_steps": [
            "Once authenticated as the compromised admin, open the 1Password Business admin console and navigate to People/Groups/Settings related to recovery.",
            "Identify which roles or groups can perform account recovery and whether the current admin has such rights; if not, grant themselves recovery privileges by assigning appropriate roles or groups (if permitted).",
            "Verify access to recovery features by starting a test recovery on a low‑value account and confirming options to initiate or approve recovery requests.",
            "Document the set of admin/recovery roles and groups that can be misused to reset other high‑privilege accounts (owners, other admins, service‑account owners)."
          ],
          "capabilities_used": [
            "Team and Business Account Administration",
            "Documented privileged operation: Delegating and performing account recovery",
            "Recover 1Password accounts (delegated recovery flows)"
          ],
          "interfaces_used": [
            "1Password Business admin console (People, Groups, Recovery/Settings)",
            "Account recovery UI flows documented in 1Password support"
          ],
          "data_accessed": [
            "Directory of members, admins, and their recovery status",
            "Recovery role assignments and configuration"
          ],
          "preconditions_required": [
            "Compromised admin has at least some rights to modify roles or recovery settings.",
            "Recovery functionality is enabled and used in the tenant."
          ],
          "constraints_encountered": [
            "Altering recovery roles is a high‑impact change and likely logged.",
            "Some deployments restrict who can manage recovery roles, limiting escalation options."
          ],
          "evasion_considerations": [
            "Minimize explicit changes to recovery roles; prefer abusing existing recovery‑capable identities when possible.",
            "Spread any role changes over time and mix them with plausible admin maintenance actions."
          ]
        },
        {
          "tactic_name": "Credential Access / Further Privilege Escalation",
          "method_steps": [
            "From the recovery‑capable admin account, initiate delegated recovery for other high‑privilege accounts (owners, additional admins, SCIM/SSO integration owners) via the admin console or CLI.",
            "Monitor associated email channels and any out‑of‑band signals for recovery approval links or codes; if email is accessible through another compromised vector, intercept and complete the recovery sequence before the legitimate user sees it.",
            "Complete recovery flows by choosing new account passwords and, where allowed, generating new Secret Keys for those accounts under attacker control.",
            "Log into each newly recovered admin account from attacker infrastructure to confirm control, and enroll attacker devices as trusted for those accounts.",
            "For scale, use bulk‑recovery features exposed via 1Password CLI to queue and process multiple admin recoveries in a single operation, capturing output logs locally."
          ],
          "capabilities_used": [
            "Recover 1Password accounts (delegated & bulk recovery)",
            "1Password CLI",
            "Team and Business Account Administration"
          ],
          "interfaces_used": [
            "1Password Business recovery UI",
            "1Password CLI bulk recovery commands",
            "Email systems handling recovery notifications"
          ],
          "data_accessed": [
            "Recovery emails and tokens for other admins",
            "Newly set passwords and Secret Keys for recovered admin accounts"
          ],
          "preconditions_required": [
            "Recovery‑capable admin account controlled by the attacker.",
            "Email access (or ability to intercept recovery channels) for target admins."
          ],
          "constraints_encountered": [
            "Mass recovery events for admin accounts are highly anomalous and logged.",
            "Recovery notifications may alert users, prompting rapid incident response."
          ],
          "evasion_considerations": [
            "Target a small number of key admins first instead of mass recovery.",
            "Time recoveries during periods when password resets or migrations are expected (e.g., migrations, rollouts).",
            "Avoid immediate obvious misuse; first use new admins to set up durable backdoors."
          ]
        },
        {
          "tactic_name": "Persistence (TA0003)",
          "method_steps": [
            "Using one of the compromised admin accounts, create one or more additional admin or service accounts with innocuous names (e.g., automation or break‑glass accounts) and grant them admin and/or recovery rights.",
            "Generate Emergency Kits for these new accounts (if allowed) and immediately download and store the PDFs in attacker‑controlled storage outside the organization.",
            "Assign these accounts to key vaults and groups so they have broad visibility into secrets and configuration but are not widely used day‑to‑day, reducing chances of being noticed in user activity.",
            "Ensure that at least one of these backdoor accounts is excluded from SCIM deprovisioning and recovery workflows (e.g., by configuring it as a non‑SCIM, manually managed admin), so that IdP changes do not easily remove it.",
            "Periodically log in to these backdoor accounts to confirm they remain active and to update their Emergency Kits or local device enrollments as needed."
          ],
          "capabilities_used": [
            "Team and Business Account Administration",
            "Emergency Kit for Account Recovery",
            "1Password Service Accounts (for non‑human backdoor access)"
          ],
          "interfaces_used": [
            "1Password Business admin console (user/service account creation)",
            "Emergency Kit download UI",
            "1Password apps/CLI for new backdoor accounts"
          ],
          "data_accessed": [
            "Newly issued Emergency Kits and Secret Keys for backdoor accounts",
            "Vault and group assignments for those accounts"
          ],
          "preconditions_required": [
            "Full admin control over 1Password tenant.",
            "Ability to create new members/service accounts and issue Emergency Kits."
          ],
          "constraints_encountered": [
            "New admins and service accounts are logged and may appear in regular audits.",
            "Emergency Kit generation for business admins may be disabled by policy."
          ],
          "evasion_considerations": [
            "Name backdoor accounts according to existing naming schemes (e.g., automation, SRE) and assign them plausible vault scopes.",
            "Ensure at least one backdoor account is non‑SSO and not SCIM‑managed to survive IdP deprovisioning.",
            "Space creation of backdoor accounts over time and correlate them with plausible infrastructure changes or automation initiatives."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Steal a 1Password Emergency Kit (or equivalent password + Secret Key) for at least one admin or organizer and sign in from an attacker device.",
        "Use that account to gain or confirm recovery and admin capabilities within the tenant.",
        "Abuse delegated and bulk recovery flows (via UI and CLI) to reset credentials and Secret Keys for additional admin/owner accounts and take control of them.",
        "Create new backdoor admin and/or service accounts with recovery rights, download their Emergency Kits, and ensure they are excluded from SCIM deprovisioning to maintain long‑term persistence over the tenant."
      ]
    },
    {
      "scenario_name": "T1136.003/T1531 – Mass Account Deprovisioning in 1Password via SCIM Bridge and IdP Compromise",
      "hypothesis": {
        "scenario_name": "T1136.003/T1531 – Mass Account Deprovisioning in 1Password via SCIM Bridge and IdP Compromise",
        "attack_target": "Cause large‑scale denial of access to 1Password for the victim organization—disabling or deleting many or all accounts or revoking vault access—by abusing SCIM Bridge and IdP integrations, potentially locking out defenders while other operations run.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Impact (TA0040)",
        "preconditions": "The organization uses SCIM Bridge integrated with an IdP to automatically provision and deprovision members and groups in 1Password. One or more IdP admins or SCIM Bridge operators or the 1Password provisioning admin account can be compromised.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Compromise IdP/SCIM or 1Password Provisioning Admin",
            "step_description": "Gain administrative control over either the IdP app that drives SCIM, the SCIM Bridge host, or the 1Password provisioning admin.",
            "step_mitre_technique": "T1078 – Valid Accounts; T1199 – Trusted Relationship",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Discover SCIM Mappings and Sync Behavior",
            "step_description": "Review SCIM mappings between IdP groups and 1Password groups/users, allowed domains, and sync intervals to understand how account lifecycle is controlled.",
            "step_mitre_technique": "T1526 – Cloud Service Discovery; T1087 – Account Discovery",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Trigger Mass Deprovisioning or Group Removal",
            "step_description": "Use IdP or SCIM Bridge control to disable or remove many users/groups or to change mappings so that 1Password accounts are disabled or lose access en masse.",
            "step_mitre_technique": "T1531 – Account Access Removal; T1098 – Account Manipulation",
            "step_mitre_tactic": "Impact (TA0040)"
          },
          {
            "step_name": "Optionally Preserve a Hidden Access Path",
            "step_description": "Before deprovisioning, create or preserve one or more backdoor accounts or service accounts not tied to SCIM so the attacker retains access while others are locked out.",
            "step_mitre_technique": "T1136.003 – Create Account: Cloud Account; T1078 – Valid Accounts",
            "step_mitre_tactic": "Persistence (TA0003)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001)",
          "method_steps": [
            "Identify which IdP (Okta, Entra, Google, etc.) is used for 1Password SSO and SCIM by reviewing public documentation and login flows.",
            "Phish or compromise an IdP admin, SCIM app owner, or 1Password provisioning admin using targeted lures and credential theft.",
            "Alternatively, compromise the SCIM Bridge host through infrastructure exploits (weak admin, unpatched service, misconfigured cloud instance).",
            "Validate access by viewing the IdP app configuration or SCIM Bridge settings that reference the 1Password tenant."
          ],
          "capabilities_used": [
            "Identity Provider and Authentication Integrations",
            "Automated Provisioning via SCIM Bridge",
            "SCIM Bridge Automated Provisioning and Deprovisioning",
            "Team and Business Account Administration"
          ],
          "interfaces_used": [
            "IdP admin consoles for SCIM/SSO apps",
            "SCIM Bridge service host and its configuration",
            "1Password admin console provisioning settings"
          ],
          "data_accessed": [
            "SCIM application configuration and credentials",
            "Provisioning admin accounts and mappings"
          ],
          "preconditions_required": [
            "SCIM Bridge is deployed and in production use.",
            "Attacker can compromise either IdP app owners, the SCIM Bridge host, or 1Password provisioning admins."
          ],
          "constraints_encountered": [
            "IdP admin roles may be tightly limited and monitored.",
            "SCIM Bridge may be deployed in a locked‑down segment."
          ],
          "evasion_considerations": [
            "Prefer subtle misuse of SCIM behavior over obviously destructive actions upfront.",
            "Operate during normal change windows to blend with genuine provisioning changes."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "In the IdP, inspect the SCIM application for 1Password to see which users and groups are in scope, what attributes are mapped, and which deprovisioning semantics are in use (soft delete vs disable).",
            "On the SCIM Bridge host or in its config UI, review mappings of IdP groups to 1Password groups and any allowed‑domain lists that determine who can be auto‑provisioned.",
            "In the 1Password admin console, review current members, groups, and which are SCIM‑managed vs manually managed, noting critical groups (e.g., Owners, Admins) and whether they are SCIM‑backed.",
            "Assess sync frequency and error‑handling behavior to understand how quickly IdP changes propagate and how failures are surfaced."
          ],
          "capabilities_used": [
            "Automated Provisioning via SCIM Bridge",
            "SCIM Bridge Automated Provisioning and Deprovisioning",
            "Team and Business Account Administration"
          ],
          "interfaces_used": [
            "IdP SCIM application configuration UIs",
            "SCIM Bridge config files/UI",
            "1Password Business admin console (People, Groups)"
          ],
          "data_accessed": [
            "IdP group membership and mapping rules",
            "1Password group membership and SCIM‑management flags",
            "Sync schedules and deprovisioning semantics"
          ],
          "preconditions_required": [
            "Administrative visibility into IdP SCIM app and/or SCIM Bridge.",
            "1Password admin console access for verifying SCIM effects."
          ],
          "constraints_encountered": [
            "Some 1Password groups (e.g., Owners) might not be SCIM‑managed.",
            "Changes in IdP may take time to propagate, making timing important."
          ],
          "evasion_considerations": [
            "Limit discovery changes to read‑only operations at first.",
            "Avoid mass test changes that could affect many users visibly."
          ]
        },
        {
          "tactic_name": "Impact (TA0040)",
          "method_steps": [
            "In the IdP, disable or remove large sets of users from the SCIM app’s assignment (e.g., by unassigning organizational units or critical groups), knowing that SCIM Bridge will interpret this as a deprovision directive.",
            "Alternatively, adjust SCIM mappings to map all (or many) users to a \"disabled\" state or to a low‑privilege group in 1Password, effectively revoking their vault access without deleting accounts.",
            "Force a SCIM sync by triggering or waiting for the next scheduled run; monitor SCIM logs to confirm that many 1Password users are being disabled or deprovisioned.",
            "Verify in the 1Password admin console that users can no longer sign in or that their group/vault assignments have been removed, achieving denial of access to secrets and administrative controls.",
            "Optionally, target specific defender accounts (security admins, incident responders) for early deprovisioning to slow response."
          ],
          "capabilities_used": [
            "Automated Provisioning via SCIM Bridge",
            "SCIM Bridge Automated Provisioning and Deprovisioning",
            "Identity Provider and Authentication Integrations"
          ],
          "interfaces_used": [
            "IdP admin console for user and app assignments",
            "SCIM Bridge service logs and control",
            "1Password Business admin console for verification"
          ],
          "data_accessed": [
            "User and group assignment data in IdP and 1Password",
            "Provisioning and deprovisioning logs"
          ],
          "preconditions_required": [
            "SCIM is configured to propagate deprovision events into 1Password.",
            "Attacker has rights to change IdP assignment or mapping rules."
          ],
          "constraints_encountered": [
            "Mass deprovisioning is highly visible to users and will likely trigger an incident quickly.",
            "Some break‑glass or owner accounts may remain unaffected."
          ],
          "evasion_considerations": [
            "If the goal is stealthy reduction of coverage vs outright DoS, gradually remove or downgrade key accounts and groups instead of mass disablement.",
            "Align some removals with normal offboarding waves to reduce suspicion."
          ]
        },
        {
          "tactic_name": "Persistence (TA0003)",
          "method_steps": [
            "Before mass changes, create one or more 1Password accounts (or service accounts) that are not SCIM‑managed by using manual provisioning or the Partnership API, granting them high‑privilege roles (e.g., admin/owner).",
            "Ensure these accounts use separate sign‑in domains or are excluded from IdP group‑based assignments so SCIM will not deprovision them.",
            "Generate and store credentials (and Emergency Kits, if allowed) for these accounts in attacker‑controlled storage.",
            "After mass deprovisioning, confirm that these backdoor accounts retain access to the tenant and can manage users, vaults, and policies while most legitimate users remain locked out."
          ],
          "capabilities_used": [
            "Team and Business Account Administration",
            "Automated Provisioning via SCIM Bridge (for understanding what is non‑SCIM)",
            "Partnership API (where used to create accounts programmatically)"
          ],
          "interfaces_used": [
            "1Password admin console user creation screen",
            "Partnership API endpoints (if applicable)"
          ],
          "data_accessed": [
            "Account information and credentials for backdoor non‑SCIM accounts"
          ],
          "preconditions_required": [
            "Administrative ability to create non‑SCIM or partner‑provisioned accounts.",
            "Time to set up these accounts before overt deprovisioning."
          ],
          "constraints_encountered": [
            "New high‑privilege accounts may appear unusual in audits.",
            "Some tenants enforce strong join with IdP, limiting manual accounts."
          ],
          "evasion_considerations": [
            "Name backdoor accounts according to partner/MSP norms or automation roles.",
            "Create them well before disruptive actions to avoid temporal correlation.",
            "Limit use of backdoor accounts to critical operations to reduce audit noise."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Compromise an IdP admin, SCIM app owner, SCIM Bridge host, or 1Password provisioning admin.",
        "Enumerate SCIM mappings, group assignments, and sync behavior between the IdP and 1Password.",
        "Use IdP or SCIM Bridge control to disable or unassign large sets of users or to remap them into disabled/low‑privilege states, causing SCIM to propagate mass deprovisioning or access loss into 1Password.",
        "Before doing so, create or preserve one or more non‑SCIM backdoor admin/service accounts that remain active and under attacker control while most users—including defenders—are locked out."
      ]
    },
    {
      "scenario_name": "T1213.003 – Trelica MCP SaaS Governance Data Exfiltration via Compromised AI Agent",
      "hypothesis": {
        "scenario_name": "T1213.003 – Trelica MCP SaaS Governance Data Exfiltration via Compromised AI Agent",
        "attack_target": "Exfiltrate Trelica’s complete SaaS governance dataset (SaaS inventory, user–app mappings, license and spend data, access reviews, and workflow definitions) via the Trelica MCP Server that has been integrated into an AI/agent platform and authenticated using secrets managed in 1Password.",
        "starting_tactic": "Initial Access (TA0001)",
        "objective_tactic": "Exfiltration (TA0010)",
        "preconditions": "Trelica MCP Server is deployed and integrated with one or more AI/agent platforms using authentication tokens derived from Trelica licenses. MCP tokens are distributed to agents via 1Password Environments/CLI and service accounts into AI runtimes (env vars, .env files). The attacker can compromise either an AI orchestration environment, a CI/CD pipeline that injects MCP tokens, or the 1Password configuration that stores those tokens.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Compromise AI Platform or Secret Distribution Path",
            "step_description": "Gain access to an AI runtime, orchestrator, or CI/CD pipeline that holds Trelica MCP tokens supplied from 1Password.",
            "step_mitre_technique": "T1078 – Valid Accounts; T1199 – Trusted Relationship",
            "step_mitre_tactic": "Initial Access (TA0001)"
          },
          {
            "step_name": "Steal Trelica MCP Authentication Tokens",
            "step_description": "Extract MCP tokens from environment variables, .env files, or directly from 1Password via compromised service accounts.",
            "step_mitre_technique": "T1550.001 – Use Alternate Authentication Material; T1552.001 – Unsecured Credentials: Credentials in Files; T1555.005 – Credentials from Password Managers",
            "step_mitre_tactic": "Credential Access (TA0006)"
          },
          {
            "step_name": "Enumerate Trelica Governance Data via MCP",
            "step_description": "Use the MCP endpoint with stolen tokens to query SaaS inventory, user–app mappings, workflows, and access reviews.",
            "step_mitre_technique": "T1213.003 – Data from Information Repositories: Cloud-Based Repositories; T1526 – Cloud Service Discovery",
            "step_mitre_tactic": "Discovery (TA0007)"
          },
          {
            "step_name": "Automate Full Dataset Harvest",
            "step_description": "Script exhaustive MCP queries to paginate through and collect all Trelica governance datasets into attacker storage.",
            "step_mitre_technique": "T1119 – Automated Collection",
            "step_mitre_tactic": "Collection (TA0009)"
          },
          {
            "step_name": "Exfiltrate Governance Data via Web Services",
            "step_description": "Send harvested data from the AI/automation environment to attacker‑controlled cloud storage or C2 over HTTPS.",
            "step_mitre_technique": "T1567 – Exfiltration Over Web Service; T1020 – Automated Exfiltration",
            "step_mitre_tactic": "Exfiltration (TA0010)"
          }
        ]
      },
      "adversarial_methods": [
        {
          "tactic_name": "Initial Access (TA0001)",
          "method_steps": [
            "Identify which AI/agent platform(s) the organization uses that integrate with Trelica MCP Server (e.g., via public blog posts, internal docs, or 1Password/Trelica configuration).",
            "Compromise an AI orchestrator account (e.g., an LLM ops engineer) or CI/CD pipeline that builds AI agent containers using phishing, credential reuse, or exploitation of orchestration/API misconfigurations.",
            "On the compromised orchestrator or CI pipeline, enumerate AI projects or agent configurations to find those wired to the Trelica MCP Server.",
            "Confirm that Trelica MCP integration is active by examining configuration for MCP endpoints and associated credentials/secrets (often injected from 1Password)."
          ],
          "capabilities_used": [
            "Trelica MCP Server for AI Integrations",
            "Trelica by 1Password (SaaS Governance and Spend Optimization)",
            "1Password Environments and Secret References",
            "1Password CLI and Service Accounts"
          ],
          "interfaces_used": [
            "AI/agent platform configuration UIs or APIs",
            "CI/CD pipeline configs for AI deployments"
          ],
          "data_accessed": [
            "Agent/tool configurations referencing the Trelica MCP Server",
            "Links between AI projects and Trelica tenant"
          ],
          "preconditions_required": [
            "Trelica MCP Server is deployed and integrated with at least one AI platform.",
            "The attacker can compromise an account or host that participates in AI/agent deployments."
          ],
          "constraints_encountered": [
            "MCP integration might be limited to a small subset of AI projects.",
            "Some configurations may be stored in locked‑down secret managers rather than plain config."
          ],
          "evasion_considerations": [
            "Target less‑monitored development or sandbox AI environments first.",
            "Avoid changing agent configurations during reconnaissance."
          ]
        },
        {
          "tactic_name": "Credential Access (TA0006)",
          "method_steps": [
            "On the compromised AI runtime or CI runner, inspect environment variables and `.env` files written by 1Password Environments for variables referencing Trelica MCP keys or tokens.",
            "Search configuration files, orchestration manifests, and secrets management integrations for 1Password secret‑reference syntax pointing to Trelica authentication material.",
            "If a 1Password service account used for Trelica is known, authenticate 1Password CLI or Connect using its token and read the API Credential item that stores MCP tokens.",
            "Extract the MCP token(s), associated tenant/endpoint URLs, and any scope information, and move them to an attacker‑controlled host.",
            "Verify token validity with a minimal test call to the MCP endpoint from attacker infrastructure."
          ],
          "capabilities_used": [
            "1Password Environments and Secret References",
            "1Password CLI",
            "1Password Service Accounts",
            "Trelica MCP Server for AI Integrations"
          ],
          "interfaces_used": [
            "Runtime environment (env vars, .env files) of AI agents",
            "CI/CD configuration and secret stores",
            "1Password CLI / Connect to read Trelica API Credential items",
            "Trelica MCP HTTP endpoint"
          ],
          "data_accessed": [
            "Trelica MCP authentication tokens or API keys",
            "MCP endpoint URLs and any documented scopes"
          ],
          "preconditions_required": [
            "MCP tokens are distributed via 1Password into AI environments.",
            "Attacker has OS‑level or service‑account‑level access to those environments."
          ],
          "constraints_encountered": [
            "Tokens may be short‑lived or rotated frequently.",
            "Service‑account scopes might restrict visibility to subsets of Trelica data."
          ],
          "evasion_considerations": [
            "Do not modify or revoke MCP tokens; just copy them.",
            "Minimize on‑host forensic traces of token dumps (e.g., avoid verbose logging)."
          ]
        },
        {
          "tactic_name": "Discovery (TA0007)",
          "method_steps": [
            "From attacker infrastructure, send authenticated MCP queries to list Trelica’s SaaS inventory: applications, categories, and basic metadata.",
            "Query MCP for user–application relationships to understand which users (or machine identities) have access to which SaaS and with what roles.",
            "Query MCP for access‑review campaigns and decisions, identifying where reviewers have allowed unusual or risky access and where key apps are under lax review.",
            "Query MCP for workflow and automation definitions (if exposed) to see how onboarding/offboarding and license optimization operate across SaaS apps.",
            "Summarize this information into a local model of the organization’s SaaS footprint and governance posture."
          ],
          "capabilities_used": [
            "Trelica MCP Server for AI Integrations",
            "Trelica by 1Password (SaaS Governance and Spend Optimization)"
          ],
          "interfaces_used": [
            "Trelica MCP Server API as seen by AI/agent tools"
          ],
          "data_accessed": [
            "Catalog of SaaS and AI applications in use",
            "User–app mappings and role/entitlement data",
            "Access‑review campaign structures and decisions",
            "Workflow and automation metadata (where exposed)"
          ],
          "preconditions_required": [
            "Valid MCP token stolen earlier.",
            "MCP is configured with a Trelica account that has broad read access to governance data."
          ],
          "constraints_encountered": [
            "MCP might only expose a subset of Trelica datasets, depending on account scopes.",
            "API pagination and rate limits may require careful handling."
          ],
          "evasion_considerations": [
            "Throttle MCP queries and mirror typical AI agent usage patterns.",
            "Structure requests as plausible agent tasks (e.g., reporting) if logs are reviewed."
          ]
        },
        {
          "tactic_name": "Collection (TA0009)",
          "method_steps": [
            "Write a script or agent plugin that systematically paginates through all MCP resources: applications, users, user–app assignments, workflows, access reviews, and any associated metadata.",
            "For each resource type, serialize responses into structured formats (e.g., JSONL files) grouped by app, user, and governance object.",
            "Augment raw data with lightweight enrichment (e.g., tagging apps by category or criticality) to facilitate later targeting.",
            "Store intermediate and final datasets in encrypted local storage on attacker infrastructure, verifying completeness via counts and cross‑checks with sample UI views if possible."
          ],
          "capabilities_used": [
            "Trelica MCP Server for AI Integrations",
            "Trelica SaaS Discovery and Workflow Automation"
          ],
          "interfaces_used": [
            "Trelica MCP Server API from attacker tooling"
          ],
          "data_accessed": [
            "Full SaaS inventory and governance datasets accessible through MCP"
          ],
          "preconditions_required": [
            "Confirmed ability to query all relevant MCP endpoints.",
            "Sufficient time and network bandwidth to harvest data."
          ],
          "constraints_encountered": [
            "MCP performance or quotas may limit speed of full‑dataset retrieval.",
            "Monitoring might flag unusually exhaustive queries by a single client."
          ],
          "evasion_considerations": [
            "Harvest data over an extended period to mimic long‑running analytics or reporting tasks.",
            "Randomize query order and intervals to avoid obviously scripted patterns."
          ]
        },
        {
          "tactic_name": "Exfiltration (TA0010)",
          "method_steps": [
            "Compress and encrypt the harvested Trelica governance datasets on attacker infrastructure.",
            "From the compromised AI/automation environment (or from attacker infrastructure if controls allow), send encrypted archives over HTTPS to attacker‑owned cloud storage or an external analytics cluster.",
            "Alternatively, if direct outbound transfer from attacker infrastructure is constrained, stage data inside allowed destinations (e.g., permitted cloud analytics platforms) and retrieve it from there later.",
            "After verifying successful upload, remove or securely wipe local copies and logs to reduce forensic traces."
          ],
          "capabilities_used": [
            "AI Integration via MCP Server",
            "1Password Environments and Secret References (for initial distribution of tokens into reachable environments)"
          ],
          "interfaces_used": [
            "Standard HTTPS connections to attacker‑controlled cloud or SaaS endpoints",
            "Any existing outbound data channels from AI/automation environments"
          ],
          "data_accessed": [
            "Compressed archives of Trelica SaaS inventory, user–app mappings, workflows, and access reviews"
          ],
          "preconditions_required": [
            "Complete local harvest of MCP‑exposed datasets.",
            "Outbound network paths from attacker or AI environment to external services."
          ],
          "constraints_encountered": [
            "Data‑loss prevention or egress monitoring may inspect large outbound payloads.",
            "Some AI environments may strictly limit outbound destinations."
          ],
          "evasion_considerations": [
            "Use common cloud providers and regions the victim already uses to blend in.",
            "Break exfiltration into smaller chunks over time to avoid large spikes.",
            "Encrypt payloads so content inspection cannot easily identify governance data."
          ]
        }
      ],
      "attack_chain_summary_steps": [
        "Compromise an AI/agent platform or CI/CD pipeline that integrates Trelica MCP Server using secrets stored in 1Password.",
        "Steal Trelica MCP authentication tokens from AI runtime environments, .env files, or from 1Password via compromised service accounts.",
        "Use the MCP endpoint with stolen tokens to enumerate SaaS inventory, user–app mappings, workflows, and access‑review data.",
        "Automate full dataset harvesting via MCP, serializing all exposed governance information to attacker storage.",
        "Exfiltrate the resulting governance datasets from attacker or AI infrastructure to attacker‑controlled cloud storage over HTTPS."
      ]
    }
  ],
  "summary": "The analysis models eight realistic, high‑impact attack paths against 1Password Business, Extended Access Management, Device Trust, and Trelica by 1Password. Across these scenarios, the most critical themes are:\n\n• Privileged identity compromise (admins, service accounts, Connect tokens, Trelica admins, IdP/SCIM admins) is the primary prerequisite for serious impact. Once obtained, native 1Password and Trelica capabilities are powerful enough to support large‑scale secret theft, account takeover, and governance manipulation without exploiting software flaws.\n\n• Secrets exfiltration risk is concentrated in a small number of automation channels: 1Password CLI, service accounts, Connect servers, and CI/CD integrations. Compromising those channels enables rapid bulk retrieval of vault contents (T1555/T1555.004/T1555.005), often from a limited set of identities that appear legitimate in logs.\n\n• Control‑plane components—SCIM Bridge, IdP/SSO integrations, Device Trust/Extended Access policies, Trelica workflows/access reviews, and Events Reporting—are high‑leverage. Misuse enables: silent SaaS privilege escalation (Trelica), mass account deprovisioning (SCIM), device‑trust bypass (Device Trust/Extended Access), and logging/monitoring degradation (Events API).\n\n• Emergency Kits and delegated/bulk recovery remain a potent but often under‑appreciated path for administrator takeover and persistence. Mishandled Emergency Kits for admins or recovery roles provide all necessary material (Secret Key + password) to enroll attacker devices and then reset other privileged accounts at scale.\n\n• Trelica MCP Server and AI/agent integrations introduce a new read‑only but strategically sensitive surface: if MCP tokens or AI runtimes are compromised, an adversary can exfiltrate a complete SaaS governance map (apps, users, roles, reviews) and use it to direct further operations.\n\nMitigation priorities include: hardening and minimizing Emergency Kit use for admins; enforcing strong MFA and device controls on all admin and recovery roles; tightening scoping and rotation for service accounts, Connect tokens, and Events/MCP API tokens; implementing strict change control and multi‑party approval around SCIM, SSO, Device Trust, Extended Access, Trelica workflows, and Events Reporting; and using the Events API plus SIEM to detect unusual patterns in admin actions, automation‑driven item access, logging configuration changes, and large‑scale account lifecycle operations."
}