{
  "application_name": "Slack Collaboration Platform",
  "attack_paths": [
    {
      "scenario_name": "Malicious Slack App Data Exfiltration",
      "hypothesis": {
        "scenario_name": "Malicious Slack App Data Exfiltration",
        "attack_target": "Bulk workspace messages and files from a target Slack workspace exfiltrated to attacker-controlled destinations via a malicious or compromised Slack app.",
        "starting_tactic": "Initial Access",
        "objective_tactic": "Exfiltration",
        "preconditions": "The attacker can operate as a Slack app developer (with a Slack developer account), register and host an app, and reach at least one user or admin in the target workspace via normal communication channels (e.g., email, web). The target workspace allows installation of at least some third-party or custom apps (either directly by users or via admin approval).",
        "attack_flow_hypothesis": [
          {
            "step_name": "Gain initial app foothold in target workspace",
            "step_description": "Attacker publishes or shares a benign-looking Slack app via the Slack App Marketplace or a direct “Add to Slack” URL, then uses consent phishing and the trusted marketplace interface to convince a user or admin in the target workspace to authorize the app with broad read scopes (messages and files).",
            "step_mitre_technique": "T1566 / T1199 – Phishing (Consent Phishing) and Trusted Relationship via a malicious Slack OAuth app",
            "step_mitre_tactic": "Initial Access"
          },
          {
            "step_name": "Enumerate users, channels, and file surfaces via Slack APIs",
            "step_description": "Using the app’s OAuth tokens, the attacker enumerates users, channels/DMs the app can see, memberships, and file metadata via Slack Web API and Events API, building an internal graph of accounts, permission groups, and high-value locations.",
            "step_mitre_technique": "T1087 / T1069 – Account Discovery and Permission Groups Discovery over SaaS APIs",
            "step_mitre_tactic": "Discovery"
          },
          {
            "step_name": "Automated harvesting of messages and files",
            "step_description": "The attacker’s backend systematically pulls message history and file content from prioritized channels and users via the Web API, and subscribes to Events API streams to ingest new high-value messages and files in near-real time.",
            "step_mitre_technique": "T1119 / SaaS Messaging Applications – Automated Collection from Slack messages and files",
            "step_mitre_tactic": "Collection"
          },
          {
            "step_name": "Exfiltrate harvested content to attacker-controlled destinations",
            "step_description": "The backend stages harvested Slack data into bundles and exfiltrates it by posting archives into an attacker-controlled Slack workspace via Web API, and/or uploading them to attacker-owned cloud storage (e.g., via standard HTTPS APIs or storage integrations).",
            "step_mitre_technique": "T1567.002 / T1537 – Exfiltration Over Web Service and Transfer Data to Cloud Account",
            "step_mitre_tactic": "Exfiltration"
          }
        ]
      },
      "adversarial_methods": [
        {
          "can_achieve": true,
          "tactic_name": "Initial Access",
          "selected_techniques": [
            {
              "stix_id": "attack-pattern--a62a8db3-f23a-4d8f-afd6-9dbc77e7813b",
              "name": "Phishing",
              "rationale": "The attacker’s Slack app cannot access any workspace until a user or admin initiates the install and accepts the OAuth consent dialog. The most realistic way to drive that action is to send targeted messages (email or web-based outreach) containing links to the app’s Slack App Marketplace listing or direct OAuth install URL on slack.com. This matches MITRE Phishing, including “consent phishing,” where a user is tricked into granting permissions to a malicious OAuth application."
            },
            {
              "stix_id": "attack-pattern--9fa07bef-9c81-421e-a8e5-ad4366c5a925",
              "name": "Trusted Relationship",
              "rationale": "Slack’s App Marketplace and third‑party integration model create an implicit trust relationship between workspaces and apps that appear in the official directory or are presented as standard Slack integrations. The attacker abuses this relationship by positioning their malicious app as a legitimate productivity or integration tool. Users and admins are more likely to approve it because it is distributed via Slack’s marketplace and install flows, mirroring how threat actors abuse MSPs or cloud partners to reach downstream victims."
            }
          ],
          "method_steps": [
            {
              "step_id": 1,
              "description": "Prepare a benign-looking marketplace presence or install landing flow for the malicious app, ensuring that its listing or install button initiates an OAuth flow requesting broad read scopes (e.g., messages and files) while advertising plausible business value (e.g., analytics, backups, summaries).",
              "related_capabilities": [
                "Slack App Marketplace and Third-party Integrations – exposes an app directory (marketplace) with individual app listing pages and in-product install/configuration flows for third-party apps.",
                "Slack App Platform – Web API and Surfaces – provides the underlying app model, OAuth tokens and credentials, and UI surfaces such as messages, modals, and app home where install/authorization UX can be presented.",
                "Slack App Platform and APIs (technical component) – the backend service that manages app tokens, events, and surfaces, and processes installation and authorization-related data flows."
              ],
              "related_interfaces": [
                "Slack App Marketplace web UI (https://slack.com/marketplace) – central app directory where users and admins can discover apps and initiate installation flows.",
                "Individual marketplace app listing pages (e.g., https://slack.com/marketplace/A01734836JY-asana) – app-specific pages that describe permissions and provide install/configuration entry points (i.e., effective “install buttons”).",
                "Slack app OAuth flows – referenced in auth_and_identity_behaviours as “Apps authenticate via OAuth and tokens … with scopes granting granular API access,” representing the consent screens and token issuance that occur during app installation/authorization."
              ],
              "related_data": [
                "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), including which scopes/permissions will be requested on install.",
                "OAuth tokens and app credentials used by Slack apps (from “Slack App Platform – Web API and Surfaces”), which the flow will later issue if a workspace approves the app."
              ],
              "notes": "This step sets up the malicious app to appear as a normal Slack integration, positioning it to exploit the trusted relationship users and admins have with the Slack App Marketplace and official install flows."
            },
            {
              "step_id": 2,
              "description": "Identify likely admins or power users in the target organization and send targeted phishing messages that pitch the app’s purported benefits and include a link to the app’s Slack marketplace listing or a direct \"Add to Slack\" OAuth install URL hosted on slack.com.",
              "related_capabilities": [
                "Slack App Marketplace and Third-party Integrations – exposes an app directory (marketplace) with individual app listing pages and in-product install/configuration flows for third-party apps."
              ],
              "related_interfaces": [
                "Individual marketplace app listing pages (e.g., https://slack.com/marketplace/A01734836JY-asana) – app-specific pages that describe permissions and provide install/configuration entry points (i.e., effective “install buttons”).",
                "Slack app OAuth flows – referenced in auth_and_identity_behaviours as “Apps authenticate via OAuth and tokens … with scopes granting granular API access,” representing the consent screens and token issuance that occur during app installation/authorization."
              ],
              "related_data": [
                "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), since the shared link encodes which app and scopes will be requested once opened."
              ],
              "notes": "This is classic consent phishing: the victim is lured into initiating an OAuth grant for a malicious application by following a trustworthy-looking slack.com link that starts the Slack app install flow."
            },
            {
              "step_id": 3,
              "description": "A recipient from the target workspace follows the link, lands on the app’s Slack marketplace listing or equivalent install page, selects their workspace if prompted, and clicks the visible \"Add to Slack\" or install control to start the installation for their workspace.",
              "related_capabilities": [
                "Slack App Marketplace and Third-party Integrations – exposes an app directory (marketplace) with individual app listing pages and in-product install/configuration flows for third-party apps."
              ],
              "related_interfaces": [
                "Individual marketplace app listing pages (e.g., https://slack.com/marketplace/A01734836JY-asana) – app-specific pages that describe permissions and provide install/configuration entry points (i.e., effective “install buttons”).",
                "In-product install and configuration flows exposed from within Slack clients – described as “Install and configuration flows accessible from within Slack or the marketplace,” providing another route to add or authorize apps from inside the workspace UI."
              ],
              "related_data": [
                "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), including the selected workspace and the set of scopes that the app will request at consent time."
              ],
              "notes": "User interaction here bridges the phishing lure into Slack’s official install workflow. No access is obtained yet, but the workspace has initiated the OAuth grant for the malicious app."
            },
            {
              "step_id": 4,
              "description": "On the Slack OAuth consent screen, the user (if allowed to install apps) reviews and ultimately accepts the broad scopes requested by the app, completing the OAuth grant and directly installing the app into the target workspace.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces – provides the underlying app model, OAuth tokens and credentials, and UI surfaces such as messages, modals, and app home where install/authorization UX can be presented.",
                "Slack App Marketplace and Third-party Integrations – exposes an app directory (marketplace) with individual app listing pages and in-product install/configuration flows for third-party apps."
              ],
              "related_interfaces": [
                "Slack app OAuth flows – referenced in auth_and_identity_behaviours as “Apps authenticate via OAuth and tokens … with scopes granting granular API access,” representing the consent screens and token issuance that occur during app installation/authorization.",
                "In-product install and configuration flows exposed from within Slack clients – described as “Install and configuration flows accessible from within Slack or the marketplace,” providing another route to add or authorize apps from inside the workspace UI."
              ],
              "related_data": [
                "OAuth tokens and app credentials used by Slack apps (from “Slack App Platform – Web API and Surfaces”), issued when the user consents and used by the attacker’s app to call Slack APIs.",
                "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), recording that this workspace has installed the app along with granted scopes.",
                "User and channel identifiers included in Web API and interactivity payloads (from “Slack App Platform – Web API and Surfaces” and “Events API, Slash Commands, and Interactivity”), such as workspace ID and the authorizing user ID associated with the tokens."
              ],
              "notes": "If the workspace policy allows self-install of apps, this step alone gives the attacker valid Slack OAuth credentials for the target workspace, satisfying Initial Access for later data collection."
            },
            {
              "step_id": 5,
              "description": "In workspaces where app installs require admin approval, the user’s install attempt creates an app request that workspace or org admins review via the admin app management UI; an admin then approves the request, finalizing the app installation and token issuance.",
              "related_capabilities": [
                "Workspace and Organisation Administration – gives workspace/org admins governance over installed apps and workflows, including which apps can be installed or approved in a workspace.",
                "Slack App Marketplace and Third-party Integrations – exposes an app directory (marketplace) with individual app listing pages and in-product install/configuration flows for third-party apps.",
                "Slack App Platform – Web API and Surfaces – provides the underlying app model, OAuth tokens and credentials, and UI surfaces such as messages, modals, and app home where install/authorization UX can be presented."
              ],
              "related_interfaces": [
                "Admin controls in Slack clients and admin docs (https://docs.slack.dev/admins, admin sections in https://slack.com/help) – interfaces through which workspace/org admins manage installed apps and app policies, indirectly governing what install/authorization paths are available.",
                "In-product install and configuration flows exposed from within Slack clients – described as “Install and configuration flows accessible from within Slack or the marketplace,” providing another route to add or authorize apps from inside the workspace UI.",
                "Individual marketplace app listing pages (e.g., https://slack.com/marketplace/A01734836JY-asana) – app-specific pages that describe permissions and provide install/configuration entry points (i.e., effective “install buttons”)."
              ],
              "related_data": [
                "Records of installed apps and workflows within workspace/org settings (from “Workspace and Organisation Administration”), updated once the admin approves the malicious app.",
                "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), now reflecting an approved install in the target workspace.",
                "OAuth tokens and app credentials used by Slack apps (from “Slack App Platform – Web API and Surfaces”), which are issued or activated once admin approval completes the grant."
              ],
              "notes": "This step explicitly abuses the trusted relationship: admins may approve the app because it appears as a standard Slack marketplace integration, completing Initial Access even in locked-down environments that require admin approval."
            },
            {
              "step_id": 6,
              "description": "The attacker’s backend receives the OAuth authorization code via the configured redirect URL, exchanges it for long-lived OAuth tokens through Slack’s app platform, stores the tokens and associated workspace/user identifiers, and flags the workspace as an active foothold for subsequent message and file collection.",
              "related_capabilities": [
                "Slack App Platform and APIs (technical component) – the backend service that manages app tokens, events, and surfaces, and processes installation and authorization-related data flows.",
                "Slack App Platform – Web API and Surfaces – provides the underlying app model, OAuth tokens and credentials, and UI surfaces such as messages, modals, and app home where install/authorization UX can be presented."
              ],
              "related_interfaces": [
                "Slack app OAuth flows – referenced in auth_and_identity_behaviours as “Apps authenticate via OAuth and tokens … with scopes granting granular API access,” representing the consent screens and token issuance that occur during app installation/authorization."
              ],
              "related_data": [
                "OAuth tokens and app credentials used by Slack apps (from “Slack App Platform – Web API and Surfaces”), including workspace-level and/or bot tokens for the target workspace.",
                "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), such as workspace ID and the scopes the app now has within that workspace.",
                "User and channel identifiers included in Web API and interactivity payloads (from “Slack App Platform – Web API and Surfaces” and “Events API, Slash Commands, and Interactivity”), which tie the tokens to a specific workspace and installing user."
              ],
              "notes": "At this point the attacker holds valid Slack API credentials tied to the target workspace. From an ATT&CK perspective, Initial Access via a malicious SaaS/OAuth application is complete; follow-on tactics can now use these tokens to read and exfiltrate workspace content."
            }
          ],
          "capabilities_used": [
            "Slack App Marketplace and Third-party Integrations – exposes an app directory (marketplace) with individual app listing pages and in-product install/configuration flows for third-party apps.",
            "Slack App Platform – Web API and Surfaces – provides the underlying app model, OAuth tokens and credentials, and UI surfaces such as messages, modals, and app home where install/authorization UX can be presented.",
            "Workspace and Organisation Administration – gives workspace/org admins governance over installed apps and workflows, including which apps can be installed or approved in a workspace.",
            "Slack App Platform and APIs (technical component) – the backend service that manages app tokens, events, and surfaces, and processes installation and authorization-related data flows."
          ],
          "interfaces_used": [
            "Slack App Marketplace web UI (https://slack.com/marketplace) – central app directory where users and admins can discover apps and initiate installation flows.",
            "Individual marketplace app listing pages (e.g., https://slack.com/marketplace/A01734836JY-asana) – app-specific pages that describe permissions and provide install/configuration entry points (i.e., effective “install buttons”).",
            "In-product install and configuration flows exposed from within Slack clients – described as “Install and configuration flows accessible from within Slack or the marketplace,” providing another route to add or authorize apps from inside the workspace UI.",
            "Slack app OAuth flows – referenced in auth_and_identity_behaviours as “Apps authenticate via OAuth and tokens … with scopes granting granular API access,” representing the consent screens and token issuance that occur during app installation/authorization.",
            "Admin controls in Slack clients and admin docs (https://docs.slack.dev/admins, admin sections in https://slack.com/help) – interfaces through which workspace/org admins manage installed apps and app policies, indirectly governing what install/authorization paths are available."
          ],
          "data_accessed": [
            "OAuth tokens and app credentials used by Slack apps (from “Slack App Platform – Web API and Surfaces”), which serve as valid credentials for calling Slack APIs once the app is installed.",
            "App installation metadata and permissions (from “Slack App Marketplace and Third-party Integrations”), including workspace identifiers and the scopes/permissions granted to the malicious app.",
            "Records of installed apps and workflows within workspace/org settings (from “Workspace and Organisation Administration”), reflecting that the malicious app is now authorized in the target workspace.",
            "User and channel identifiers included in Web API and interactivity payloads (from “Slack App Platform – Web API and Surfaces” and “Events API, Slash Commands, and Interactivity”), such as workspace IDs and installing user IDs bound to the issued tokens."
          ],
          "preconditions_required": [
            "The attacker’s Slack app is fully configured in the Slack developer environment with a valid OAuth redirect URL and the desired broad read scopes (e.g., for messages and files).",
            "The app is either approved and discoverable in the Slack App Marketplace or has a shareable direct install/OAuth URL that can be opened by users in the target workspace.",
            "At least one user or admin in the target workspace can be reached by the attacker via normal communication channels (e.g., email or web) and is able to access the Slack marketplace or app install URL.",
            "The target workspace’s app and workflow governance settings allow installation of new third-party or custom apps, either directly by users or via an admin approval workflow.",
            "The attacker controls backend infrastructure capable of handling Slack OAuth redirects, exchanging authorization codes for tokens, and securely storing app credentials for later use."
          ],
          "constraints_encountered": [
            "Workspace and organisation app-governance settings may completely block new apps, restrict installs to a preapproved list, or require admin approval for all apps, reducing the success rate of the phishing and trusted-relationship approach.",
            "During the Slack OAuth consent flow, the full set of requested scopes is displayed to the user/admin; overly broad or obviously unnecessary scopes may raise suspicion and cause them to cancel the install.",
            "Admins can see installed apps and pending app requests in the admin controls; a security-conscious admin may review app descriptions, scopes, and publishers and deny or later remove the malicious app.",
            "If the attacker under-requests scopes during app registration to appear less suspicious, they may not receive sufficient access for the later Collection/Exfiltration objectives, forcing a risky reauthorization request.",
            "Slack or the organization may monitor for new app installs and unusual app permissions, which could flag the malicious app shortly after installation, limiting its dwell time."
          ],
          "evasion_considerations": [
            "Design the app’s branding, description, and category in the Slack App Marketplace to match a useful but innocuous productivity or analytics use case, so that broad read scopes appear justified under the trusted Slack integration model.",
            "Request only the minimal set of Slack scopes necessary to read channels and files while aligning them with the advertised functionality, reducing the likelihood that admins perceive the app as over-privileged during the OAuth consent step.",
            "Leverage links to official slack.com marketplace or OAuth URLs in phishing lures so that recipients see a trusted Slack domain rather than an unfamiliar site, increasing click-through and consent rates.",
            "Target specific roles likely to have app-install permissions (workspace owners, admins, or technical champions) instead of mass-mailing, to mimic legitimate vendor outreach and avoid organizational spam filters and scrutiny.",
            "Stagger outreach and installs across time and organizations to avoid creating obvious spikes in new app installs that might trigger automated monitoring or manual review by Slack admins or security teams."
          ],
          "comments_for_orchestrator": "This method yields valid Slack OAuth tokens with the broad read scopes the attacker registered, providing an Initial Access foothold at the workspace level via a malicious app. Subsequent tactics (Collection and Exfiltration) should assume the attacker has one or more app/bot tokens plus workspace and installing-user identifiers, and can invoke Slack Web API methods consistent with the granted scopes to harvest messages/files and move them off-platform. If you chain this with additional steps, consider branching on whether the workspace allowed direct user install or required admin approval, as that affects how visible/suspicious the app may be to defenders."
        },
        {
          "can_achieve": true,
          "tactic_name": "Discovery",
          "selected_techniques": [
            {
              "stix_id": "attack-pattern--72b74d71-8169-42aa-92e0-e7b04b9f5a08",
              "name": "Account Discovery",
              "rationale": "With a compromised/malicious Slack app token, the attacker can use the Web API and Events API to enumerate users and bot accounts in the workspace, including roles and basic profile details. This directly aligns with Account Discovery, where adversaries leverage authenticated APIs to list identities and understand who exists in the environment and which accounts may be privileged."
            },
            {
              "stix_id": "attack-pattern--15dbf668-795c-41e6-8219-f0447c0e64ce",
              "name": "Permission Groups Discovery",
              "rationale": "Slack channels, DMs, and user groups function as permission boundaries that define which users can see which messages and files. Using the Web API, the malicious app can enumerate channels and (where scopes permit) their membership, effectively discovering group-based permission structures and where sensitive data is likely to reside."
            }
          ],
          "method_steps": [
            {
              "step_id": 1,
              "description": "Baseline the compromised app token by calling the Slack Web API to verify token validity, identify the workspace (team) ID, and obtain the bot/app identity; store this context in the attacker-controlled backend for use in subsequent enumeration.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes."
              ],
              "related_interfaces": [
                "Web API – generic programmatic interface for Slack apps (https://docs.slack.dev/apis/web-api), used with OAuth tokens to query and manipulate workspace entities within scope (e.g., channels, users, messages, files, and configuration metadata)."
              ],
              "related_data": [
                "OAuth tokens and app credentials associated with Slack apps, which encode the scopes that govern what workspace data can be queried or received via APIs.",
                "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it.",
                "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace)."
              ],
              "notes": "This is analogous to a 'whoami' and 'where am I' query in traditional environments. The attacker also inspects Web API responses and configuration to infer granted scopes (e.g., by checking for errors when accessing specific resources or via any available scope-introspection methods)."
            },
            {
              "step_id": 2,
              "description": "Enumerate all conversations the token can see by using Web API list-style methods to retrieve the set of public channels, any private channels or group DMs where the app has been added, and any other conversation types that are exposed within the app’s scopes; record per-conversation metadata such as ID, name, type, archival status, and basic properties.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes.",
                "Technical Components – Message and File Storage, User Messaging and Collaboration Flow: Describe where core content (messages, files, canvases) resides and how it flows, framing what underlying data the Web API and Events API can expose to a token with appropriate scopes."
              ],
              "related_interfaces": [
                "Web API – generic programmatic interface for Slack apps (https://docs.slack.dev/apis/web-api), used with OAuth tokens to query and manipulate workspace entities within scope (e.g., channels, users, messages, files, and configuration metadata)."
              ],
              "related_data": [
                "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it."
              ],
              "notes": "Each Slack channel or DM effectively defines a permission group. By enumerating all conversations visible to the token, the attacker learns where the app currently has potential access to messages and files, forming the base graph for further permission and data-surface analysis."
            },
            {
              "step_id": 3,
              "description": "Enumerate user and bot accounts via the Web API (where scopes permit) to obtain a directory of users and apps in the workspace, including identifiers, display names, emails (if exposed), and role indicators such as admin/owner/guest/bot flags; store this directory in the attacker backend.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes.",
                "Workspace and Organisation Administration: Manages users, channels, roles, permissions, installed apps, and workflows; associated admin controls and documentation imply admin-visible inventories that may be exposed via admin-focused APIs or app governance views."
              ],
              "related_interfaces": [
                "Web API – generic programmatic interface for Slack apps (https://docs.slack.dev/apis/web-api), used with OAuth tokens to query and manipulate workspace entities within scope (e.g., channels, users, messages, files, and configuration metadata)."
              ],
              "related_data": [
                "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace)."
              ],
              "notes": "This implements Account Discovery in a SaaS context using official APIs rather than host commands. Role and type flags allow the attacker to quickly locate admins, owners, guests, and bot/service accounts."
            },
            {
              "step_id": 4,
              "description": "If explicit user-list scopes are missing or limited, passively build and refine the account inventory by parsing Slack Events API payloads for message and reaction events to extract any new user identifiers and profile fragments observed in real traffic.",
              "related_capabilities": [
                "Events API, Slash Commands, and Interactivity: Delivers webhook-style event payloads describing messages, reactions, and user actions, enabling continuous observation of which channels, users, and content an app can see.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes."
              ],
              "related_interfaces": [
                "Events API – webhook delivery of workspace events (https://docs.slack.dev/apis/events-api/): Sends structured JSON events about messages, reactions, and user actions to app-controlled endpoints, revealing active channels, participants, and content the app is allowed to see."
              ],
              "related_data": [
                "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace).",
                "Messages, threads, reactions, and related metadata flowing through the Events API and accessible via Web API methods, representing scope-limited content the app is permitted to read."
              ],
              "notes": "This step ensures Account Discovery still proceeds even if the token cannot call a dedicated 'list all users' method. Over time, nearly all active users will appear in events in channels where the app has visibility."
            },
            {
              "step_id": 5,
              "description": "Map permission groups by correlating channels with their memberships: for each enumerated conversation, use Web API methods (where scopes allow) to retrieve the list of member user IDs, then join this with the account inventory to understand which users (including admins/owners/guests/bots) belong to each channel; where membership listing is blocked, approximate membership using sender IDs observed in Events API message traffic for that channel.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
                "Events API, Slash Commands, and Interactivity: Delivers webhook-style event payloads describing messages, reactions, and user actions, enabling continuous observation of which channels, users, and content an app can see.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes."
              ],
              "related_interfaces": [
                "Web API – generic programmatic interface for Slack apps (https://docs.slack.dev/apis/web-api), used with OAuth tokens to query and manipulate workspace entities within scope (e.g., channels, users, messages, files, and configuration metadata).",
                "Events API – webhook delivery of workspace events (https://docs.slack.dev/apis/events-api/): Sends structured JSON events about messages, reactions, and user actions to app-controlled endpoints, revealing active channels, participants, and content the app is allowed to see."
              ],
              "related_data": [
                "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it.",
                "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace).",
                "Messages, threads, reactions, and related metadata flowing through the Events API and accessible via Web API methods, representing scope-limited content the app is permitted to read."
              ],
              "notes": "This is the core Permission Groups Discovery step: each channel/DM becomes a discovered group with a known set of members, including which groups are frequented by admins, executives, or sensitive departments."
            },
            {
              "step_id": 6,
              "description": "Enumerate file and attachment metadata reachable by the token by using Web API search/list-style methods scoped to the conversations identified earlier, capturing only metadata such as file IDs, filenames, mime types, sizes, timestamps, and associated channels or users, without yet mass-downloading content.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
                "Technical Components – Message and File Storage, User Messaging and Collaboration Flow: Describe where core content (messages, files, canvases) resides and how it flows, framing what underlying data the Web API and Events API can expose to a token with appropriate scopes.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes."
              ],
              "related_interfaces": [
                "Web API – generic programmatic interface for Slack apps (https://docs.slack.dev/apis/web-api), used with OAuth tokens to query and manipulate workspace entities within scope (e.g., channels, users, messages, files, and configuration metadata)."
              ],
              "related_data": [
                "Files and attachments stored in Slack’s Message and File Storage, referenced by IDs and metadata that can be exposed through Web API responses or event payloads where file activity is within the app’s scopes.",
                "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it."
              ],
              "notes": "This is a Discovery-style inventory of objects, similar to File and Directory Discovery in traditional environments. Full content download would be deferred to later Collection/Exfiltration tactics."
            },
            {
              "step_id": 7,
              "description": "Continuously enrich the discovery map by processing incoming Events API payloads for message, thread, reaction, and file events to track which channels are most active, which users post where, what file types appear, and to detect any newly created channels, users, or files that the app gains visibility into over time.",
              "related_capabilities": [
                "Events API, Slash Commands, and Interactivity: Delivers webhook-style event payloads describing messages, reactions, and user actions, enabling continuous observation of which channels, users, and content an app can see.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes.",
                "Technical Components – Message and File Storage, User Messaging and Collaboration Flow: Describe where core content (messages, files, canvases) resides and how it flows, framing what underlying data the Web API and Events API can expose to a token with appropriate scopes."
              ],
              "related_interfaces": [
                "Events API – webhook delivery of workspace events (https://docs.slack.dev/apis/events-api/): Sends structured JSON events about messages, reactions, and user actions to app-controlled endpoints, revealing active channels, participants, and content the app is allowed to see."
              ],
              "related_data": [
                "Messages, threads, reactions, and related metadata flowing through the Events API and accessible via Web API methods, representing scope-limited content the app is permitted to read.",
                "Files and attachments stored in Slack’s Message and File Storage, referenced by IDs and metadata that can be exposed through Web API responses or event payloads where file activity is within the app’s scopes.",
                "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it.",
                "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace)."
              ],
              "notes": "This turns Discovery into an ongoing process: instead of a one-time scan that could be noisy, the app quietly maintains an up-to-date map of active users, high-traffic channels, and file-rich locations."
            },
            {
              "step_id": 8,
              "description": "Analyze the aggregated account, channel, membership, and file-metadata graph in the attacker’s backend to classify high-value targets—for example, channels containing many admins or executives, channels with sensitive-sounding names (finance, hr, legal, security), and channels or users associated with large volumes of files—tagging these for prioritized collection or exfiltration in later stages.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
                "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes."
              ],
              "related_interfaces": [],
              "related_data": [
                "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace).",
                "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it.",
                "Files and attachments stored in Slack’s Message and File Storage, referenced by IDs and metadata that can be exposed through Web API responses or event payloads where file activity is within the app’s scopes.",
                "Messages, threads, reactions, and related metadata flowing through the Events API and accessible via Web API methods, representing scope-limited content the app is permitted to read."
              ],
              "notes": "This analysis occurs entirely on attacker-controlled infrastructure using previously collected metadata. It finalizes the Discovery phase by producing a prioritized map of where valuable data and privileged users reside, to drive subsequent Collection and Exfiltration steps."
            }
          ],
          "capabilities_used": [
            "Slack App Platform – Web API and Surfaces: Provides OAuth-authenticated Web API methods and app surfaces, using tokens with granular scopes to access messages, user and channel identifiers, and other workspace data programmatically.",
            "Events API, Slash Commands, and Interactivity: Delivers webhook-style event payloads describing messages, reactions, and user actions, enabling continuous observation of which channels, users, and content an app can see.",
            "Core Product – Channel and Direct Message-based Collaboration: Defines the main data objects (workspaces, channels, DMs, user accounts, messages, threads, reactions) that Web API calls and Events API payloads will expose within the limits of the app’s scopes.",
            "Workspace and Organisation Administration: Manages users, channels, roles, permissions, installed apps, and workflows; associated admin controls and documentation imply admin-visible inventories that may be exposed via admin-focused APIs or app governance views.",
            "Technical Components – Message and File Storage, User Messaging and Collaboration Flow: Describe where core content (messages, files, canvases) resides and how it flows, framing what underlying data the Web API and Events API can expose to a token with appropriate scopes."
          ],
          "interfaces_used": [
            "Web API – generic programmatic interface for Slack apps (https://docs.slack.dev/apis/web-api), used with OAuth tokens to query and manipulate workspace entities within scope (e.g., channels, users, messages, files, and configuration metadata).",
            "Events API – webhook delivery of workspace events (https://docs.slack.dev/apis/events-api/): Sends structured JSON events about messages, reactions, and user actions to app-controlled endpoints, revealing active channels, participants, and content the app is allowed to see."
          ],
          "data_accessed": [
            "OAuth tokens and app credentials associated with Slack apps, which encode the scopes that govern what workspace data can be queried or received via APIs.",
            "User accounts and profiles, including user identifiers referenced across Web API responses, event payloads, and interactive payloads (representing the user inventory of the workspace).",
            "Workspace and channel identifiers and metadata (e.g., workspace IDs, channel/DM identifiers, membership information) used by Web API and Events API to describe where content resides and who can access it.",
            "Messages, threads, reactions, and related metadata flowing through the Events API and accessible via Web API methods, representing scope-limited content the app is permitted to read.",
            "Files and attachments stored in Slack’s Message and File Storage, referenced by IDs and metadata that can be exposed through Web API responses or event payloads where file activity is within the app’s scopes."
          ],
          "preconditions_required": [
            "The malicious Slack app must already be installed in the target workspace and have a valid OAuth token for that workspace (satisfied by scenario).",
            "The token must have read-oriented scopes sufficient to list channels/conversations and read at least basic message history and file metadata in those conversations (e.g., channel listing, history, and file-read-like scopes).",
            "To fully support Account Discovery via Web API, the token should also have scopes that allow listing users and (ideally) reading basic profile fields; otherwise, account discovery will rely more heavily on Events API traffic.",
            "To perform direct membership enumeration for channels, the token must have the appropriate scopes to query channel or conversation membership lists; absent these scopes, membership will be approximated from message senders over time.",
            "The app must be subscribed to relevant Events API event types (e.g., message and file-related events) and have a reachable HTTPS endpoint that reliably receives and stores these events.",
            "The attacker must have backend infrastructure capable of storing and analyzing the discovered graph of users, channels, events, and file metadata over time."
          ],
          "constraints_encountered": [
            "Slack Web API rate limits constrain how quickly the app can list users, channels, and files; aggressive full-workspace scans in a short time window could hit limits and create detectable spikes in logs.",
            "Discovery is strictly bounded by the app’s OAuth scopes and by Slack’s channel and DM visibility rules; private channels and DMs that do not include the app (or are outside its granted scopes) will not be visible.",
            "Events API only delivers new events after subscription and installation; the attacker cannot retroactively observe historical events that occurred before the app was installed or before specific event types were enabled.",
            "If the token lacks user or membership enumeration scopes, direct group membership listing may be blocked; in that case, the attacker must infer membership from message senders over time, which is slower and potentially incomplete.",
            "Some admin- or governance-focused inventories exposed to workspace admins are not accessible to a normal app token; discovery will be limited to what the app role can legitimately query or observe.",
            "Security and compliance tooling may flag apps that perform unusually broad enumeration, especially if they are newly installed or not widely used; large bursts of listing calls or atypical file searches may be noticeable."
          ],
          "evasion_considerations": [
            "Throttle Web API enumeration (users, channels, files) over hours or days, and cache results, to avoid rate-limit errors and anomalous traffic spikes that could draw attention in admin or security logs.",
            "Prefer incremental, event-driven discovery via the Events API over one-time bulk scans; allow the map to build organically as normal user activity generates message and file events in accessible channels.",
            "Align discovery activity with apparent app functionality (e.g., analytics or summarization features) so that broad reads of channel lists and user profiles appear consistent with the app’s advertised purpose.",
            "Limit the depth of history sampled during Discovery (e.g., only request minimal windows or metadata when testing access) to reduce bandwidth and the likelihood of triggering suspicion, deferring heavy content access to later Collection stages.",
            "Randomize the order and timing of enumeration across channels and users, and interleave discovery calls with benign-appearing feature calls, to better mimic legitimate app usage patterns.",
            "Where possible, reuse already-received Events API payloads for Discovery rather than issuing additional Web API reads, thereby minimizing extra API activity attributable to reconnaissance."
          ],
          "comments_for_orchestrator": "This method produces a structured graph of users, channels/DMs, memberships, and file metadata reachable by the malicious Slack app token. It achieves Discovery via Account Discovery (user/bot inventory, roles) and Permission Groups Discovery (mapping channels and their memberships as permission groups). The resulting prioritized target list (high-value accounts and high-value channels/files) is well-suited to feed subsequent Collection tactics (e.g., selective content retrieval from specific channels or users) and Exfiltration tactics (e.g., staged export of files from identified hotspots). If you chain to additional Discovery techniques such as Cloud Service Discovery, you could extend this to infer which external services are integrated based on bots and link patterns in the observed events."
        },
        {
          "can_achieve": true,
          "tactic_name": "Collection",
          "selected_techniques": [
            {
              "stix_id": "attack-pattern--fb75213f-cfb0-40bf-a02f-3bad93d6601e",
              "name": "Messaging Applications",
              "rationale": "The attacker-controlled Slack app is explicitly operating inside a messaging platform (Slack) and aims to mine high-value conversations and attachments from specific channels and users. MITRE SaaS \"Messaging Applications\" covers adversaries searching Slack/Teams for sensitive discussions, credentials, and incident-response chatter; here the app programmatically does the same across prioritized channels and users using Slack\u0019s Web API and Events API."
            },
            {
              "stix_id": "attack-pattern--30208d3e-0d6b-43c8-883e-44462a514619",
              "name": "Automated Collection",
              "rationale": "The app already has valid OAuth tokens, target lists, and Events API subscriptions. The attacker can fully automate large initial backfills plus ongoing, incremental harvesting of messages and files via scheduled Web API calls and event-driven handlers, with no further manual interaction. This is directly aligned with \"Automated Collection\" where malware periodically and systematically collects matching files/data using built-in APIs."
            }
          ],
          "method_steps": [
            {
              "step_id": 1,
              "description": "On the attacker-controlled backend, load the previously built prioritized list of high-value channels, users, and files for the target workspace and normalize it around Slack workspace, channel, and user identifiers. Store these target sets alongside the workspace\u0019s OAuth tokens so they can be used as filters for subsequent Web API history calls and incoming Events API payloads.",
              "related_capabilities": [
                "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
                "Channel and Direct Message-based Collaboration (Core Collaboration Service): Defines the primary data targets\u0013\"Messages, threads, and reactions\" in channels and DMs, along with associated \"Workspace and channel identifiers\" and \"User accounts and profiles\"\u0013that the app will systematically harvest once it has read access."
              ],
              "related_interfaces": [],
              "related_data": [
                "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
                "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
              ],
              "notes": "This step operationalizes the prioritized results of the Discovery phase, ensuring all later Slack API usage is focused on specific high-value channels, users, and files rather than the full workspace, consistent with targeted use of Messaging Applications."
            },
            {
              "step_id": 2,
              "description": "Using the workspace OAuth token, the backend iterates over each prioritized channel identifier and invokes Slack Web API methods that return channel message history. It pages through the history (optionally bounded by time ranges), retrieving message payloads including text, blocks, user IDs, timestamps, thread roots, and thread replies. The backend stores these raw message objects in its own datastore and applies filters (e.g., messages from admin/engineering/security users, messages containing attachments or sensitive keywords) to flag and retain only high-value content.",
              "related_capabilities": [
                "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
                "Channel and Direct Message-based Collaboration (Core Collaboration Service): Defines the primary data targets\u0013\"Messages, threads, and reactions\" in channels and DMs, along with associated \"Workspace and channel identifiers\" and \"User accounts and profiles\"\u0013that the app will systematically harvest once it has read access.",
                "Message and File Storage (Technical Components & Data Flows): Represents the persistent store for \"messages, threads, files, and canvas content,\" which the malicious app can tap via Web API methods to pull historical content from prioritized channels and users, and to download file contents and metadata."
              ],
              "related_interfaces": [
                "Web API methods documented at https://docs.slack.dev/apis/web-api: These HTTP-based endpoints are invoked with OAuth tokens and are the primary interface for an app to programmatically read channel histories, retrieve messages and threads, and access file metadata and content for any channels and users covered by its scopes."
              ],
              "related_data": [
                "Messages, threads, and reactions in channels and DMs (from \"Channel and Direct Message-based Collaboration\" and \"Core Collaboration Service\"), which constitute the primary message content the app will collect from prioritized channels and users.",
                "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
                "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
              ],
              "notes": "Implements bulk historical harvesting of high-value channels via Slack\u0019s documented history endpoints. This mirrors adversaries mining Slack/Teams for sensitive discussions (Messaging Applications) and uses automated pagination and time bounding consistent with T1119 Automated Collection."
            },
            {
              "step_id": 3,
              "description": "As historical messages are ingested, the backend extracts any attached file references (e.g., files objects in message payloads) and records their file IDs and metadata. It may also call Web API file-listing methods filtered by user, channel, or date range to ensure complete coverage of files shared in or by prioritized channels and users. For each discovered file, it stores metadata such as filename, mimetype, size, uploader, associated channel/user, and timestamp in a candidate list, ranking files by extension/type and context (e.g., documents, spreadsheets, archives, and code snippets above images and emojis).",
              "related_capabilities": [
                "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
                "Message and File Storage (Technical Components & Data Flows): Represents the persistent store for \"messages, threads, files, and canvas content,\" which the malicious app can tap via Web API methods to pull historical content from prioritized channels and users, and to download file contents and metadata.",
                "Channel and Direct Message-based Collaboration (Core Collaboration Service): Defines the primary data targets\u0013\"Messages, threads, and reactions\" in channels and DMs, along with associated \"Workspace and channel identifiers\" and \"User accounts and profiles\"\u0013that the app will systematically harvest once it has read access."
              ],
              "related_interfaces": [
                "Web API methods documented at https://docs.slack.dev/apis/web-api: These HTTP-based endpoints are invoked with OAuth tokens and are the primary interface for an app to programmatically read channel histories, retrieve messages and threads, and access file metadata and content for any channels and users covered by its scopes."
              ],
              "related_data": [
                "Files stored in Slack, including uploads and attachments linked from messages (from \"Message and File Storage\"), representing high-value documents that can be fetched or downloaded by the app where its file-read scopes apply.",
                "Messages, threads, and reactions in channels and DMs (from \"Channel and Direct Message-based Collaboration\" and \"Core Collaboration Service\"), which constitute the primary message content the app will collect from prioritized channels and users.",
                "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
                "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
              ],
              "notes": "This step builds a curated index of potentially sensitive files based on type and context, similar to malware that searches for specific extensions before copying (T1119)."
            },
            {
              "step_id": 4,
              "description": "For each high-priority file in the candidate list (for example, office documents, PDFs, archives, or code files associated with sensitive projects or privileged users), the backend uses Slack Web API file-related methods to obtain download information, then issues authenticated HTTP requests using the app OAuth token to retrieve the full binary content. The attacker stores the file bodies and associated metadata (workspace, channel, user, timestamps) in attacker-controlled storage, skipping or down-prioritizing obviously low-value or highly voluminous files (such as media-heavy channels) to reduce noise and keep network usage within normal ranges.",
              "related_capabilities": [
                "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
                "Message and File Storage (Technical Components & Data Flows): Represents the persistent store for \"messages, threads, files, and canvas content,\" which the malicious app can tap via Web API methods to pull historical content from prioritized channels and users, and to download file contents and metadata."
              ],
              "related_interfaces": [
                "Web API methods documented at https://docs.slack.dev/apis/web-api: These HTTP-based endpoints are invoked with OAuth tokens and are the primary interface for an app to programmatically read channel histories, retrieve messages and threads, and access file metadata and content for any channels and users covered by its scopes."
              ],
              "related_data": [
                "Files stored in Slack, including uploads and attachments linked from messages (from \"Message and File Storage\"), representing high-value documents that can be fetched or downloaded by the app where its file-read scopes apply.",
                "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
                "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
              ],
              "notes": "This is the primary collection of file contents. From Slack\u0019s perspective it appears as a legitimate app downloading files it has access to, but the selection criteria are driven by the attacker\u0019s sensitivity ranking rather than user needs."
            },
            {
              "step_id": 5,
              "description": "The app\u0019s Events API endpoint receives message- and file-related events pushed by Slack. For each event, the backend inspects the included channel and user identifiers; if they match the precomputed target sets, the app immediately invokes Web API methods to pull the full message (including any threads) and associated files or to refresh file metadata and download links. These payloads are then stored in the same datastore as the historical collection, giving near-real-time coverage of new sensitive conversations and documents in targeted channels without broad polling.",
              "related_capabilities": [
                "Events API, Slash Commands, and Interactivity: Exposes the Events API webhook channel (https://docs.slack.dev/apis/events-api/) that delivers event payloads for \"messages, reactions, and user actions,\" allowing the app to automatically ingest new messages and file-sharing activity from targeted channels and users as they occur.",
                "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
                "Channel and Direct Message-based Collaboration (Core Collaboration Service): Defines the primary data targets\u0013\"Messages, threads, and reactions\" in channels and DMs, along with associated \"Workspace and channel identifiers\" and \"User accounts and profiles\"\u0013that the app will systematically harvest once it has read access.",
                "Message and File Storage (Technical Components & Data Flows): Represents the persistent store for \"messages, threads, files, and canvas content,\" which the malicious app can tap via Web API methods to pull historical content from prioritized channels and users, and to download file contents and metadata."
              ],
              "related_interfaces": [
                "Events API webhook interface documented at https://docs.slack.dev/apis/events-api/: Slack pushes event payloads describing \"messages, reactions, and user actions\" to the app\u0019s endpoint, enabling continuous, automated collection of new messages and shared files from prioritized channels and users without polling.",
                "Web API methods documented at https://docs.slack.dev/apis/web-api: These HTTP-based endpoints are invoked with OAuth tokens and are the primary interface for an app to programmatically read channel histories, retrieve messages and threads, and access file metadata and content for any channels and users covered by its scopes."
              ],
              "related_data": [
                "Event payloads describing messages, reactions, and user actions (from \"Events API, Slash Commands, and Interactivity\"), which include details needed to identify which channel, user, and content are involved in each event, allowing the app to filter and ingest only events from targeted channels or user accounts.",
                "Messages, threads, and reactions in channels and DMs (from \"Channel and Direct Message-based Collaboration\" and \"Core Collaboration Service\"), which constitute the primary message content the app will collect from prioritized channels and users.",
                "Files stored in Slack, including uploads and attachments linked from messages (from \"Message and File Storage\"), representing high-value documents that can be fetched or downloaded by the app where its file-read scopes apply.",
                "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
                "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
              ],
              "notes": "This step achieves continuous, automated harvesting of new content in targeted areas using only documented Events API and Web API calls. It aligns with Messaging Applications (monitoring Slack for sensitive discussions) and Automated Collection (event-driven collection without manual operator action)."
            },
            {
              "step_id": 6,
              "description": "To maintain complete coverage over time while minimizing redundant API calls, the backend tracks per-channel and per-user watermarks (such as the latest message timestamp or ID and last-seen file ID). On a scheduled basis, it runs a background job that calls Web API history and file-listing methods with parameters that restrict results to items newer than the stored watermarks. Any new messages or files not already captured via Events API are ingested and stored, and the watermarks are updated. This produces a comprehensive archive of targeted conversations and documents with low, steady API usage.",
              "related_capabilities": [
                "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
                "Message and File Storage (Technical Components & Data Flows): Represents the persistent store for \"messages, threads, files, and canvas content,\" which the malicious app can tap via Web API methods to pull historical content from prioritized channels and users, and to download file contents and metadata.",
                "Channel and Direct Message-based Collaboration (Core Collaboration Service): Defines the primary data targets\u0013\"Messages, threads, and reactions\" in channels and DMs, along with associated \"Workspace and channel identifiers\" and \"User accounts and profiles\"\u0013that the app will systematically harvest once it has read access."
              ],
              "related_interfaces": [
                "Web API methods documented at https://docs.slack.dev/apis/web-api: These HTTP-based endpoints are invoked with OAuth tokens and are the primary interface for an app to programmatically read channel histories, retrieve messages and threads, and access file metadata and content for any channels and users covered by its scopes."
              ],
              "related_data": [
                "Messages, threads, and reactions in channels and DMs (from \"Channel and Direct Message-based Collaboration\" and \"Core Collaboration Service\"), which constitute the primary message content the app will collect from prioritized channels and users.",
                "Files stored in Slack, including uploads and attachments linked from messages (from \"Message and File Storage\"), representing high-value documents that can be fetched or downloaded by the app where its file-read scopes apply.",
                "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
                "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
              ],
              "notes": "This scheduled, incremental backfill and deduplication embodies T1119 Automated Collection: a long-running, low-and-slow job that continuously harvests new Slack data via APIs without re-scraping full histories."
            }
          ],
          "capabilities_used": [
            "Slack App Platform \u0013 Web API and Surfaces: Provides \"Web API methods for interacting with Slack programmatically\" (https://docs.slack.dev/apis/web-api), enabling an app with appropriate OAuth scopes to list channels, identify users, and read messages and files within the boundaries of its granted access.",
            "Channel and Direct Message-based Collaboration (Core Collaboration Service): Defines the primary data targets\u0013\"Messages, threads, and reactions\" in channels and DMs, along with associated \"Workspace and channel identifiers\" and \"User accounts and profiles\"\u0013that the app will systematically harvest once it has read access.",
            "Message and File Storage (Technical Components & Data Flows): Represents the persistent store for \"messages, threads, files, and canvas content,\" which the malicious app can tap via Web API methods to pull historical content from prioritized channels and users, and to download file contents and metadata.",
            "Events API, Slash Commands, and Interactivity: Exposes the Events API webhook channel (https://docs.slack.dev/apis/events-api/) that delivers event payloads for \"messages, reactions, and user actions,\" allowing the app to automatically ingest new messages and file-sharing activity from targeted channels and users as they occur."
          ],
          "interfaces_used": [
            "Web API methods documented at https://docs.slack.dev/apis/web-api: These HTTP-based endpoints are invoked with OAuth tokens and are the primary interface for an app to programmatically read channel histories, retrieve messages and threads, and access file metadata and content for any channels and users covered by its scopes.",
            "Events API webhook interface documented at https://docs.slack.dev/apis/events-api/: Slack pushes event payloads describing \"messages, reactions, and user actions\" to the app\u0019s endpoint, enabling continuous, automated collection of new messages and shared files from prioritized channels and users without polling."
          ],
          "data_accessed": [
            "Messages, threads, and reactions in channels and DMs (from \"Channel and Direct Message-based Collaboration\" and \"Core Collaboration Service\"), which constitute the primary message content the app will collect from prioritized channels and users.",
            "Files stored in Slack, including uploads and attachments linked from messages (from \"Message and File Storage\"), representing high-value documents that can be fetched or downloaded by the app where its file-read scopes apply.",
            "Workspace, channel, and user identifiers (from \"Channel and Direct Message-based Collaboration\" and \"Slack App Platform \u0013 Web API and Surfaces\"), which the app can use to maintain lists of prioritized channels, users, and associated files to focus its collection on sensitive areas rather than the entire workspace.",
            "Event payloads describing messages, reactions, and user actions (from \"Events API, Slash Commands, and Interactivity\"), which include details needed to identify which channel, user, and content are involved in each event, allowing the app to filter and ingest only events from targeted channels or user accounts.",
            "OAuth tokens, app credentials, and scope grants (from \"Slack App Platform \u0013 Web API and Surfaces\" and auth/identity behaviours), which define the maximum set of channels, messages, and files the app can read via the Web API and determine whether it can register for the relevant Events API subscriptions."
          ],
          "preconditions_required": [
            "The malicious app remains installed in the target workspace and has not had its OAuth tokens revoked or scopes reduced after the Discovery phase.",
            "The app\u0019s OAuth scopes continue to include read access to the relevant message histories (for example, channel history and any private channels/DMs it targets) and to file metadata/content where collection is desired.",
            "The app\u0019s Events API subscription includes message- and file-related event types for the workspace, and Slack is successfully delivering events to the app\u0019s externally reachable webhook endpoint.",
            "For private channels or DMs that are considered high value, the app must have been added as a member (or otherwise be authorized) so that its token can read their history and associated files.",
            "Workspace retention and legal hold settings must still retain the historical messages and files the attacker wants; content already purged by retention policies cannot be collected via APIs."
          ],
          "constraints_encountered": [
            "OAuth scopes and channel membership strictly bound what data the app can see; channels, DMs, or files outside those scopes or without app membership cannot be collected through documented Slack APIs.",
            "Slack Web API rate limits per method and per token require the attacker to spread history and file-download calls over time, especially in large workspaces or when targeting many channels, or risk hitting rate-limit responses that could appear anomalous.",
            "High-volume history reads and file downloads from a single app may be visible to workspace administrators or security tooling that monitors app activity, potentially flagging unusual data access patterns.",
            "Events API delivery depends on the app\u0019s endpoint remaining available and correctly acknowledging events; misconfiguration or outages could introduce gaps in real-time collection that must be backfilled via history calls.",
            "Enterprise DLP/CASB or network monitoring around Slack may detect large or unusual patterns of file downloads or message access from the app\u0019s IP ranges, limiting how aggressive the attacker can be without detection."
          ],
          "evasion_considerations": [
            "Throttle Web API calls and respect Slack\u0019s documented rate limits, distributing history and file-download requests over longer periods (for example, hours or days) to avoid bursts that stand out from typical app behavior.",
            "Prioritize only a subset of truly high-value channels, users, and file types so that overall data volume and number of API requests remain comparable to a legitimate productivity or archiving app rather than a full workspace export.",
            "Rely on Events API-driven collection for most new data and use scheduled history backfills only to close gaps, minimizing repeated full sweeps of channel histories that might be more noticeable.",
            "Perform initial large backfills during off-peak hours for the victim organization and then shift to low-and-slow incremental collection, reducing the likelihood of coinciding with active monitoring or manual observations.",
            "Maintain a plausible, benign app description and feature set (for example, \"analytics\" or \"knowledge search\") so that reading messages and files appears consistent with declared functionality if administrators review app behavior or scopes."
          ],
          "comments_for_orchestrator": "This method fully achieves the Collection tactic for the scenario by using only Slack\u0019s documented Web API and Events API to gather historical and real-time messages plus file contents from prioritized channels and users into the attacker-controlled backend. Subsequent tactics (such as Exfiltration or Command and Control) can build on the fact that this backend now holds a curated, continuously updated archive of the workspace\u0019s most sensitive Slack content."
        },
        {
          "can_achieve": true,
          "tactic_name": "Exfiltration",
          "selected_techniques": [
            {
              "stix_id": "attack-pattern--40597f16-0963-4249-bf4c-ac93b7fb9807",
              "name": "Exfiltration Over Web Service",
              "rationale": "The malicious Slack app can use Slack itself as a web service to exfiltrate data by posting harvested messages and files into an attacker-controlled workspace via the documented Web API. This mirrors real-world use of SaaS/web APIs (e.g., Google Drive, Telegram, Outlook) for exfiltration, as seen in ATT&CK examples for this technique."
            },
            {
              "stix_id": "attack-pattern--d4bdbdea-eaec-4071-b4f9-5105e12ea4b6",
              "name": "Transfer Data to Cloud Account",
              "rationale": "The app backend, which already holds the harvested Slack data and can make outbound HTTPS requests, can upload compressed archives to attacker-controlled cloud storage accounts (e.g., S3, Mega, Google Drive) using their public APIs. This fits \"Transfer Data to Cloud Account\" and aligns with ATT&CK examples where adversaries use cloud storage like Mega/Megasync for bulk exfiltration."
            }
          ],
          "method_steps": [
            {
              "step_id": 1,
              "description": "Stage harvested Slack messages and files on the app backend into compressible bundles (e.g., by channel, time window, or file type) to fit within Slack and cloud-provider size and rate limits.",
              "related_capabilities": [
                "Message and File Storage (technical component) – Slack’s persistent store for messages, threads, files, and canvas content is the underlying data source that Web API calls, workflows, and integrations act upon when harvesting and subsequently forwarding content out of the platform.",
                "Channel and Direct Message-based Collaboration – Channels and DMs constitute the primary repositories of the messages (and any in-line references to files) that are harvested by the app backend and subsequently exfiltrated via APIs and integrations."
              ],
              "related_interfaces": [],
              "related_data": [
                "Messages, threads, and reactions stored for channels and direct messages in the Core Collaboration Service and the 'Message and File Storage' component, which form the primary corpus of harvested content.",
                "Files associated with workspace collaboration (as referenced by 'Message and File Storage' and AI indexing of 'messages, files, and canvas content'), including any metadata or links that can be transmitted via APIs or workflows."
              ],
              "notes": "This is attacker-side preprocessing of data already collected from the victim workspace. Bundling allows the attacker to respect Slack Web API message/file size limits and cloud storage API object-size constraints while making uploads efficient."
            },
            {
              "step_id": 2,
              "description": "Using the OAuth token for the attacker-controlled workspace, programmatically create or select a private \"exfiltration\" channel (or bot DM) where stolen content will be deposited.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces – Apps with OAuth tokens can use documented Web API methods to programmatically send messages and rich blocks, allowing a compromised app to forward harvested content into channels or DMs in any workspace where it is installed (including an attacker-controlled workspace).",
                "Channel and Direct Message-based Collaboration – Channels and DMs constitute the primary repositories of the messages (and any in-line references to files) that are harvested by the app backend and subsequently exfiltrated via APIs and integrations.",
                "Workspace and Organisation Administration – Admin capabilities to install/approve apps, govern workflows, and manage app scopes determine whether high-privilege apps and connectors exist that can read broad message/file data sets and communicate with external services, directly influencing the feasibility and scale of exfiltration."
              ],
              "related_interfaces": [
                "Web API – https://docs.slack.dev/apis/web-api – Main programmatic interface used by apps to send messages and render rich Block Kit content; a compromised app can call these methods to post harvested data into channels, DMs, or app surfaces in an attacker-controlled workspace.",
                "Surfaces APIs – https://docs.slack.dev/surfaces – Interfaces for composing app messages, modals, app home views, and canvases; exfiltrated content can be embedded into these surfaces in workspaces controlled by the attacker for staged collection or further relay."
              ],
              "related_data": [
                "App installation metadata, user and channel identifiers, and context payloads for surfaces and views, which enable precise targeting of where exfiltrated content is delivered inside attacker-controlled workspaces or integrated external systems."
              ],
              "notes": "The app uses methods such as conversations.create or conversations.open (via the Web API) with the attacker-workspace token. Because the workspace is attacker-controlled, the app can be given broad posting scopes (e.g., chat:write, files:write) and can create a private channel or bot DM that only attacker identities can access."
            },
            {
              "step_id": 3,
              "description": "Exfiltrate harvested message content into the attacker-controlled workspace by posting the staged text data as messages (and optionally files) into the exfiltration channel using the Web API.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces – Apps with OAuth tokens can use documented Web API methods to programmatically send messages and rich blocks, allowing a compromised app to forward harvested content into channels or DMs in any workspace where it is installed (including an attacker-controlled workspace).",
                "Channel and Direct Message-based Collaboration – Channels and DMs constitute the primary repositories of the messages (and any in-line references to files) that are harvested by the app backend and subsequently exfiltrated via APIs and integrations."
              ],
              "related_interfaces": [
                "Web API – https://docs.slack.dev/apis/web-api – Main programmatic interface used by apps to send messages and render rich Block Kit content; a compromised app can call these methods to post harvested data into channels, DMs, or app surfaces in an attacker-controlled workspace.",
                "Surfaces APIs – https://docs.slack.dev/surfaces – Interfaces for composing app messages, modals, app home views, and canvases; exfiltrated content can be embedded into these surfaces in workspaces controlled by the attacker for staged collection or further relay."
              ],
              "related_data": [
                "Messages, threads, and reactions stored for channels and direct messages in the Core Collaboration Service and the 'Message and File Storage' component, which form the primary corpus of harvested content.",
                "App installation metadata, user and channel identifiers, and context payloads for surfaces and views, which enable precise targeting of where exfiltrated content is delivered inside attacker-controlled workspaces or integrated external systems."
              ],
              "notes": "The backend iterates over staged bundles and makes chat.postMessage (and, where needed, files.upload-style) calls to the attacker workspace. Messages can contain JSON summaries, raw text, or base64/compressed blobs of the original conversations. This directly implements Exfiltration Over Web Service by treating Slack (attacker workspace) as the exfil endpoint."
            },
            {
              "step_id": 4,
              "description": "Re-upload harvested file content (documents, images, archives) into the attacker-controlled workspace as file uploads, potentially bundling multiple original files into compressed archives to minimise the number of Slack API calls.",
              "related_capabilities": [
                "Slack App Platform – Web API and Surfaces – Apps with OAuth tokens can use documented Web API methods to programmatically send messages and rich blocks, allowing a compromised app to forward harvested content into channels or DMs in any workspace where it is installed (including an attacker-controlled workspace).",
                "Message and File Storage (technical component) – Slack’s persistent store for messages, threads, files, and canvas content is the underlying data source that Web API calls, workflows, and integrations act upon when harvesting and subsequently forwarding content out of the platform."
              ],
              "related_interfaces": [
                "Web API – https://docs.slack.dev/apis/web-api – Main programmatic interface used by apps to send messages and render rich Block Kit content; a compromised app can call these methods to post harvested data into channels, DMs, or app surfaces in an attacker-controlled workspace."
              ],
              "related_data": [
                "Files associated with workspace collaboration (as referenced by 'Message and File Storage' and AI indexing of 'messages, files, and canvas content'), including any metadata or links that can be transmitted via APIs or workflows."
              ],
              "notes": "Similar to threat actors that upload stolen documents to email or cloud storage accounts, the backend uses Web API file-upload capabilities to push ZIP archives of stolen files into the exfiltration channel. The attacker can later download them from their workspace or rely on downstream integrations to move them further."
            },
            {
              "step_id": 5,
              "description": "Optionally use marketplace storage integrations (e.g., Box, Dropbox Dash) installed in the attacker-controlled workspace to automatically sync the exfiltration channel’s files and messages into attacker-owned cloud accounts.",
              "related_capabilities": [
                "Slack App Marketplace and Third-party Integrations – Marketplace apps for tools like Box, Dropbox Dash, and other SaaS platforms exchange events and data between Slack and external systems using documented APIs, providing ready-made channels to deposit Slack content into attacker-controlled external accounts if such apps are misused or malicious.",
                "Workflow Builder and No-code Workflow Automation – User-defined workflows can route collected inputs or message-derived data through app-provided steps and connectors to other systems, creating administrative or end-user-configurable paths that can be abused to move data out of Slack.",
                "Workflow Execution and Scheduling Engine – Background execution of workflows based on events or schedules allows large-scale or periodic exfiltration routines without ongoing interactive user actions once a malicious or misconfigured workflow is in place."
              ],
              "related_interfaces": [
                "Slack App Marketplace – https://slack.com/marketplace – Distribution and configuration interface for third-party apps that bridge Slack with external SaaS (including Box, Dropbox Dash, and other knowledge or storage tools), enabling documented, API-based flows that move Slack content into external cloud services.",
                "Workflow Builder UI – https://slack.com/features/workflow-automation – Configuration surface where end users and admins assemble workflows that may include app-provided steps targeting external systems, which can be abused to route sensitive content out of Slack with little visibility."
              ],
              "related_data": [
                "Files associated with workspace collaboration (as referenced by 'Message and File Storage' and AI indexing of 'messages, files, and canvas content'), including any metadata or links that can be transmitted via APIs or workflows.",
                "Workflow inputs, form submissions, and custom-step payloads that may embed or reference sensitive message and file content as they move through the Workflow Builder and Automation Engine."
              ],
              "notes": "Once the malicious app has placed data into a channel in the attacker workspace, standard Box/Dropbox-style connectors or workflows can mirror that channel’s content into attacker-controlled cloud accounts. This composes two distinct but documented flows (Slack → integration → external SaaS) into an additional transfer-to-cloud-account exfil path."
            },
            {
              "step_id": 6,
              "description": "Directly upload compressed archives of the harvested Slack data from the app backend to attacker-controlled cloud storage (e.g., S3, Mega, Google Drive) using their HTTPS APIs, leveraging the same HTTP capabilities used for Slack app custom steps and external integrations.",
              "related_capabilities": [
                "Workflow Automation APIs and Custom Steps – Custom workflow steps implemented via Bolt SDKs can perform arbitrary operations and use “tokens and credentials for external systems invoked by workflows,” giving a programmable path to forward workflow inputs and Slack context to external HTTP or storage APIs.",
                "Workflow and Automation Flow (technical component) – Explicitly described as allowing workflows to “call internal APIs or external integrations,” making it a core mechanism by which Slack-originating flows can reach external HTTPS services.",
                "Slack App Platform – Web API and Surfaces – Apps with OAuth tokens and scopes can read messages, user inputs, and other workspace data via the Web API and surfaces, then rely on Events/API callbacks and external app logic to move that data to arbitrary external services."
              ],
              "related_interfaces": [
                "Custom workflow step APIs via Bolt SDKs – https://docs.slack.dev/tools/bolt-js/concepts/custom-steps – Custom steps run in external app code when invoked by workflows, with access to workflow inputs and Slack context that can then be forwarded to any external HTTP or cloud storage API.",
                "Events API webhook delivery – https://docs.slack.dev/apis/events-api/ – Slack sends HTTPS POST requests containing event payloads (e.g., message events, user actions) to app-specified endpoints, which can be attacker- or partner-controlled servers."
              ],
              "related_data": [
                "Messages, threads, and reactions from channels and direct messages, as described under core messaging, which can be included in Events API payloads or read via app Web API scopes before being sent externally.",
                "Files, threads, canvas content, and other collaboration artifacts stored in “Message and File Storage,” representing rich content that apps or workflows could read and then exfiltrate via integrations."
              ],
              "notes": "The backend uses standard HTTPS client calls to cloud APIs to push encrypted ZIP archives of the harvested Slack content, analogous to ATT&CK examples where APT28 or ransomware groups upload stolen data to Google Drive or Mega. Workflows or event triggers may initiate these uploads, but once the data is on the backend, the exfiltration is simply web-service API traffic to attacker cloud accounts."
            },
            {
              "step_id": 7,
              "description": "Schedule or event-trigger the exfiltration routines so that new data harvested from the victim workspace is periodically or automatically forwarded to the attacker workspace and cloud storage without further manual action.",
              "related_capabilities": [
                "Workflow Execution and Scheduling Engine – Background execution of workflows based on events or schedules allows large-scale or periodic exfiltration routines without ongoing interactive user actions once a malicious or misconfigured workflow is in place.",
                "Workflow Automation APIs and Custom Steps – Custom workflow steps implemented via Bolt SDKs receive workflow data and can perform arbitrary operations using tokens and credentials for external systems, enabling Slack-originating content to be pushed to external cloud services over HTTPS.",
                "Events API, Slash Commands, and Interactivity – The Events API delivers message and user action payloads over HTTPS to app-controlled endpoints, supplying the attacker’s backend with continuous streams of workspace content that can later be relayed or reshaped for exfiltration."
              ],
              "related_interfaces": [
                "Workflow and custom-step APIs – https://docs.slack.dev/workflows/comparing-workflows-apps and https://docs.slack.dev/tools/bolt-js/concepts/custom-steps – Programmatic interfaces for defining workflows and custom steps; these steps can accept Slack-originating data and then invoke external HTTPS APIs (e.g., cloud storage services) under the app’s control.",
                "Workflow Builder execution engine – exposed through the Workflow Builder UI and related APIs (https://slack.com/features/workflow-automation, https://docs.slack.dev/workflows/comparing-workflows-apps) – Executes defined workflows that may include steps targeting external integrations.",
                "Events API webhook delivery – https://docs.slack.dev/apis/events-api/ – Slack sends HTTPS POST requests containing event payloads (e.g., message events, user actions) to app-specified endpoints, which can be attacker- or partner-controlled servers."
              ],
              "related_data": [
                "Workflow inputs, form submissions, and custom-step payloads that may embed or reference sensitive message and file content as they move through the Workflow Builder and Automation Engine.",
                "Event payloads from the Events API, slash commands, and interactivity (e.g., command text, selected options, user IDs, channel IDs, action metadata) that are directly posted by Slack to external HTTPS endpoints."
              ],
              "notes": "By tying uploads to periodic workflows or specific Events API triggers, the attacker achieves ongoing, automated exfiltration of newly harvested Slack content to their workspace and cloud accounts, aligning with Automated Exfiltration over web services."
            }
          ],
          "capabilities_used": [
            "Slack App Platform – Web API and Surfaces – Apps with OAuth tokens can use documented Web API methods to programmatically send messages and rich blocks, allowing a compromised app to forward harvested content into channels or DMs in any workspace where it is installed (including an attacker-controlled workspace).",
            "Channel and Direct Message-based Collaboration – Channels and DMs constitute the primary repositories of the messages (and any in-line references to files) that are harvested by the app backend and subsequently exfiltrated via APIs and integrations.",
            "Message and File Storage (technical component) – Slack’s persistent store for messages, threads, files, and canvas content is the underlying data source that Web API calls, workflows, and integrations act upon when harvesting and subsequently forwarding content out of the platform.",
            "Workspace and Organisation Administration – Admin capabilities to install/approve apps, govern workflows, and manage app scopes determine whether high-privilege apps and connectors exist that can read broad message/file data sets and communicate with external services, directly influencing the feasibility and scale of exfiltration.",
            "Slack App Marketplace and Third-party Integrations – Marketplace apps for tools like Box, Dropbox Dash, and other SaaS platforms exchange events and data between Slack and external systems using documented APIs, providing ready-made channels to deposit Slack content into attacker-controlled external accounts if such apps are misused or malicious.",
            "Workflow Builder and No-code Workflow Automation – User-defined workflows can route collected inputs or message-derived data through app-provided steps and connectors to other systems, creating administrative or end-user-configurable paths that can be abused to move data out of Slack.",
            "Workflow Execution and Scheduling Engine – Background execution of workflows based on events or schedules allows large-scale or periodic exfiltration routines without ongoing interactive user actions once a malicious or misconfigured workflow is in place.",
            "Workflow Automation APIs and Custom Steps – Custom workflow steps implemented via Bolt SDKs receive workflow data and can perform arbitrary operations using tokens and credentials for external systems, enabling Slack-originating content to be pushed to external cloud services over HTTPS.",
            "Workflow and Automation Flow (technical component) – Explicitly described as allowing workflows to “call internal APIs or external integrations,” making it a core mechanism by which Slack-originating flows can reach external HTTPS services.",
            "Events API, Slash Commands, and Interactivity – The Events API delivers message and user action payloads over HTTPS to app-controlled endpoints, supplying the attacker’s backend with continuous streams of workspace content that can later be relayed or reshaped for exfiltration."
          ],
          "interfaces_used": [
            "Web API – https://docs.slack.dev/apis/web-api – Main programmatic interface used by apps to send messages and render rich Block Kit content; a compromised app can call these methods to post harvested data into channels, DMs, or app surfaces in an attacker-controlled workspace.",
            "Surfaces APIs – https://docs.slack.dev/surfaces – Interfaces for composing app messages, modals, app home views, and canvases; exfiltrated content can be embedded into these surfaces in workspaces controlled by the attacker for staged collection or further relay.",
            "Slack App Marketplace – https://slack.com/marketplace – Distribution and configuration interface for third-party apps that bridge Slack with external SaaS (including Box, Dropbox Dash, and other knowledge or storage tools), enabling documented, API-based flows that move Slack content into external cloud services.",
            "Workflow Builder UI – https://slack.com/features/workflow-automation – Configuration surface where end users and admins assemble workflows that may include app-provided steps targeting external systems, which can be abused to route sensitive content out of Slack with little visibility.",
            "Workflow and custom-step APIs – https://docs.slack.dev/workflows/comparing-workflows-apps and https://docs.slack.dev/tools/bolt-js/concepts/custom-steps – Programmatic interfaces for defining workflows and custom steps; these steps can accept Slack-originating data and then invoke external HTTPS APIs (e.g., cloud storage services) under the app’s control.",
            "Custom workflow step APIs via Bolt SDKs – https://docs.slack.dev/tools/bolt-js/concepts/custom-steps – Custom steps run in external app code when invoked by workflows, with access to workflow inputs and Slack context that can then be forwarded to any external HTTP or cloud storage API.",
            "Events API webhook delivery – https://docs.slack.dev/apis/events-api/ – Slack sends HTTPS POST requests containing event payloads (e.g., message events, user actions) to app-specified endpoints, which can be attacker- or partner-controlled servers.",
            "Workflow Builder execution engine – exposed through the Workflow Builder UI and related APIs (https://slack.com/features/workflow-automation, https://docs.slack.dev/workflows/comparing-workflows-apps) – Executes defined workflows that may include steps targeting external integrations."
          ],
          "data_accessed": [
            "Messages, threads, and reactions stored for channels and direct messages in the Core Collaboration Service and the 'Message and File Storage' component, which form the primary corpus of harvested content.",
            "Files associated with workspace collaboration (as referenced by 'Message and File Storage' and AI indexing of 'messages, files, and canvas content'), including any metadata or links that can be transmitted via APIs or workflows.",
            "App installation metadata, user and channel identifiers, and context payloads for surfaces and views, which enable precise targeting of where exfiltrated content is delivered inside attacker-controlled workspaces or integrated external systems.",
            "Workflow inputs, form submissions, and custom-step payloads that may embed or reference sensitive message and file content as they move through the Workflow Builder and Automation Engine.",
            "Messages, threads, and reactions from channels and direct messages, as described under core messaging, which can be included in Events API payloads or read via app Web API scopes before being sent externally.",
            "Files, threads, canvas content, and other collaboration artifacts stored in “Message and File Storage,” representing rich content that apps or workflows could read and then exfiltrate via integrations.",
            "Event payloads from the Events API, slash commands, and interactivity (e.g., command text, selected options, user IDs, channel IDs, action metadata) that are directly posted by Slack to external HTTPS endpoints."
          ],
          "preconditions_required": [
            "The malicious app already possesses harvested messages and files from the victim workspace on its backend (given in scenario).",
            "The app holds valid OAuth tokens for the attacker-controlled workspace with scopes that allow creating channels/DMs and posting messages and files (e.g., chat:write, files:write, channels:manage/conversations:write as applicable).",
            "The attacker-controlled workspace allows installation of the malicious app with the necessary posting scopes and, if used, allows installation of marketplace integrations like Box or Dropbox Dash.",
            "The backend has network egress and can perform outbound HTTPS requests to public cloud storage providers (e.g., S3, Mega, Google Drive) without being blocked.",
            "The attacker has valid credentials or API keys for the target cloud storage accounts to which the data will be uploaded.",
            "Optional: The attacker has configured any marketplace storage integrations in their workspace to sync a chosen exfiltration channel to attacker-owned external accounts."
          ],
          "constraints_encountered": [
            "Slack Web API rate limits on methods like chat.postMessage and file upload operations require the attacker to throttle requests or batch data into fewer, larger archives to avoid 429 responses and delays.",
            "Slack-enforced maximum message length and file-size limits may prevent uploading excessively large raw dumps in a single call, pushing the attacker toward compression, chunking, and multi-part archives.",
            "The malicious app must have obtained sufficient write scopes in the attacker workspace; if installation was mistakenly scoped too narrowly, it may be unable to create channels or upload files to all desired locations.",
            "If marketplace integrations (e.g., Box, Dropbox Dash) are used to propagate content out of Slack, those integrations introduce their own quotas, logging, and access controls that may restrict throughput or increase detection risk.",
            "Cloud storage providers typically log API requests and may enforce rate limits or anomaly detection on large data ingress, influencing how quickly and how much data can be exfiltrated in a single burst.",
            "Use of workflows or custom steps for scheduled exfil requires that workflow creation and execution are permitted in the attacker workspace and that the malicious app is allowed to provide or participate in those steps."
          ],
          "evasion_considerations": [
            "Perform exfiltration in a low-and-slow manner, spreading Web API posts and cloud uploads over time to avoid conspicuous spikes in outbound Slack or cloud storage activity.",
            "Compress and encrypt harvested data before uploading it to cloud storage so that provider-side content inspection or casual review of objects does not easily reveal Slack-originating content.",
            "Name exfiltration channels and uploaded archives to resemble benign operational logs or backups (e.g., '#ops-logs', 'backup-2025-01-01.zip') to blend in with typical integration and backup patterns.",
            "If marketplace integrations are used, target channels that already host automated notifications so that additional files and messages appear consistent with existing app traffic.",
            "Batch and summarise messages when posting into the attacker workspace, so that fewer API calls are needed and Slack-level telemetry shows modest, integration-like behaviour rather than raw bulk dumps.",
            "Align scheduled exfiltration workflows with common business hours and expected workflow execution patterns to reduce the chances that periodic uploads appear anomalous in timing-based monitoring."
          ],
          "comments_for_orchestrator": "This method assumes the collection phase is complete and focuses purely on moving already-harvested Slack data from the malicious app backend to attacker-controlled destinations using documented Slack and web APIs. The primary exfil path is via Slack Web API into an attacker workspace (Exfiltration Over Web Service), with a secondary, higher-volume path via direct HTTPS uploads to attacker cloud storage (Transfer Data to Cloud Account). Optional use of marketplace storage integrations and scheduled workflows can be toggled depending on prior steps in the chain and desired stealth. Subsequent tactics could involve Defense Evasion (e.g., cleaning up workflows or app configurations) or Impact, but are outside this step."
        }
      ],
      "attack_chain_summary_steps": [
        "1. Use consent phishing and a trusted Slack App Marketplace listing or direct install URL to persuade a target user/admin to authorize a malicious Slack app with broad read scopes.",
        "2. With the resulting OAuth tokens, enumerate users, channels/DMs, memberships, and file metadata via Slack Web API and Events API to map where sensitive data and privileged users reside.",
        "3. Systematically harvest historical and real-time messages and files from prioritized channels and users using Web API history and file methods plus Events API streams, storing content on the attacker’s backend.",
        "4. Exfiltrate staged Slack data by posting archives into an attacker-controlled Slack workspace using Web API and, optionally, syncing those channels to attacker-owned cloud storage or directly uploading archives via standard HTTPS APIs."
      ]
    },
    {
      "scenario_name": "Compromised User Exploits Slack AI and Enterprise Search for Internal Reconnaissance",
      "hypothesis": {
        "scenario_name": "Compromised User Exploits Slack AI and Enterprise Search for Internal Reconnaissance",
        "attack_target": "A compact, attacker-owned knowledge base (canvases and recon logs) that summarises sensitive systems, repositories, and internal processes across the organisation, derived from Slack AI and enterprise search and ready for later exfiltration.",
        "starting_tactic": "Initial Access",
        "objective_tactic": "Collection",
        "preconditions": "The attacker has valid credentials for a typical knowledge worker account in a large enterprise Slack workspace. That account has Slack AI entitlements and enterprise search enabled, is a member of a representative set of project and team channels, can create canvases and simple workflows, and is not a workspace or org admin.",
        "attack_flow_hypothesis": [
          {
            "step_name": "Use Slack AI and enterprise search as a discovery dashboard",
            "step_description": "Sign in as the compromised user, confirm Slack AI and enterprise search are available, and use broad AI/search queries plus filters to enumerate which internal and external data sources are indexed (Slack channels, files, canvases, and connected SaaS apps).",
            "step_mitre_technique": "T1526 / T1213 – Cloud Service Discovery and Data from Information Repositories via Slack AI and enterprise search",
            "step_mitre_tactic": "Discovery"
          },
          {
            "step_name": "Identify high-value channels, documents, and canvases",
            "step_description": "Iteratively query Slack AI and enterprise search for sensitive topics (e.g., production incidents, credentials, architecture) and inspect AI answers and search results to locate specific channels, canvases, files, and external spaces likely to contain important information.",
            "step_mitre_technique": "T1213 – Data from Information Repositories (Slack messages, canvases, files, and connected apps)",
            "step_mitre_tactic": "Discovery"
          },
          {
            "step_name": "Consolidate discovered knowledge into private canvases and logs",
            "step_description": "Create private canvases and a recon-log channel/DM, then use Slack AI, enterprise search, and a simple Workflow Builder flow to summarise and centralise key findings (per topic/system) into a small number of artefacts for later review or exfiltration.",
            "step_mitre_technique": "T1119 / T1213 – Automated Collection and Data from Information Repositories via AI summaries and workflows",
            "step_mitre_tactic": "Collection"
          }
        ]
      },
      "adversarial_methods": [
        {
          "can_achieve": true,
          "tactic_name": "Discovery",
          "selected_techniques": [
            {
              "stix_id": "attack-pattern--e49920b0-6c54-40c1-9571-73723653205f",
              "name": "Cloud Service Dashboard",
              "rationale": "The attacker uses Slack’s own web/desktop UI—especially the enterprise search and Slack AI views—as a consolidated dashboard over Slack and connected SaaS repositories. With valid user credentials, they can inspect which sources are indexed, how much content exists per source, and quickly open or preview items. This matches Cloud Service Dashboard, where adversaries use a cloud console GUI (rather than raw APIs) to enumerate resources and information in an operational environment."
            },
            {
              "stix_id": "attack-pattern--e24fcba8-2557-4442-a139-1ee2f2e784db",
              "name": "Cloud Service Discovery",
              "rationale": "Enterprise search indexes messages, files, canvases, and connected third-party apps. By issuing broad natural-language and keyword queries through Slack AI and enterprise search, the attacker learns which internal systems, SaaS tools, and repositories exist, and what kinds of data they contain (e.g., incident runbooks, architecture docs, customer data locations). This mirrors Cloud Service Discovery procedures (such as AADInternals/ROADTools/Pacu enumerating cloud services) but uses Slack’s AI/search layer as the discovery mechanism."
            }
          ],
          "method_steps": [
            {
              "step_id": 1,
              "description": "Access the Slack workspace as the compromised user and verify that the global search bar, Slack AI controls, and enterprise search entry points (e.g., \"search across your applications\") are visible in the desktop or web client.",
              "related_capabilities": [
                "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
                "Slack AI End-user Features: Provides embedded AI summarisation and assistance in channels, DMs, threads, huddles, and canvases, allowing an end user to condense and interpret large volumes of workspace content they can see (e.g., to reveal key decisions, references to systems, or important documents).",
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "Slack desktop/web/mobile clients for browsing channels, DMs, and canvases (Core Collaboration Service UI): Provide the starting point for navigating to content that will be searched or summarised, and for opening files or documents uncovered via enterprise search results.",
                "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content."
              ],
              "related_data": [
                "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Search indexes and AI embeddings (Search Indexes and AI Embeddings storage component): Derived representations of content that make semantic and natural-language retrieval effective, allowing AI to surface related or summarised information even when query terms don’t exactly match document text."
              ],
              "notes": "This step assumes the precondition (valid user session) is already met and simply confirms that Slack AI and enterprise search are exposed to this account in the UI, setting up the Slack client as the attacker’s cloud-service \"dashboard\"."
            },
            {
              "step_id": 2,
              "description": "Use the enterprise search results view to enumerate which data sources and connected applications are indexed (e.g., Slack messages, files, canvases, and any third-party repositories) by running a broad or placeholder search and inspecting the available source/category filters.",
              "related_capabilities": [
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "Third-party SaaS Integrations used as Enterprise Search sources: Enterprise search can include content from tools like Box, Dropbox Dash, Notion, and others listed under marketplace integrations, so a non-admin can use Slack’s single search interface to reach into multiple external data stores if those are configured as search sources.",
                "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content.",
                "Enterprise search UI for connected apps (Help article \"Search across your applications with enterprise search\"): Allows an end user to run cross-application queries, surfacing results from Slack plus any admin-configured external repositories."
              ],
              "related_data": [
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Metadata and content from connected third-party applications (Third-party SaaS Integrations & Enterprise Search): Records from tools like Box, Dropbox Dash, Notion, and others that are included as enterprise search sources, expanding the scope of discoverable sensitive data beyond native Slack storage.",
                "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
                "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed."
              ],
              "notes": "By observing which source filters and app names appear in the enterprise search UI, the attacker discovers which SaaS platforms and repositories are reachable via Slack (e.g., specific document systems, wikis, or file stores), similar to using a cloud console to see enabled services."
            },
            {
              "step_id": 3,
              "description": "Issue broad natural-language AI search queries to get workspace-level overviews of where important information lives (for example, asking Slack AI where certain policies, runbooks, or architecture information are stored) and review the summarised results to identify key channels, canvases, and external repositories.",
              "related_capabilities": [
                "Slack AI End-user Features: Provides embedded AI summarisation and assistance in channels, DMs, threads, huddles, and canvases, allowing an end user to condense and interpret large volumes of workspace content they can see (e.g., to reveal key decisions, references to systems, or important documents).",
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "Third-party SaaS Integrations used as Enterprise Search sources: Enterprise search can include content from tools like Box, Dropbox Dash, Notion, and others listed under marketplace integrations, so a non-admin can use Slack’s single search interface to reach into multiple external data stores if those are configured as search sources.",
                "Canvases and Rich Surfaces for Knowledge Capture: Stores structured documentation, notes, and long-form content with AI-assisted authoring; these canvases are indexed and can be searched and summarised, giving a non-admin user a way to uncover concentrated knowledge and references to internal systems.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content.",
                "Enterprise search UI for connected apps (Help article \"Search across your applications with enterprise search\"): Allows an end user to run cross-application queries, surfacing results from Slack plus any admin-configured external repositories."
              ],
              "related_data": [
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
                "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed.",
                "Canvas documents and embedded content (Canvases and Rich Surfaces for Knowledge Capture): Long-form notes, plans, and documentation that often centralise important organisational knowledge and are included in AI-assisted search and summarisation.",
                "Metadata and content from connected third-party applications (Third-party SaaS Integrations & Enterprise Search): Records from tools like Box, Dropbox Dash, Notion, and others that are included as enterprise search sources, expanding the scope of discoverable sensitive data beyond native Slack storage.",
                "Huddle transcripts and notes used by AI huddle features (Slack AI End-user Features): Audio-derived text and summaries of meetings, which may capture sensitive discussions and can be surfaced or further summarised through AI features.",
                "Search indexes and AI embeddings (Search Indexes and AI Embeddings storage component): Derived representations of content that make semantic and natural-language retrieval effective, allowing AI to surface related or summarised information even when query terms don’t exactly match document text."
              ],
              "notes": "Slack AI effectively acts as a reconnaissance assistant: instead of manually exploring channels and apps, the attacker asks general questions and lets AI point them to the canonical places where particular topics or data types are concentrated."
            },
            {
              "step_id": 4,
              "description": "Refine search using built-in filters (such as messages vs files vs canvases, time ranges, or specific workspaces) and iterate on queries to list concrete high-value channels, documents, and canvases that match sensitive or strategic topics, opening selected results in the client for cursory inspection.",
              "related_capabilities": [
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
                "Canvases and Rich Surfaces for Knowledge Capture: Stores structured documentation, notes, and long-form content with AI-assisted authoring; these canvases are indexed and can be searched and summarised, giving a non-admin user a way to uncover concentrated knowledge and references to internal systems.",
                "Third-party SaaS Integrations used as Enterprise Search sources: Enterprise search can include content from tools like Box, Dropbox Dash, Notion, and others listed under marketplace integrations, so a non-admin can use Slack’s single search interface to reach into multiple external data stores if those are configured as search sources.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing."
              ],
              "related_interfaces": [
                "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content.",
                "Slack desktop/web/mobile clients for browsing channels, DMs, and canvases (Core Collaboration Service UI): Provide the starting point for navigating to content that will be searched or summarised, and for opening files or documents uncovered via enterprise search results."
              ],
              "related_data": [
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
                "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed.",
                "Canvas documents and embedded content (Canvases and Rich Surfaces for Knowledge Capture): Long-form notes, plans, and documentation that often centralise important organisational knowledge and are included in AI-assisted search and summarisation.",
                "Metadata and content from connected third-party applications (Third-party SaaS Integrations & Enterprise Search): Records from tools like Box, Dropbox Dash, Notion, and others that are included as enterprise search sources, expanding the scope of discoverable sensitive data beyond native Slack storage."
              ],
              "notes": "This step turns high-level AI guidance into concrete lists of channels and artefacts (e.g., specific project channels, runbook canvases, critical design docs) that the attacker now knows exist and can potentially target in later stages."
            },
            {
              "step_id": 5,
              "description": "Open the most promising channels identified and use in-channel Slack AI controls (such as summarising long histories or recent activity) to quickly learn what systems, projects, and data types are discussed there, without manually reading the full message history.",
              "related_capabilities": [
                "Slack AI End-user Features: Provides embedded AI summarisation and assistance in channels, DMs, threads, huddles, and canvases, allowing an end user to condense and interpret large volumes of workspace content they can see (e.g., to reveal key decisions, references to systems, or important documents).",
                "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "In-channel and DM AI controls (Slack AI End-user Features – AI controls in channels, DMs, threads, huddles, and canvases): Let a user request AI summaries of long conversations or threads, which can quickly highlight sensitive topics, decisions, or references to internal systems and documents without reading every message.",
                "Slack desktop/web/mobile clients for browsing channels, DMs, and canvases (Core Collaboration Service UI): Provide the starting point for navigating to content that will be searched or summarised, and for opening files or documents uncovered via enterprise search results."
              ],
              "related_data": [
                "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
                "Huddle transcripts and notes used by AI huddle features (Slack AI End-user Features): Audio-derived text and summaries of meetings, which may capture sensitive discussions and can be surfaced or further summarised through AI features.",
                "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed.",
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Search indexes and AI embeddings (Search Indexes and AI Embeddings storage component): Derived representations of content that make semantic and natural-language retrieval effective, allowing AI to surface related or summarised information even when query terms don’t exactly match document text."
              ],
              "notes": "Channel-level AI summaries can reveal, in a few prompts, which internal applications, environments, and processes are regularly discussed (for example, production systems, deployment pipelines, incident names), significantly accelerating environmental discovery."
            },
            {
              "step_id": 6,
              "description": "Within the enterprise search UI, systematically toggle filters to each connected third-party application in turn and run generic queries, using result titles, folders/paths, and snippet previews to map which external repositories and spaces exist and what categories of data they contain.",
              "related_capabilities": [
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "Third-party SaaS Integrations used as Enterprise Search sources: Enterprise search can include content from tools like Box, Dropbox Dash, Notion, and others listed under marketplace integrations, so a non-admin can use Slack’s single search interface to reach into multiple external data stores if those are configured as search sources.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content.",
                "Enterprise search UI for connected apps (Help article \"Search across your applications with enterprise search\"): Allows an end user to run cross-application queries, surfacing results from Slack plus any admin-configured external repositories."
              ],
              "related_data": [
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Metadata and content from connected third-party applications (Third-party SaaS Integrations & Enterprise Search): Records from tools like Box, Dropbox Dash, Notion, and others that are included as enterprise search sources, expanding the scope of discoverable sensitive data beyond native Slack storage.",
                "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed."
              ],
              "notes": "This is classic Cloud Service Discovery via a GUI: each external app’s search results expose its existence, naming conventions (e.g., space or folder names), and rough content types, revealing where sensitive data likely resides outside of Slack itself."
            },
            {
              "step_id": 7,
              "description": "Open the highest-value canvases and documents discovered (such as internal runbooks, architecture overviews, or policy documents) and invoke AI canvas features or built-in summarisation to extract concise descriptions of key systems, data flows, and related repositories.",
              "related_capabilities": [
                "Canvases and Rich Surfaces for Knowledge Capture: Stores structured documentation, notes, and long-form content with AI-assisted authoring and summarisation; these canvases are indexed and can be searched and summarised, giving a non-admin user a way to uncover concentrated knowledge and references to internal systems.",
                "Slack AI End-user Features: Provides embedded AI summarisation and assistance in channels, DMs, threads, huddles, and canvases, allowing an end user to condense and interpret large volumes of workspace content they can see (e.g., to reveal key decisions, references to systems, or important documents).",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "AI features in canvases (\"Use AI to write or edit content in a canvas\"): Enables summarisation and transformation of canvas content, helping a non-admin condense and extract key information from rich internal documentation they can access.",
                "Slack desktop/web/mobile clients for browsing channels, DMs, and canvases (Core Collaboration Service UI): Provide the starting point for navigating to content that will be searched or summarised, and for opening files or documents uncovered via enterprise search results."
              ],
              "related_data": [
                "Canvas documents and embedded content (Canvases and Rich Surfaces for Knowledge Capture): Long-form notes, plans, and documentation that often centralise important organisational knowledge and are included in AI-assisted search and summarisation.",
                "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed.",
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Search indexes and AI embeddings (Search Indexes and AI Embeddings storage component): Derived representations of content that make semantic and natural-language retrieval effective, allowing AI to surface related or summarised information even when query terms don’t exactly match document text."
              ],
              "notes": "Because canvases and formal documents concentrate institutional knowledge, AI summaries of them will often list core internal systems, data classifications, access models, and pointers to other repositories, giving the attacker a high-level architecture map quickly."
            },
            {
              "step_id": 8,
              "description": "Search for automatically generated huddle or meeting summaries and related note canvases, then apply AI summarisation again to these artefacts to uncover additional references to incidents, new systems, or sensitive projects that may not yet be well-documented elsewhere.",
              "related_capabilities": [
                "Slack AI End-user Features: Provides embedded AI summarisation and assistance in channels, DMs, threads, huddles, and canvases, allowing an end user to condense and interpret large volumes of workspace content they can see (e.g., to reveal key decisions, references to systems, or important documents).",
                "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
                "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
                "Canvases and Rich Surfaces for Knowledge Capture: Stores structured documentation, notes, and long-form content with AI-assisted authoring and summarisation; these canvases are indexed and can be searched and summarised, giving a non-admin user a way to uncover concentrated knowledge and references to internal systems.",
                "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
                "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
                "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses."
              ],
              "related_interfaces": [
                "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content.",
                "In-channel and DM AI controls (Slack AI End-user Features – AI controls in channels, DMs, threads, huddles, and canvases): Let a user request AI summaries of long conversations or threads, which can quickly highlight sensitive topics, decisions, or references to internal systems and documents without reading every message.",
                "AI features in canvases (\"Use AI to write or edit content in a canvas\"): Enables summarisation and transformation of canvas content, helping a non-admin condense and extract key information from rich internal documentation they can access.",
                "Slack desktop/web/mobile clients for browsing channels, DMs, and canvases (Core Collaboration Service UI): Provide the starting point for navigating to content that will be searched or summarised, and for opening files or documents uncovered via enterprise search results."
              ],
              "related_data": [
                "Huddle transcripts and notes used by AI huddle features (Slack AI End-user Features): Audio-derived text and summaries of meetings, which may capture sensitive discussions and can be surfaced or further summarised through AI features.",
                "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
                "Canvas documents and embedded content (Canvases and Rich Surfaces for Knowledge Capture): Long-form notes, plans, and documentation that often centralise important organisational knowledge and are included in AI-assisted search and summarisation.",
                "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
                "Search indexes and AI embeddings (Search Indexes and AI Embeddings storage component): Derived representations of content that make semantic and natural-language retrieval effective, allowing AI to surface related or summarised information even when query terms don’t exactly match document text."
              ],
              "notes": "Meeting and huddle summaries often capture work-in-progress discussions, including mentions of upcoming changes, incidents, or sensitive initiatives that may not yet be reflected in formal documentation, enriching the attacker’s overall picture of the environment."
            }
          ],
          "capabilities_used": [
            "Slack AI End-user Features: Provides embedded AI summarisation and assistance in channels, DMs, threads, huddles, and canvases, allowing an end user to condense and interpret large volumes of workspace content they can see (e.g., to reveal key decisions, references to systems, or important documents).",
            "Enterprise Search Across Slack and Connected Applications: Offers a unified enterprise search experience that queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, enabling an end user to discover information and files across many systems from a single search bar.",
            "Core Collaboration Service (Channel and Direct Message-based Collaboration): Serves as the primary repository of organisational conversations and shared files; sensitive information is likely stored in channels, DMs, and threads, which then feed into AI and search indices for discovery by any member with access.",
            "Canvases and Rich Surfaces for Knowledge Capture: Stores structured documentation, notes, and long-form content with AI-assisted authoring and summarisation; these canvases are indexed and can be searched and summarised, giving a non-admin user a way to uncover concentrated knowledge and references to internal systems.",
            "AI Indexing, Summarisation, and Search Pipelines: Background jobs index workspace messages, files, canvases, and connected app content into search indices and AI embeddings, enabling broad, cross-workspace retrieval and AI summarisation from the front-end even though the user interacts only via UI search controls.",
            "Search Indexes and AI Embeddings (storage component): Centralises searchable representations of Slack content and connected-application data; once content is indexed here, an end user’s enterprise searches and AI queries can retrieve and correlate it more easily than by manual channel-by-channel browsing.",
            "Slack AI and Agent Services (technical component): Backend services that power AI summarisation and enterprise search experiences; they can process a wide span of workspace data, so any over-permissive scoping configured by admins directly increases what a non-admin can discover via AI responses.",
            "Third-party SaaS Integrations used as Enterprise Search sources: Enterprise search can include content from tools like Box, Dropbox Dash, Notion, and others listed under marketplace integrations, so a non-admin can use Slack’s single search interface to reach into multiple external data stores if those are configured as search sources."
          ],
          "interfaces_used": [
            "Slack client search bar and AI search interface (Enterprise Search Across Slack and Connected Applications – \"Search bar and AI search interfaces in Slack clients\"): Primary UI where a non-admin can submit natural-language or keyword queries to retrieve messages, files, and connected app content.",
            "Enterprise search UI for connected apps (Help article \"Search across your applications with enterprise search\"): Allows an end user to run cross-application queries, surfacing results from Slack plus any admin-configured external repositories.",
            "In-channel and DM AI controls (Slack AI End-user Features – AI controls in channels, DMs, threads, huddles, and canvases): Let a user request AI summaries of long conversations or threads, which can quickly highlight sensitive topics, decisions, or references to internal systems and documents without reading every message.",
            "AI features in canvases (\"Use AI to write or edit content in a canvas\"): Enables summarisation and transformation of canvas content, helping a non-admin condense and extract key information from rich internal documentation they can access.",
            "Slack desktop/web/mobile clients for browsing channels, DMs, and canvases (Core Collaboration Service UI): Provide the starting point for navigating to content that will be searched or summarised, and for opening files or documents uncovered via enterprise search results."
          ],
          "data_accessed": [
            "Messages, threads, and reactions in channels and direct messages (Core Collaboration Service): Core collaboration data likely to contain sensitive discussions, project details, and references to internal systems, all of which are indexed by AI and enterprise search.",
            "Files shared in Slack (Message and File Storage): Documents, spreadsheets, and other attachments that may contain sensitive information and are searchable via enterprise search once indexed.",
            "Canvas documents and embedded content (Canvases and Rich Surfaces for Knowledge Capture): Long-form notes, plans, and documentation that often centralise important organisational knowledge and are included in AI-assisted search and summarisation.",
            "Huddle transcripts and notes used by AI huddle features (Slack AI End-user Features): Audio-derived text and summaries of meetings, which may capture sensitive discussions and can be surfaced or further summarised through AI features.",
            "Enterprise search index across Slack and connected apps (Enterprise Search Across Slack and Connected Applications): Aggregated index of messages, files, canvases, and third-party app content; this is the main data asset that enables broad discovery from a single query.",
            "Metadata and content from connected third-party applications (Third-party SaaS Integrations & Enterprise Search): Records from tools like Box, Dropbox Dash, Notion, and others that are included as enterprise search sources, expanding the scope of discoverable sensitive data beyond native Slack storage.",
            "Search indexes and AI embeddings (Search Indexes and AI Embeddings storage component): Derived representations of content that make semantic and natural-language retrieval effective, allowing AI to surface related or summarised information even when query terms don’t exactly match document text."
          ],
          "preconditions_required": [
            "Slack AI and enterprise search must be fully enabled for the compromised user account, including permissions to invoke AI summarisation in channels, DMs, canvases, and huddles.",
            "Workspace administrators must have configured at least some third-party SaaS integrations as enterprise search sources, and the compromised user must have sufficient access in those external tools for their content to appear in search results.",
            "Relevant historical content (messages, files, canvases, external documents, and huddle summaries) must have been successfully indexed by the AI indexing and enterprise search pipelines so that it is discoverable.",
            "The compromised user must still be a member of typical knowledge-worker channels where sensitive projects and discussions occur and must not have been restricted or quarantined after account compromise."
          ],
          "constraints_encountered": [
            "Enterprise search and Slack AI enforce existing access controls based on channel membership and external app permissions, so the attacker can only discover content that the compromised user is already entitled to access.",
            "Private channels, DMs, and external repositories to which the user does not belong will not appear in search or AI summaries, limiting the discovery scope to the user’s effective permissions.",
            "Org/workspace policies may disable or narrow AI summarisation features (for example, restricting AI usage in canvases or huddle summaries), reducing the attacker’s ability to use AI as a reconnaissance accelerator.",
            "Depending on configuration, some external sources may be excluded from enterprise search, preventing cross-repository discovery even if the integrations exist for other users.",
            "AI and search operations are likely logged and potentially monitored; unusually aggressive or wide-ranging queries and summarisation activity could trigger detection by security or compliance teams.",
            "AI features and enterprise search can be subject to rate limits or usage caps, constraining how quickly the attacker can run repeated summaries across many channels and documents."
          ],
          "evasion_considerations": [
            "Blend reconnaissance queries with normal-looking work activity in the Slack client, spacing out AI and search usage to avoid standing out in telemetry as anomalous or high-volume search behaviour.",
            "Prefer AI summaries and high-level overviews of long channels and documents instead of opening or downloading large numbers of individual files, which may reduce the volume of discrete access events and file downloads.",
            "Use natural, business-themed queries (for example, framed around projects or teams) rather than obviously sensitive or highly technical search terms that might be scrutinised by monitoring rules.",
            "Perform discovery during local business hours from typical client platforms (desktop/web) to resemble normal user behaviour patterns and avoid triggering geo- or time-based anomaly detection.",
            "Reuse prior AI responses and search results to refine subsequent queries, minimising the number of new, unusual queries while still expanding the map of systems and repositories."
          ],
          "comments_for_orchestrator": "Discovery is clearly achievable using only in-product Slack AI and enterprise search. The net result of this method is a detailed mental (or offline) map of: (a) which internal systems and SaaS platforms exist, (b) where sensitive artefacts are stored (channels, canvases, external spaces/folders), and (c) which documents capture architecture, data flows, or incident history. Subsequent tactics such as Collection and Exfiltration can reuse the identified channels, canvases, documents, and external repositories as precise targets, without needing additional privilege escalation in Slack itself. The main limiting factor is the compromised user’s existing access footprint and any organisational policy that restricts AI or enterprise search visibility."
        },
        {
          "can_achieve": true,
          "tactic_name": "Collection",
          "selected_techniques": [
            {
              "stix_id": "attack-pattern--d28ef391-8ed4-45dc-bc4a-2f43abf54416",
              "name": "Data from Information Repositories",
              "rationale": "Slack (channels, DMs, canvases, files, and connected apps indexed by enterprise search) functions as an information repository. The attacker uses Slack AI and enterprise search to mine these repositories for sensitive details, then consolidates them into new canvases and logs. This mirrors ATT&CK’s Data from Information Repositories technique, adapted to Slack as the collaboration and knowledge store."
            },
            {
              "stix_id": "attack-pattern--fb75213f-cfb0-40bf-a02f-3bad93d6601e",
              "name": "Messaging Applications",
              "rationale": "Slack is a messaging application containing sensitive chat history. As documented in ATT&CK, threat actors (e.g., Scattered Spider, LAPSUS$) search Slack/Teams for credentials and internal intel. Here, the attacker similarly mines Slack messages, but leverages Slack AI and workflows to summarize and centralize that chat-derived intelligence into succinct artefacts for later use."
            }
          ],
          "method_steps": [
            {
              "step_id": 1,
              "description": "Create private consolidation surfaces (a recon canvas and, optionally, a private \"recon-log\" channel or DM) and record the existing list of high-value topics, channels, canvases, and documents as the initial structure for collection.",
              "related_capabilities": [
                "Canvases and Rich Surfaces for Knowledge Capture – Canvases store long-form documents and embedded content with AI-assisted authoring and summarisation, making them a natural place to consolidate and persist aggregated sensitive information drawn from messages, huddles, files, and other canvases.",
                "Core Collaboration Service – Channels, DMs, threads, and huddles constitute the primary repositories of sensitive discussions and files that Slack AI and workflows can read (subject to access controls) and then aggregate into higher-level artefacts."
              ],
              "related_interfaces": [
                "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content.",
                "General Slack channel/DM/huddle UI (Core Collaboration Service) where AI huddle notes, message summaries, and workflow-triggered posts can appear, effectively acting as aggregation channels for sensitive content."
              ],
              "related_data": [
                "Canvas documents, embedded content, and comments (Canvases and Rich Surfaces for Knowledge Capture), which can themselves be sensitive and also serve as containers for AI-generated summaries of other data.",
                "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data."
              ],
              "notes": "The attacker names these artefacts innocuously (e.g., \"Project notes\"), but structures sections by topic, system, or business unit to receive later summaries and links."
            },
            {
              "step_id": 2,
              "description": "For each identified high-value channel and DM, use Slack AI from within the conversation to generate focused summaries (e.g., key systems, credentials mentioned, external services, decision records) and paste those summaries into the corresponding sections of the recon canvas.",
              "related_capabilities": [
                "Slack AI End-user Features – AI summarisation and assistance operate over messages and threads across channels and DMs, huddle audio and transcripts, and canvas content, plus enterprise search indexes, allowing broad aggregation of sensitive collaboration data into concise outputs.",
                "AI Indexing, Summarisation, and Search Pipelines – Platform-level indexing of workspace messages, files, canvas content, and connected application data underpins both AI features and enterprise search, effectively expanding the amount of data that can be queried and summarised from a single AI/search entry point.",
                "Core Collaboration Service – Channels, DMs, threads, and huddles constitute the primary repositories of sensitive discussions and files that Slack AI and workflows can read (subject to access controls) and then aggregate into higher-level artefacts.",
                "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows."
              ],
              "related_interfaces": [
                "AI controls in channels, DMs, threads, huddles, and canvases in the Slack client (Slack AI End-user Features UI; https://slack.com/features/ai and AI help article), which let users run summaries and ask questions that span large data sets.",
                "General Slack channel/DM/huddle UI (Core Collaboration Service) where AI huddle notes, message summaries, and workflow-triggered posts can appear, effectively acting as aggregation channels for sensitive content.",
                "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content."
              ],
              "related_data": [
                "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data.",
                "Files stored in Slack and referenced in search indices (Search Indexes and AI Embeddings and Enterprise Search key data), including documents containing confidential information that can be discovered via enterprise search and then summarised or referenced in consolidated artefacts.",
                "Canvas documents, embedded content, and comments (Canvases and Rich Surfaces for Knowledge Capture), which can themselves be sensitive and also serve as containers for AI-generated summaries of other data."
              ],
              "notes": "Prompts can mirror real-world tradecraft (e.g., \"Summarize references to VPN accounts, admin credentials, or access keys in this channel over the last 90 days\"), but the attacker stores only the AI’s concise output in the recon canvas."
            },
            {
              "step_id": 3,
              "description": "Open previously identified sensitive canvases and files and use Slack AI summarisation (from within canvas/file views or via AI in the surrounding channel) to produce short executive summaries and key data points, then copy those into the recon canvas alongside links to the originals.",
              "related_capabilities": [
                "Canvases and Rich Surfaces for Knowledge Capture – Canvases store long-form documents and embedded content with AI-assisted authoring and summarisation, making them a natural place to consolidate and persist aggregated sensitive information drawn from messages, huddles, files, and other canvases.",
                "Slack AI End-user Features – AI summarisation and assistance operate over messages and threads across channels and DMs, huddle audio and transcripts, and canvas content, plus enterprise search indexes, allowing broad aggregation of sensitive collaboration data into concise outputs.",
                "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows."
              ],
              "related_interfaces": [
                "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content.",
                "AI controls in channels, DMs, threads, huddles, and canvases in the Slack client (Slack AI End-user Features UI; https://slack.com/features/ai and AI help article), which let users run summaries and ask questions that span large data sets."
              ],
              "related_data": [
                "Canvas documents, embedded content, and comments (Canvases and Rich Surfaces for Knowledge Capture), which can themselves be sensitive and also serve as containers for AI-generated summaries of other data.",
                "Files stored in Slack and referenced in search indices (Search Indexes and AI Embeddings and Enterprise Search key data), including documents containing confidential information that can be discovered via enterprise search and then summarised or referenced in consolidated artefacts."
              ],
              "notes": "This condenses long design docs, runbooks, or strategy canvases down to one or two paragraphs or bullet lists per item, centralised in a single recon canvas for later exfiltration or reference."
            },
            {
              "step_id": 4,
              "description": "Use enterprise search plus Slack AI to run cross-workspace queries for each sensitive topic (including connected-app records), asking AI to synthesize search results (messages, files, third-party app content) into per-topic summaries and lists of key entities (systems, environments, vendors, URLs), then paste those into the recon canvas.",
              "related_capabilities": [
                "Enterprise Search Across Slack and Connected Applications – Enterprise search queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, giving a single interface to discover and pull together sensitive information scattered across many channels and tools.",
                "Slack AI End-user Features – AI summarisation and assistance operate over messages and threads across channels and DMs, huddle audio and transcripts, and canvas content, plus enterprise search indexes, allowing broad aggregation of sensitive collaboration data into concise outputs.",
                "AI Indexing, Summarisation, and Search Pipelines – Platform-level indexing of workspace messages, files, canvas content, and connected application data underpins both AI features and enterprise search, effectively expanding the amount of data that can be queried and summarised from a single AI/search entry point.",
                "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows."
              ],
              "related_interfaces": [
                "Search bar and AI search interfaces in Slack clients (Enterprise Search Across Slack and Connected Applications), which allow users to query indexed messages, files, canvases, and connected app data from a single place.",
                "Enterprise search configuration and result UIs (Enterprise Search help articles at https://slack.com/help/articles/38693462131219 and 39044407124755), which control and display what internal and external data sources are queryable and how results are scoped per user.",
                "AI controls in channels, DMs, threads, huddles, and canvases in the Slack client (Slack AI End-user Features UI; https://slack.com/features/ai and AI help article), which let users run summaries and ask questions that span large data sets.",
                "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content."
              ],
              "related_data": [
                "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data.",
                "Files stored in Slack and referenced in search indices (Search Indexes and AI Embeddings and Enterprise Search key data), including documents containing confidential information that can be discovered via enterprise search and then summarised or referenced in consolidated artefacts.",
                "Metadata and content from connected third-party applications indexed for enterprise search (Enterprise Search Across Slack and Connected Applications), such as records from tools like Asana, Notion, Box, or other SaaS apps integrated into Slack.",
                "Search queries and result-click behaviours (Enterprise Search key data), which can reveal what sensitive topics were investigated and help refine subsequent collection activities."
              ],
              "notes": "This mirrors real campaigns where adversaries mine internal collaboration/search to discover databases or BMS systems, but here the attacker relies on Slack’s AI and search to aggregate references to infrastructure, credentials, and partners into a compact, human-readable knowledge base."
            },
            {
              "step_id": 5,
              "description": "For channels and DMs where sensitive huddles occur, use Slack AI’s huddle summarisation or related AI controls to capture key decisions and technical details from huddle transcripts, then store those summaries in the recon canvas under the relevant topic or system.",
              "related_capabilities": [
                "Slack AI End-user Features – AI summarisation and assistance operate over messages and threads across channels and DMs, huddle audio and transcripts, and canvas content, plus enterprise search indexes, allowing broad aggregation of sensitive collaboration data into concise outputs.",
                "Core Collaboration Service – Channels, DMs, threads, and huddles constitute the primary repositories of sensitive discussions and files that Slack AI and workflows can read (subject to access controls) and then aggregate into higher-level artefacts.",
                "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows.",
                "Canvases and Rich Surfaces for Knowledge Capture – Canvases store long-form documents and embedded content with AI-assisted authoring and summarisation, making them a natural place to consolidate and persist aggregated sensitive information drawn from messages, huddles, files, and other canvases."
              ],
              "related_interfaces": [
                "AI controls in channels, DMs, threads, huddles, and canvases in the Slack client (Slack AI End-user Features UI; https://slack.com/features/ai and AI help article), which let users run summaries and ask questions that span large data sets.",
                "General Slack channel/DM/huddle UI (Core Collaboration Service) where AI huddle notes, message summaries, and workflow-triggered posts can appear, effectively acting as aggregation channels for sensitive content.",
                "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content."
              ],
              "related_data": [
                "Huddle audio and transcripts used by AI huddle notes (Slack AI End-user Features), which may contain real-time spoken sensitive information that can be summarised and stored as text.",
                "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data.",
                "Canvas documents, embedded content, and comments (Canvases and Rich Surfaces for Knowledge Capture), which can themselves be sensitive and also serve as containers for AI-generated summaries of other data."
              ],
              "notes": "Huddle-derived notes often contain incident response discussions or high-level architectural decisions, aligning with how real-world actors monitor collaboration tools for IR chatter and design details."
            },
            {
              "step_id": 6,
              "description": "Create a simple \"Add to recon log\" workflow using Workflow Builder that the attacker can trigger via a message shortcut on any newly discovered sensitive message; configure the workflow to capture the message text, link, channel, author, and optional classification fields into a private recon-log channel or DM, with all executions preserved in workflow run history.",
              "related_capabilities": [
                "Workflow Builder and No-code Workflow Automation – User-created workflows can orchestrate multi-step automations that collect user inputs and events/payloads from third-party connectors and route them into central destinations, with run history and logs preserving structured records that may contain sensitive data.",
                "Workflow Execution and Scheduling Engine – The background workflow engine can repeatedly execute user-defined workflows based on events or schedules, enabling ongoing, automated collection and centralisation of information from various sources into Slack channels, canvases, or workflow logs.",
                "Core Collaboration Service – Channels, DMs, threads, and huddles constitute the primary repositories of sensitive discussions and files that Slack AI and workflows can read (subject to access controls) and then aggregate into higher-level artefacts.",
                "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows."
              ],
              "related_interfaces": [
                "Workflow Builder interface in the Slack client (Workflow Builder and No-code Workflow Automation; https://slack.com/features/workflow-automation and related help/docs), where users define triggers and steps that can collect inputs and connector payloads into defined destinations.",
                "Workflow run history and logs surfaces (implied by Workflow Builder key data and Workflow Execution and Scheduling Engine) that present past workflow executions and captured data in a reviewable, centralised format.",
                "General Slack channel/DM/huddle UI (Core Collaboration Service) where AI huddle notes, message summaries, and workflow-triggered posts can appear, effectively acting as aggregation channels for sensitive content."
              ],
              "related_data": [
                "User inputs collected by workflow forms or messages and events/payloads from third-party connectors (Workflow Builder and No-code Workflow Automation key data), which can include sensitive operational or business data that workflows centralise.",
                "Workflow definitions, triggers, and execution logs (Workflow Execution and Scheduling Engine and Workflow Definitions and Execution Logs storage), which may record sensitive parameters, connector payloads, and aggregated results over time.",
                "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data."
              ],
              "notes": "This is a semi-automated collection mechanism typical of Automated Collection: the attacker curates which messages to capture, but the workflow ensures consistent logging of structured context and preserves a machine-readable history for later summarisation or export."
            },
            {
              "step_id": 7,
              "description": "Periodically use Slack AI on the recon-log channel/DM and workflow run history to generate higher-level roll-up summaries (e.g., per system, per credential type, per third-party app) and paste or refine these into the main recon canvas, resulting in a small number of densely informative artefacts that capture the most sensitive findings across all sources.",
              "related_capabilities": [
                "Slack AI End-user Features – AI summarisation and assistance operate over messages and threads across channels and DMs, huddle audio and transcripts, and canvas content, plus enterprise search indexes, allowing broad aggregation of sensitive collaboration data into concise outputs.",
                "Canvases and Rich Surfaces for Knowledge Capture – Canvases store long-form documents and embedded content with AI-assisted authoring and summarisation, making them a natural place to consolidate and persist aggregated sensitive information drawn from messages, huddles, files, and other canvases.",
                "Workflow Execution and Scheduling Engine – The background workflow engine can repeatedly execute user-defined workflows based on events or schedules, enabling ongoing, automated collection and centralisation of information from various sources into Slack channels, canvases, or workflow logs.",
                "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows.",
                "AI Indexing, Summarisation, and Search Pipelines – Platform-level indexing of workspace messages, files, canvas content, and connected application data underpins both AI features and enterprise search, effectively expanding the amount of data that can be queried and summarised from a single AI/search entry point."
              ],
              "related_interfaces": [
                "AI controls in channels, DMs, threads, huddles, and canvases in the Slack client (Slack AI End-user Features UI; https://slack.com/features/ai and AI help article), which let users run summaries and ask questions that span large data sets.",
                "Workflow run history and logs surfaces (implied by Workflow Builder key data and Workflow Execution and Scheduling Engine) that present past workflow executions and captured data in a reviewable, centralised format.",
                "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content."
              ],
              "related_data": [
                "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data.",
                "Workflow definitions, triggers, and execution logs (Workflow Execution and Scheduling Engine and Workflow Definitions and Execution Logs storage), which may record sensitive parameters, connector payloads, and aggregated results over time.",
                "Canvas documents, embedded content, and comments (Canvases and Rich Surfaces for Knowledge Capture), which can themselves be sensitive and also serve as containers for AI-generated summaries of other data."
              ],
              "notes": "By iteratively summarising already-curated logs, the attacker compresses large volumes of Slack and connected-app data into one or a few canvases and channels that are trivial to review and later exfiltrate using standard client functionality."
            }
          ],
          "capabilities_used": [
            "Slack AI End-user Features – AI summarisation and assistance operate over messages and threads across channels and DMs, huddle audio and transcripts, and canvas content, plus enterprise search indexes, allowing broad aggregation of sensitive collaboration data into concise outputs.",
            "Enterprise Search Across Slack and Connected Applications – Enterprise search queries indexed messages, files, canvas content, and metadata/content from connected third-party apps, giving a single interface to discover and pull together sensitive information scattered across many channels and tools.",
            "Canvases and Rich Surfaces for Knowledge Capture – Canvases store long-form documents and embedded content with AI-assisted authoring and summarisation, making them a natural place to consolidate and persist aggregated sensitive information drawn from messages, huddles, files, and other canvases.",
            "Workflow Builder and No-code Workflow Automation – User-created workflows can orchestrate multi-step automations that collect user inputs and events/payloads from third-party connectors and route them into central destinations, with run history and logs preserving structured records that may contain sensitive data.",
            "Workflow Execution and Scheduling Engine – The background workflow engine can repeatedly execute user-defined workflows based on events or schedules, enabling ongoing, automated collection and centralisation of information from various sources into Slack channels, canvases, or workflow logs.",
            "AI Indexing, Summarisation, and Search Pipelines – Platform-level indexing of workspace messages, files, canvas content, and connected application data underpins both AI features and enterprise search, effectively expanding the amount of data that can be queried and summarised from a single AI/search entry point.",
            "Core Collaboration Service – Channels, DMs, threads, and huddles constitute the primary repositories of sensitive discussions and files that Slack AI and workflows can read (subject to access controls) and then aggregate into higher-level artefacts.",
            "Message and File Storage / Search Indexes and AI Embeddings – Persistent storage of messages, threads, files, canvas content, and their derived search/AI representations means consolidated artefacts can capture information spanning long time ranges and multiple systems once surfaced by AI, search, or workflows."
          ],
          "interfaces_used": [
            "AI controls in channels, DMs, threads, huddles, and canvases in the Slack client (Slack AI End-user Features UI; https://slack.com/features/ai and AI help article), which let users run summaries and ask questions that span large data sets.",
            "Search bar and AI search interfaces in Slack clients (Enterprise Search Across Slack and Connected Applications), which allow users to query indexed messages, files, canvases, and connected app data from a single place.",
            "Canvas editing surface and associated AI actions (Canvases and Rich Surfaces for Knowledge Capture; e.g., 'Use AI to write or edit content in a canvas' help article), which support generating and storing AI-produced summaries or compilations of sensitive content.",
            "Workflow Builder interface in the Slack client (Workflow Builder and No-code Workflow Automation; https://slack.com/features/workflow-automation and related help/docs), where users define triggers and steps that can collect inputs and connector payloads into defined destinations.",
            "Workflow run history and logs surfaces (implied by Workflow Builder key data and Workflow Execution and Scheduling Engine) that present past workflow executions and captured data in a reviewable, centralised format.",
            "Enterprise search configuration and result UIs (Enterprise Search help articles at https://slack.com/help/articles/38693462131219 and 39044407124755), which control and display what internal and external data sources are queryable and how results are scoped per user.",
            "General Slack channel/DM/huddle UI (Core Collaboration Service) where AI huddle notes, message summaries, and workflow-triggered posts can appear, effectively acting as aggregation channels for sensitive content."
          ],
          "data_accessed": [
            "Messages and threads across channels and direct messages, including any sensitive discussions, as listed under Core Collaboration Service and Slack AI End-user Features key data.",
            "Huddle audio and transcripts used by AI huddle notes (Slack AI End-user Features), which may contain real-time spoken sensitive information that can be summarised and stored as text.",
            "Canvas documents, embedded content, and comments (Canvases and Rich Surfaces for Knowledge Capture), which can themselves be sensitive and also serve as containers for AI-generated summaries of other data.",
            "Files stored in Slack and referenced in search indices (Search Indexes and AI Embeddings and Enterprise Search key data), including documents containing confidential information that can be discovered via enterprise search and then summarised or referenced in consolidated artefacts.",
            "Metadata and content from connected third-party applications indexed for enterprise search (Enterprise Search Across Slack and Connected Applications), such as records from tools like Asana, Notion, Box, or other SaaS apps integrated into Slack.",
            "User inputs collected by workflow forms or messages and events/payloads from third-party connectors (Workflow Builder and No-code Workflow Automation key data), which can include sensitive operational or business data that workflows centralise.",
            "Workflow definitions, triggers, and execution logs (Workflow Execution and Scheduling Engine and Workflow Definitions and Execution Logs storage), which may record sensitive parameters, connector payloads, and aggregated results over time.",
            "Search queries and result-click behaviours (Enterprise Search key data), which can reveal what sensitive topics were investigated and help refine subsequent collection activities."
          ],
          "preconditions_required": [
            "Slack AI and enterprise search must remain enabled for the compromised user account, with indexing configured for the relevant Slack content (messages, files, canvases, huddles) and any connected third-party applications.",
            "The compromised user must retain membership in the previously identified high-value channels, DMs, canvases, and have permission to open the associated files and connected-app records.",
            "Canvas creation and private sharing rights must be available to the user so that they can create and maintain recon canvases without drawing unnecessary attention.",
            "Workflow Builder must be enabled for standard users in the workspace and allow creation of workflows triggered by message actions/shortcuts that can post into channels or DMs controlled by the attacker.",
            "AI features (including huddle summarisation and canvas assistance) must not be globally disabled on the specific channels or content types the attacker is targeting."
          ],
          "constraints_encountered": [
            "Slack AI and enterprise search can only access data the compromised user is permitted to view; private channels or documents outside their access scope will not be reflected in summaries or search results.",
            "Admins may have configured AI or search restrictions per channel, workspace, or data source (including some connected apps), limiting what content is available for aggregation even when the user can see part of it in the UI.",
            "AI summarisation may abstract away or omit specific sensitive strings (such as full passwords or API keys), potentially forcing the attacker to drill back into underlying messages when they need exact values rather than derived knowledge.",
            "Workflow Builder capabilities and available triggers/steps may be constrained by admin policy; some event types, destinations, or external connectors might be unavailable, limiting how automated the collection can be.",
            "Workflow run history and the creation of new workflows, canvases, and private channels can be visible to admins or logged for audit, providing potential forensic evidence of abnormal consolidation activity.",
            "AI and search features may be rate-limited or monitored; issuing very broad or repetitive sensitive-topic queries in a short period could trigger alerts or throttling.",
            "Using message shortcuts to trigger workflows generates visible actions in-channel (e.g., ephemeral messages, reactions, or audit log entries), which could be noticed by attentive users or defenders."
          ],
          "evasion_considerations": [
            "Give canvases, workflows, and channels innocuous, business-relevant names (e.g., \"Q3 planning notes\", \"Team triage helper\") to avoid drawing attention during casual review or in admin dashboards.",
            "Prefer topic- and project-oriented prompts rather than obviously malicious keywords (e.g., frame AI queries as \"summarize discussion about VPN onboarding\" rather than \"find passwords\"), while still extracting useful operational details.",
            "Use Slack AI to aggressively summarise and de-duplicate content so that the final artefacts are compact; this both reduces exfiltration volume and makes the attacker’s activity look like normal knowledge management rather than bulk scraping.",
            "Trigger the \"Add to recon log\" workflow selectively on the most useful messages instead of every post in a channel, keeping workflow activity low-volume and similar to legitimate lightweight automations.",
            "Perform summarisation and workflow usage during normal working hours, with human-like pacing, so that access patterns blend with typical user behaviour rather than spiking AI/search activity outside usual times.",
            "Store consolidated summaries primarily in private canvases and DMs where access is limited, reducing the chance that other users will stumble upon or question the assembled intelligence."
          ],
          "comments_for_orchestrator": "This method fully achieves the Collection tactic for this scenario using only end-user Slack AI, enterprise search, canvases, and Workflow Builder. It produces a small set of high-value artefacts (one or more recon canvases plus an optional recon-log channel/DM and workflow run logs) that are ideal inputs for later Exfiltration (e.g., T1567 over web services or manual download) or for follow-on tactical planning (e.g., targeting specific systems or accounts identified in the summaries). No custom apps or elevated admin roles are required; all actions are consistent with normal power-user behaviour in Slack."
        }
      ],
      "attack_chain_summary_steps": [
        "1. Sign in as a compromised standard user with Slack AI and enterprise search enabled, and use the Slack client’s AI/search UI to discover which internal and connected-app repositories are indexed.",
        "2. Run broad and then refined AI/search queries to identify specific high-value channels, canvases, files, and external spaces containing sensitive topics (architecture, credentials, incidents, customer data).",
        "3. Create private canvases and a recon-log channel/DM, then use Slack AI, enterprise search, and a lightweight Workflow Builder flow to summarise and centralise the most sensitive findings into a small set of attacker-owned artefacts for later review or exfiltration."
      ]
    }
  ],
  "summary": "The Slack Collaboration Platform presents high-value attack paths both through its app platform and through its native AI and search features.\n\nIn the first path, a malicious or compromised Slack app uses trusted marketplace distribution and OAuth consent phishing to gain Initial Access. Once installed, the app legitimately calls Slack Web API and Events API to discover users, permission groups (channels/DMs), and file surfaces, then automatically harvests message histories and file contents from prioritized channels. Finally, it exfiltrates data by posting archives into an attacker-controlled Slack workspace and/or uploading them to attacker cloud storage, potentially chaining marketplace storage integrations and workflows for persistence and scale.\n\nIn the second path, a compromised but non-admin user exploits Slack AI and enterprise search as a reconnaissance and collection tool. With only end-user capabilities, the attacker can map internal and third-party repositories indexed by enterprise search, identify sensitive channels and documents, and then use AI summaries, canvases, and simple workflows to consolidate knowledge into compact recon artefacts. These canvases and logs are easy to exfiltrate or reuse in later campaigns.\n\nDefensively, Slack admins should strictly govern app installation and scopes, monitor Web API and Events API usage from apps, tightly control Workflow Builder and custom steps, and carefully scope enterprise search sources and Slack AI entitlements. Regular review of installed apps, workflows, AI usage, and search configuration—combined with anomaly detection on high-volume enumeration, collection, or exfiltration patterns—significantly reduces the risk of these attack paths succeeding undetected."
}