{
  "application_name": "Klaviyo B2C CRM (Marketing, Data Platform, and Service)",
  "initial_access_vectors": [
    {
      "can_achieve": true,
      "technique_name": "Cloud Accounts (compromised SSO-backed Klaviyo user)",
      "technique_stix_id": "T1078.004",
      "method_steps": [
        {
          "step_id": 1,
          "description": "Using previously stolen SSO credentials and second-factor material (or a hijacked SSO session) for a user that already belongs to the target Klaviyo workspace, the adversary opens a browser and navigates to the Klaviyo web app login entry point.",
          "related_capabilities": [
            "Klaviyo Data Platform (Core CDP"
          ],
          "related_interfaces": [
            "Klaviyo web app – Profiles, Lists & Segments, Analytics/Reporting, CDP/Data Platform configuration and monitors."
          ],
          "related_data": [
            "Compromised corporate identity for a user mapped to a Klaviyo workspace (email and SSO identity)."
          ],
          "notes": "Credential and MFA theft occurs outside Klaviyo (for example via IdP phishing or endpoint compromise) and is treated as a precondition, not something Klaviyo enables directly."
        },
        {
          "step_id": 2,
          "description": "From the Klaviyo login page, the adversary selects the organization’s SSO option and is redirected to the corporate IdP. They submit the stolen username plus second factor (or replay a hijacked SSO session), satisfying the MFA and SSO-only requirements.",
          "related_capabilities": [],
          "related_interfaces": [
            "SSO/IdP login page invoked from the Klaviyo web app (per environment constraint “SSO-Only Authentication”)."
          ],
          "related_data": [
            "SSO authentication assertions or tokens generated by the IdP (SAML/OIDC) for the compromised user."
          ],
          "notes": "This step is governed by the IdP and environment constraints (MFA Required, SSO-Only Authentication, IP Allowlisting), not by Klaviyo-specific logic."
        },
        {
          "step_id": 3,
          "description": "Klaviyo accepts the IdP assertion, maps it to the existing workspace user, and creates an authenticated web session. The adversary is redirected into the tenant’s UI with whatever role and entitlements that user has (e.g., ability to view profiles, campaigns, flows, and API keys).",
          "related_capabilities": [
            "Klaviyo Data Platform (Core CDP)",
            "Email Marketing",
            "SMS Marketing",
            "Automated Flows (Marketing Automation)",
            "Developer & API Key Management",
            "Klaviyo Helpdesk (Service)",
            "Customer Hub (Customer Experience Hub)"
          ],
          "related_interfaces": [
            "Klaviyo web app – Profiles, Lists & Segments, Analytics/Reporting, CDP/Data Platform configuration and monitors.",
            "Email product area in the Klaviyo app: campaign builder, flow editor, template editor, deliverability tools, benchmarks.",
            "Flows builder UI with drag-and-drop steps, triggers, conditional/trigger splits, A/B tests, and performance reporting.",
            "Helpdesk workspace UI: unified inbox, ticket views, tags, macros, AI assistance, analytics.",
            "Customer Hub configuration and analytics UI in the Klaviyo app.",
            "Account settings page for generating private API keys with scopes and retrieving public (site) IDs."
          ],
          "related_data": [
            "Tenant’s customer profiles and events (as visible to this user’s role).",
            "Campaign, flow, form, and segmentation configurations.",
            "Existing private API key metadata and the ability to generate new keys (if the role permits)."
          ],
          "notes": "Exact RBAC behavior is not documented in the provided materials, so the scope of access depends on the compromised user’s role."
        }
      ],
      "capabilities_used": [
        "Klaviyo Data Platform (Core CDP)",
        "Email Marketing",
        "SMS Marketing",
        "Automated Flows (Marketing Automation)",
        "Klaviyo Helpdesk (Service)",
        "Customer Hub (Customer Experience Hub)",
        "Developer & API Key Management"
      ],
      "interfaces_used": [
        "Klaviyo web app – Profiles, Lists & Segments, Analytics/Reporting, CDP/Data Platform configuration and monitors.",
        "Email product area in the Klaviyo app: campaign builder, flow editor, template editor, deliverability tools, benchmarks.",
        "Flows builder UI with drag-and-drop steps, triggers, conditional/trigger splits, A/B tests, and performance reporting.",
        "Helpdesk workspace UI: unified inbox, ticket views, tags, macros, AI assistance, analytics.",
        "Customer Hub configuration and analytics UI in the Klaviyo app.",
        "SSO/IdP login page invoked from the Klaviyo web app."
      ],
      "data_accessed": [
        "All CDP profile and event data accessible to the compromised user (identifiers, consent, behavior, predictive scores).",
        "Configuration for campaigns, flows, forms, segments, and reporting.",
        "Developer & API Key Management settings, including the ability to create new private API keys and view public site IDs."
      ],
      "preconditions_required": [
        "The target organization uses SSO-only authentication for Klaviyo (as per environment constraint) and has at least one user already provisioned into the workspace.",
        "The adversary has already compromised that user’s SSO identity, including the ability to satisfy MFA (e.g., via sophisticated phishing or device compromise).",
        "The adversary can originate login traffic from an IP address permitted by any IP allowlisting policy in front of Klaviyo’s login endpoints."
      ],
      "constraints_encountered": [
        "MFA Required",
        "SSO-Only Authentication",
        "Domain-Based Registration",
        "IP Allowlisting",
        "Rate Limiting",
        "CAPTCHA Protection"
      ],
      "evasion_considerations": [
        "Use a single successful login rather than repeated attempts to avoid rate-limit and anomaly triggers.",
        "Log in from IP ranges and geolocations consistent with the victim’s usual access patterns to avoid standing out.",
        "Limit initial activity (e.g., slow enumeration of configuration screens) to blend in with normal user behavior until further objectives are planned."
      ],
      "resulting_access": "Interactive, fully authenticated web session into the victim’s Klaviyo tenant under the compromised user’s role, enabling in-UI access to profiles, campaigns, flows, forms, Helpdesk, Customer Hub configuration, and Developer & API Key Management.",
      "comments": "This is the canonical cloud-account initial access path for Klaviyo: compromise of an SSO-backed workspace user. Environment controls (SSO-only, MFA, possible IP allowlisting) increase difficulty but do not eliminate the risk if the IdP identity is already compromised."
    },
    {
      "can_achieve": true,
      "technique_name": "Valid Accounts (stolen private API key)",
      "technique_stix_id": "T1078",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary acquires a valid private Klaviyo API key for the target tenant (for example, from source code, CI logs, or a compromised integration server) that has scopes over profiles/events or broader admin functions.",
          "related_capabilities": [
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "Account settings page for generating private API keys with scopes and retrieving public (site) IDs.",
            "Klaviyo API Overview – authentication section describing Authorization: Klaviyo-API-Key header usage."
          ],
          "related_data": [
            "Private API key value and its configured scopes."
          ],
          "notes": "Key theft occurs outside of Klaviyo (e.g., developer mistake or external compromise) and is treated as a precondition."
        },
        {
          "step_id": 2,
          "description": "Using the API Overview documentation, the adversary constructs a test request to a low-risk endpoint (for example, listing a small number of profiles or metrics) and includes the stolen key in the Authorization: Klaviyo-API-Key header.",
          "related_capabilities": [
            "Developer & API Key Management",
            "Profiles & Consent APIs",
            "Events & Metrics APIs (including Bulk Events)"
          ],
          "related_interfaces": [
            "Klaviyo API Overview – https://developers.klaviyo.com/en/reference/api_overview",
            "/api/profiles endpoint for profile retrieval (Profiles & Consent APIs).",
            "/api/events or metrics endpoints (Events & Metrics APIs)."
          ],
          "related_data": [
            "Sample of profile or metric data returned by the API, confirming that the key is valid and bound to the target tenant."
          ],
          "notes": "The adversary keeps request volume low initially to avoid triggering rate limits or monitoring."
        },
        {
          "step_id": 3,
          "description": "After validating the key, the adversary expands to more sensitive or higher-leverage endpoints allowed by the key’s scopes, such as enumerating profiles, campaigns, flows, or webhooks, while continuing to authenticate only with the stolen key.",
          "related_capabilities": [
            "Profiles & Consent APIs",
            "Campaigns, Templates, and Universal Content APIs",
            "Flows & Flow Actions APIs",
            "Webhooks API",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "/api/profiles and bulk profiles endpoints (Profiles & Consent APIs).",
            "Campaigns API – https://developers.klaviyo.com/en/reference/campaigns_api_overview",
            "/api/flows and flow actions endpoints (Flows & Flow Actions APIs).",
            "Webhooks management endpoints (Webhooks API)."
          ],
          "related_data": [
            "Customer profiles, lists/segments, consent state, and associated events.",
            "Campaign and flow definitions and metadata.",
            "Webhook configurations (target URLs and subscribed topics)."
          ],
          "notes": "The exact breadth of access depends on how broadly the stolen key was scoped at creation (older keys may be highly privileged)."
        }
      ],
      "capabilities_used": [
        "Developer & API Key Management",
        "Profiles & Consent APIs",
        "Events & Metrics APIs (including Bulk Events)",
        "Campaigns, Templates, and Universal Content APIs",
        "Flows & Flow Actions APIs",
        "Webhooks API",
        "Klaviyo Data Platform (Core CDP)"
      ],
      "interfaces_used": [
        "Account settings page for generating private API keys with scopes and retrieving public (site) IDs.",
        "Klaviyo API Overview – https://developers.klaviyo.com/en/reference/api_overview",
        "/api/profiles and related JSON:API endpoints (Profiles & Consent APIs).",
        "/api/events and metrics endpoints (Events & Metrics APIs).",
        "Campaigns API – https://developers.klaviyo.com/en/reference/campaigns_api_overview",
        "/api/flows and flow actions endpoints (Flows & Flow Actions APIs).",
        "Webhooks management endpoints – https://developers.klaviyo.com/en/reference/webhooks_api_overview"
      ],
      "data_accessed": [
        "Whatever resources the stolen key is scoped for, potentially including profile PII, consent/suppression state, behavioral events, campaigns, flows, forms, webhooks, and analytics.",
        "Operational metadata such as bulk job statuses and webhook delivery statuses if those endpoints are permitted."
      ],
      "preconditions_required": [
        "A private API key for the target tenant has been exposed or stolen from outside Klaviyo (e.g., in code, logs, or a compromised integration).",
        "The key has not been revoked and still has meaningful scopes (read/write over desired resources).",
        "If the tenant uses IP Allowlisting for API access, the adversary can send traffic from an allowed IP range (for example by compromising an integration server that legitimately uses the key)."
      ],
      "constraints_encountered": [
        "IP Allowlisting",
        "Rate Limiting"
      ],
      "evasion_considerations": [
        "Replay the key from infrastructure that looks like an existing integration (same IP ranges, similar user agents) to avoid triggering IP-allowlist or anomaly-based alerts.",
        "Throttle API calls and respect rate-limit headers to avoid HTTP 429 responses and potential operational alarms.",
        "Limit early queries to metadata and small samples of data to avoid sudden volume spikes in API usage."
      ],
      "resulting_access": "Programmatic access to the target tenant’s JSON:API surface, authenticated solely by a stolen private API key. Depending on key scopes, this can include full read/write access to profiles, events, campaigns, flows, forms, reviews, webhooks, and possibly admin/warehouse configuration.",
      "comments": "This is a high-leverage but purely credential-based initial access path. It completely bypasses SSO and MFA for the UI and instead abuses API-key–level trust at the Developer & API Key Management layer."
    },
    {
      "can_achieve": true,
      "technique_name": "Trusted Relationship (compromised tech partner / OAuth integration)",
      "technique_stix_id": "T1199",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary compromises or directly operates a third-party SaaS or integration partner that is legitimately connected to multiple Klaviyo tenants via OAuth-based integrations.",
          "related_capabilities": [
            "Developer & API Key Management",
            "Klaviyo Data Platform (Core CDP)",
            "Data Governance & Advanced KDP (Transformations, Warehouse Sync, Hosted Code)"
          ],
          "related_interfaces": [
            "Developer & API Key Management UI where OAuth integrations for tech partners are registered and managed.",
            "Klaviyo API Overview – OAuth authentication patterns."
          ],
          "related_data": [
            "Stored OAuth client IDs, client secrets, and long-lived refresh/access tokens for target Klaviyo tenants."
          ],
          "notes": "This step mirrors real-world campaigns in which MSPs or SaaS vendors are breached and their delegated access into customer environments is abused."
        },
        {
          "step_id": 2,
          "description": "From within the compromised partner environment, the adversary locates the OAuth tokens associated with the specific target merchant’s Klaviyo workspace and identifies which scopes they have (for example, profiles:read, events:write, flows:read, webhooks:read_write).",
          "related_capabilities": [
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "Partner’s token storage and configuration (outside Klaviyo)."
          ],
          "related_data": [
            "Klaviyo OAuth access and refresh tokens for the target tenant.",
            "Scope lists indicating what the integration is allowed to do."
          ],
          "notes": "These tokens are equivalent to highly scoped API keys from Klaviyo’s perspective."
        },
        {
          "step_id": 3,
          "description": "Using the valid OAuth access token (refreshing it if necessary), the adversary issues API requests to Klaviyo’s JSON:API endpoints in the context of the victim tenant, impersonating the trusted integration.",
          "related_capabilities": [
            "Profiles & Consent APIs",
            "Events & Metrics APIs (including Bulk Events)",
            "Campaigns, Templates, and Universal Content APIs",
            "Flows & Flow Actions APIs",
            "Forms & Form Reporting APIs",
            "Reviews APIs (Server & Client)",
            "Webhooks API",
            "Custom Objects & Data Sources APIs",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "Profiles & Consent APIs under /api/profiles.",
            "Events & Metrics APIs under /api/events.",
            "Campaigns API – https://developers.klaviyo.com/en/reference/campaigns_api_overview",
            "Flows & Flow Actions APIs under /api/flows.",
            "Forms & Form Reporting APIs.",
            "Reviews server APIs.",
            "Webhooks management endpoints – https://developers.klaviyo.com/en/reference/webhooks_api_overview",
            "Custom Objects & Data Sources APIs – https://developers.klaviyo.com/en/reference/custom_objects_api_overview"
          ],
          "related_data": [
            "Customer profiles and consent state.",
            "Behavioral events and metrics.",
            "Campaign, flow, form, and review configurations and content.",
            "Webhook definitions and subscribed topics.",
            "Custom object records and schemas."
          ],
          "notes": "All activity appears to originate from a legitimate, previously authorized integration, making it harder to distinguish from normal partner traffic."
        }
      ],
      "capabilities_used": [
        "Developer & API Key Management",
        "Profiles & Consent APIs",
        "Events & Metrics APIs (including Bulk Events)",
        "Campaigns, Templates, and Universal Content APIs",
        "Flows & Flow Actions APIs",
        "Forms & Form Reporting APIs",
        "Reviews APIs (Server & Client)",
        "Custom Objects & Data Sources APIs",
        "Webhooks API",
        "Klaviyo Data Platform (Core CDP)",
        "Data Governance & Advanced KDP (Transformations, Warehouse Sync, Hosted Code)"
      ],
      "interfaces_used": [
        "Developer & API Key Management UI for registering OAuth integrations and managing their scopes.",
        "Klaviyo API Overview – https://developers.klaviyo.com/en/reference/api_overview",
        "/api/profiles, /api/events, /api/flows and related JSON:API endpoints.",
        "Campaigns API – https://developers.klaviyo.com/en/reference/campaigns_api_overview",
        "Webhooks management endpoints – https://developers.klaviyo.com/en/reference/webhooks_api_overview",
        "Custom Objects API – https://developers.klaviyo.com/en/reference/custom_objects_api_overview"
      ],
      "data_accessed": [
        "All data and configuration reachable via the partner integration’s OAuth scopes: profiles, events, campaigns, flows, forms, webhooks, reviews, and custom objects.",
        "Potentially, data warehouse sync configuration if the integration has access to Data Governance & Advanced KDP features."
      ],
      "preconditions_required": [
        "The victim tenant has authorized at least one tech partner or third-party application via Klaviyo’s OAuth-based integration model.",
        "The adversary has compromised that partner’s environment or directly operates a malicious partner app that stores valid Klaviyo OAuth tokens.",
        "Any IP allowlisting or network restrictions in the tenant permit the partner’s infrastructure to reach Klaviyo’s APIs."
      ],
      "constraints_encountered": [
        "IP Allowlisting",
        "Rate Limiting"
      ],
      "evasion_considerations": [
        "Reuse the same IP ranges, TLS configurations, and API usage patterns as the legitimate integration to blend in with expected traffic.",
        "Operate within the integration’s documented scope (for example, primarily reading data or making small incremental changes) to avoid behavior that would look anomalous for that app.",
        "Stagger API activity across multiple tenants to avoid drawing attention to any one victim."
      ],
      "resulting_access": "Programmatic, trusted third-party access into the victim’s Klaviyo tenant via OAuth tokens that appear to belong to a legitimate integration, with privileges defined by the integration’s scopes (often substantial read/write access over profiles, events, and core marketing/service configuration).",
      "comments": "This vector mirrors real-world supply-chain compromises in other SaaS ecosystems (e.g., compromised MSPs or Office 365 delegated admins) and is particularly dangerous because activity appears to come from an expressly trusted integration."
    },
    {
      "can_achieve": true,
      "technique_name": "Spearphishing Link (consent phishing for a malicious Klaviyo OAuth app)",
      "technique_stix_id": "T1566.002",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary registers or controls a Klaviyo tech-partner style OAuth application and configures it with aggressive scopes (for example, broad profile and event access, flows, campaigns, forms, and webhooks).",
          "related_capabilities": [
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "Developer & API Key Management UI for registering OAuth-based integrations and configuring scopes.",
            "Klaviyo API Overview – OAuth authentication and authorization flows."
          ],
          "related_data": [
            "OAuth client ID, client secret, redirect URIs, and requested scopes for the attacker-controlled application."
          ],
          "notes": "This step assumes the attacker can participate in Klaviyo’s partner program or otherwise obtain client credentials for an OAuth app."
        },
        {
          "step_id": 2,
          "description": "The adversary crafts an OAuth 2.0 authorization URL for their app that targets the victim tenant and embeds it in a convincing spearphishing message (for example, an email inviting the recipient to \"connect a new analytics integration\" or \"enable advanced reporting\").",
          "related_capabilities": [
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "Klaviyo OAuth 2.0 authorization endpoint (as documented in the API Overview)."
          ],
          "related_data": [
            "Constructed OAuth authorization request parameters (client_id, redirect_uri, scope, state, etc.)."
          ],
          "notes": "This follows the consent-phishing patterns documented for other SaaS platforms, but targets Klaviyo’s OAuth flows."
        },
        {
          "step_id": 3,
          "description": "A Klaviyo admin or technical user in the target organization clicks the link. They are taken to the legitimate Klaviyo OAuth/SSO flow, where they authenticate via the organization’s IdP (satisfying SSO-only and MFA requirements) and then see a consent screen for the attacker’s application.",
          "related_capabilities": [
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "SSO/IdP login page invoked from the Klaviyo OAuth flow.",
            "Klaviyo OAuth consent screen for third-party integrations."
          ],
          "related_data": [
            "SSO authentication assertions for the admin user.",
            "Presented list of scopes the malicious app is requesting."
          ],
          "notes": "Because the consent page is hosted by Klaviyo and the SSO prompts are genuine, users may trust the flow even if the app itself is malicious."
        },
        {
          "step_id": 4,
          "description": "The victim clicks “Allow” on the consent screen. Klaviyo issues an authorization code to the attacker-controlled redirect URI, which the adversary exchanges for OAuth access and refresh tokens bound to the victim tenant and the high-privilege scopes requested.",
          "related_capabilities": [
            "Developer & API Key Management",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "Klaviyo OAuth token endpoint (per the OAuth implementation)."
          ],
          "related_data": [
            "OAuth authorization code and resulting access and refresh tokens for the victim tenant."
          ],
          "notes": "From Klaviyo’s perspective, the tenant has explicitly authorized this integration; no UI login by the adversary is required."
        },
        {
          "step_id": 5,
          "description": "Using the obtained OAuth tokens, the adversary calls JSON:API endpoints to read and modify data and configuration within the victim tenant, acting as a first-time but fully authorized third-party app.",
          "related_capabilities": [
            "Profiles & Consent APIs",
            "Events & Metrics APIs (including Bulk Events)",
            "Campaigns, Templates, and Universal Content APIs",
            "Flows & Flow Actions APIs",
            "Forms & Form Reporting APIs",
            "Reviews APIs (Server & Client)",
            "Webhooks API",
            "Custom Objects & Data Sources APIs",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "/api/profiles, /api/events, /api/flows and other JSON:API endpoints.",
            "Campaigns API – https://developers.klaviyo.com/en/reference/campaigns_api_overview",
            "Webhooks management endpoints – https://developers.klaviyo.com/en/reference/webhooks_api_overview"
          ],
          "related_data": [
            "Tenant profiles, consent state, behavioral events, and predictive analytics.",
            "Marketing and service configuration such as campaigns, flows, forms, and webhooks."
          ],
          "notes": "This is effectively the same level of access as in the trusted-relationship vector, but established via direct consent phishing rather than compromise of an existing partner."
        }
      ],
      "capabilities_used": [
        "Developer & API Key Management",
        "Profiles & Consent APIs",
        "Events & Metrics APIs (including Bulk Events)",
        "Campaigns, Templates, and Universal Content APIs",
        "Flows & Flow Actions APIs",
        "Forms & Form Reporting APIs",
        "Reviews APIs (Server & Client)",
        "Webhooks API",
        "Custom Objects & Data Sources APIs",
        "Klaviyo Data Platform (Core CDP)"
      ],
      "interfaces_used": [
        "Developer & API Key Management UI for registering OAuth-based integrations and configuring scopes.",
        "Klaviyo OAuth 2.0 authorization endpoint and consent screen.",
        "SSO/IdP login page invoked during the OAuth flow.",
        "Klaviyo OAuth token endpoint.",
        "/api/profiles, /api/events, /api/flows and related JSON:API endpoints."
      ],
      "data_accessed": [
        "OAuth access and refresh tokens that grant API-level access into the victim tenant.",
        "All data and configuration covered by the granted scopes: profiles, events, campaigns, flows, forms, reviews, webhooks, and custom objects."
      ],
      "preconditions_required": [
        "The attacker can register or otherwise obtain client credentials for an OAuth app in Klaviyo’s partner model.",
        "Target organizations rely on SSO/MFA for admin access, but users are willing to authorize new integrations via consent screens.",
        "The attacker can deliver credible spearphishing emails (or other messages) with the malicious OAuth consent link to Klaviyo admins.",
        "Any IP or API-level allowlisting on the tenant permits the attacker’s integration infrastructure, or the tenant does not enforce IP restrictions for integrations."
      ],
      "constraints_encountered": [
        "MFA Required",
        "SSO-Only Authentication",
        "Rate Limiting"
      ],
      "evasion_considerations": [
        "Use branding, documentation links, and website content that mimic legitimate Klaviyo partners to increase the chance that admins approve the OAuth consent.",
        "Request scopes that are broad but still plausible for the purported function of the integration to reduce suspicion.",
        "Limit initial API calls to read-only operations and low volume to avoid attracting attention immediately after authorization."
      ],
      "resulting_access": "API-level access into the victim Klaviyo tenant via a newly authorized but malicious OAuth application, with scopes equivalent to a legitimate integration and no need for the adversary to directly log into the UI.",
      "comments": "This is a textbook consent-phishing scenario adapted to Klaviyo’s OAuth model: a spearphishing link drives an admin through a real Klaviyo SSO and consent flow, granting the attacker an application access token with broad permissions."
    },
    {
      "can_achieve": true,
      "technique_name": "Exploit Public-Facing Application (abuse public /client event and subscription ingestion)",
      "technique_stix_id": "T1190",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary browses a merchant’s ecommerce site or app that is known to use Klaviyo and inspects the page source and network traffic to identify Klaviyo’s on-site JavaScript snippet and /client API calls, extracting the public site ID or company ID associated with the merchant’s Klaviyo account.",
          "related_capabilities": [
            "Web Forms & Lead Capture",
            "Klaviyo Data Platform (Core CDP)",
            "Events & Metrics APIs (including Bulk Events)",
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "On-site JavaScript integrations for Web Forms as documented in https://help.klaviyo.com/hc/en-us/articles/360026474752.",
            "/client/events endpoint (Events & Metrics APIs).",
            "Client Subscription API used by embedded forms and on-site JS."
          ],
          "related_data": [
            "Public site ID / company ID embedded in the merchant’s pages.",
            "Observed sample /client requests and payload structures."
          ],
          "notes": "Public site IDs are intentionally exposed to browsers so that forms and tracking can send data into Klaviyo."
        },
        {
          "step_id": 2,
          "description": "Using the captured site ID and the Events API reference, the adversary crafts their own /client/events requests from an external script or tooling, mimicking legitimate browser traffic but with attacker-chosen event names and properties.",
          "related_capabilities": [
            "Events & Metrics APIs (including Bulk Events)",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "Events API overview – https://developers.klaviyo.com/en/reference/events_api_overview (client events section).",
            "/client/events endpoint for event ingestion."
          ],
          "related_data": [
            "Synthetic event payloads (e.g., fake page views, purchases, or custom events) tied to attacker-selected identifiers (emails, phone numbers, external_ids, anonymous_ids)."
          ],
          "notes": "Because authentication for /client endpoints is based on the public site ID, no secret is required beyond what is already exposed on the storefront."
        },
        {
          "step_id": 3,
          "description": "The adversary extends this to subscription and consent, sending requests that simulate form submissions or Client Subscription API calls to create or update profiles and opt them into lists or channels, again using the exposed site ID and the observed client-side request patterns.",
          "related_capabilities": [
            "Web Forms & Lead Capture",
            "Consent, Compliance, and Subscription Management",
            "Profiles & Consent APIs",
            "Events & Metrics APIs (including Bulk Events)"
          ],
          "related_interfaces": [
            "Client Subscription API invoked from on-site forms (as described in consent management and changelog docs).",
            "Embedded web forms that post through on-site JS into Klaviyo."
          ],
          "related_data": [
            "New or modified profiles with attacker-chosen emails, phone numbers, and consent flags.",
            "List and segment relationships created by simulated subscriptions."
          ],
          "notes": "Double opt-in and age-gating logic may limit how quickly some subscriptions become fully active, but profile records and events are still created in the CDP."
        },
        {
          "step_id": 4,
          "description": "By scaling these crafted /client requests (subject to rate limiting), the adversary can pollute the merchant’s Klaviyo tenant with arbitrary events and signups, influencing segments and automations that rely on web, purchase, or subscription signals.",
          "related_capabilities": [
            "Customer Segmentation & Audience Management",
            "Automated Flows (Marketing Automation)",
            "Multi-channel Flows Execution Engine"
          ],
          "related_interfaces": [
            "Segments builder in the Klaviyo app, which now reflects attacker-injected behavior.",
            "Flows builder UI and execution engine that may trigger based on the injected events or subscriptions."
          ],
          "related_data": [
            "Segment membership changes driven by fake events.",
            "Flow enrollments triggered by attacker-crafted activity."
          ],
          "notes": "This affects downstream behavior (segments, flows, reporting) even though the adversary never authenticates to the UI or /api endpoints."
        }
      ],
      "capabilities_used": [
        "Web Forms & Lead Capture",
        "Events & Metrics APIs (including Bulk Events)",
        "Consent, Compliance, and Subscription Management",
        "Profiles & Consent APIs",
        "Customer Segmentation & Audience Management",
        "Automated Flows (Marketing Automation)",
        "Multi-channel Flows Execution Engine",
        "Klaviyo Data Platform (Core CDP)",
        "Developer & API Key Management"
      ],
      "interfaces_used": [
        "On-site JavaScript integrations for Web Forms – https://help.klaviyo.com/hc/en-us/articles/360026474752",
        "Web Forms feature UI – https://www.klaviyo.com/features/web-forms/",
        "/client/events endpoint (client Events API).",
        "Client Subscription API invoked from on-site JavaScript.",
        "Events API overview – https://developers.klaviyo.com/en/reference/events_api_overview",
        "Segments builder UI – https://www.klaviyo.com/features/segmentation/",
        "Flows builder UI – https://www.klaviyo.com/features/flows/"
      ],
      "data_accessed": [
        "Ability to create and update profile records (emails, phone numbers, identifiers, custom properties) via client-side ingestion.",
        "Ability to insert arbitrary events into the tenant’s Event and Metrics Store.",
        "Indirect influence over segment definitions and flow triggers that rely on those events and subscriptions."
      ],
      "preconditions_required": [
        "The merchant has embedded Klaviyo’s on-site JavaScript and/or forms that use /client endpoints, exposing a public site ID.",
        "The adversary can access the merchant’s storefront or app to observe and replicate client-side Klaviyo traffic.",
        "No additional IP-level restrictions are enforced on /client endpoints (they must be reachable from arbitrary visitors to support on-site tracking)."
      ],
      "constraints_encountered": [
        "Rate Limiting",
        "CAPTCHA Protection"
      ],
      "evasion_considerations": [
        "Throttle /client requests and mimic normal browser behavior (user agents, referrers, pacing) to avoid detection by anomaly-based monitoring or rate limits.",
        "Spread activity over time and across multiple IPs to avoid concentrated spikes in event volume.",
        "Shape events to resemble plausible but slightly altered customer behavior rather than obviously synthetic payloads."
      ],
      "resulting_access": "Unauthenticated but tenant-specific write access to the victim’s Klaviyo Data Platform via public /client endpoints, enabling the adversary to inject arbitrary profiles, events, and subscription changes that can drive downstream segmentation, flows, and reporting without ever holding valid UI or /api credentials.",
      "comments": "This vector abuses design-intended public ingestion paths rather than a security bug. It does not grant read access, but it does provide a practical foothold to influence tenant data and automation behavior."
    },
    {
      "can_achieve": true,
      "technique_name": "Exploit Public-Facing Application (abuse Reviews client APIs and widgets)",
      "technique_stix_id": "T1190",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary visits product pages on a merchant’s site that use Klaviyo Reviews widgets and inspects browser network traffic to identify calls to the client Reviews APIs, including any public identifiers (such as the site ID) and the request structure used to submit reviews.",
          "related_capabilities": [
            "Review Management (Klaviyo Reviews)",
            "Reviews APIs (Server & Client)",
            "Web Forms & Lead Capture",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "Review widgets embedded into Shopify/WooCommerce storefronts – https://help.klaviyo.com/hc/en-us/articles/15937542819355",
            "Client Reviews APIs documented in the API changelog (browser-facing create/retrieve endpoints)."
          ],
          "related_data": [
            "Observed client Reviews API endpoint URLs and payloads.",
            "Public site ID / reviews key embedded in the widget or JavaScript."
          ],
          "notes": null
        },
        {
          "step_id": 2,
          "description": "Using the observed client Reviews API pattern and public identifiers, the adversary crafts automated POST requests from their own infrastructure that submit reviews for selected products, specifying arbitrary review text, ratings, and any custom attributes the merchant’s review form collects.",
          "related_capabilities": [
            "Reviews APIs (Server & Client)",
            "Review Management (Klaviyo Reviews)"
          ],
          "related_interfaces": [
            "Client Reviews create endpoint (public-facing Reviews API)."
          ],
          "related_data": [
            "New review objects containing attacker-specified content, ratings, timestamps, and product/catalog IDs."
          ],
          "notes": "From Klaviyo’s perspective, these look like legitimate browser-originated review submissions."
        },
        {
          "step_id": 3,
          "description": "If the merchant has enabled auto-verification or permissive moderation rules, many of these attacker-submitted reviews may be automatically marked as verified and become eligible for display through the same widgets and APIs that serve legitimate reviews.",
          "related_capabilities": [
            "Review Management (Klaviyo Reviews)"
          ],
          "related_interfaces": [
            "Reviews product UI – moderation and auto-verification configuration.",
            "Server-side Reviews APIs for listing and retrieving reviews."
          ],
          "related_data": [
            "Moderation status and verification flags tied to each submitted review.",
            "Aggregated review metrics such as counts and average ratings."
          ],
          "notes": "Moderation is controlled by merchant configuration; there is no separate authentication step on the client submission path beyond public identifiers."
        },
        {
          "step_id": 4,
          "description": "By submitting many such reviews across products and identities, the adversary can pollute the merchant’s Klaviyo Reviews data store, influence review analytics, and potentially affect what content is shown on the storefront and in Klaviyo-powered messaging triggered by review events.",
          "related_capabilities": [
            "Review Management (Klaviyo Reviews)",
            "Multi-channel Flows Execution Engine",
            "Automated Flows (Marketing Automation)"
          ],
          "related_interfaces": [
            "Flows builder UI where review-related events can trigger automations.",
            "Reviews analytics and reporting dashboards."
          ],
          "related_data": [
            "Review analytics (conversion funnels, average ratings, sentiment).",
            "Flow triggers and events based on review submissions."
          ],
          "notes": null
        }
      ],
      "capabilities_used": [
        "Review Management (Klaviyo Reviews)",
        "Reviews APIs (Server & Client)",
        "Web Forms & Lead Capture",
        "Multi-channel Flows Execution Engine",
        "Automated Flows (Marketing Automation)",
        "Klaviyo Data Platform (Core CDP)"
      ],
      "interfaces_used": [
        "Review widgets embedded into Shopify/WooCommerce storefronts – https://help.klaviyo.com/hc/en-us/articles/15937542819355",
        "Client Reviews APIs as documented in the API changelog.",
        "Reviews product UI for moderation and auto-verification settings.",
        "Flows builder UI – https://www.klaviyo.com/features/flows/",
        "Reviews analytics dashboards in the Klaviyo app."
      ],
      "data_accessed": [
        "Ability to create large numbers of review objects tied to specific products and pseudo-identities.",
        "Indirect control over what reviews may be displayed via widgets and APIs, subject to merchant moderation.",
        "Influence over review-based metrics and any automations that trigger from review events."
      ],
      "preconditions_required": [
        "The merchant has enabled Klaviyo Reviews and embedded client-side review widgets that use the client Reviews APIs.",
        "Client Reviews endpoints are accessible from arbitrary visitors (as intended for public review submission).",
        "Moderation rules are not strict enough to outright block all suspicious or repeated submissions, or the adversary is willing to operate slowly to remain below thresholds."
      ],
      "constraints_encountered": [
        "Rate Limiting",
        "CAPTCHA Protection"
      ],
      "evasion_considerations": [
        "Distribute submissions across time, IPs, and product SKUs to avoid obvious spikes or patterns that would trigger rate limiting or manual review.",
        "Craft review content and ratings to resemble legitimate customer feedback rather than obvious spam or extremes.",
        "If CAPTCHA or similar protections are applied in the widget, use manual solving or low-volume attacks rather than high-volume automation."
      ],
      "resulting_access": "Unauthenticated but tenant-specific write access to Klaviyo’s Reviews data via client APIs, enabling the adversary to mass-insert user-generated content that can influence storefront displays, review analytics, and any flows triggered by review events.",
      "comments": "This is a public-content variant of abusing /client ingestion: instead of profiles/events, the adversary manipulates review data and public UGC through the documented client Reviews APIs."
    },
    {
      "can_achieve": true,
      "technique_name": "Valid Accounts (compromised ecommerce customer account via Customer Hub)",
      "technique_stix_id": "T1078",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary compromises a customer’s ecommerce account (for example, a Shopify customer account) for a merchant that has enabled Klaviyo Customer Hub, using off-platform means such as password reuse, phishing, or access to the customer’s email.",
          "related_capabilities": [
            "Customer Hub (Customer Experience Hub)"
          ],
          "related_interfaces": [
            "Ecommerce platform customer account login (e.g., Shopify Customer Accounts) that backs Customer Hub authentication."
          ],
          "related_data": [
            "Compromised ecommerce customer credentials and session for a specific shopper identity."
          ],
          "notes": "This compromise occurs in the ecommerce platform, which Customer Hub trusts for authentication."
        },
        {
          "step_id": 2,
          "description": "The adversary logs into the merchant’s ecommerce site as the compromised customer and navigates to the Customer Hub section (account, orders, or a dedicated hub entry point) that is powered by Klaviyo.",
          "related_capabilities": [
            "Customer Hub (Customer Experience Hub)",
            "Klaviyo Service (Helpdesk + Customer Agent)"
          ],
          "related_interfaces": [
            "Customer Hub embedded frontend on the ecommerce site – https://www.klaviyo.com/products/customer-experience-hub/",
            "Shopify Account Extensions-based Customer Hub experience."
          ],
          "related_data": [
            "Session token tying the browser session to the authenticated ecommerce account."
          ],
          "notes": "Customer Hub relies on the ecommerce session to decide which profile’s data to surface."
        },
        {
          "step_id": 3,
          "description": "Customer Hub uses the ecommerce identity to resolve the corresponding Klaviyo profile via Customer Profiles & Identity Resolution and surfaces order history, returns, subscriptions, rewards, and associated support interactions for that one customer profile.",
          "related_capabilities": [
            "Customer Hub (Customer Experience Hub)",
            "Customer Profiles & Identity Resolution",
            "Klaviyo Data Platform (Core CDP)"
          ],
          "related_interfaces": [
            "Customer Hub embedded frontend (orders, returns, subscriptions, rewards, support).",
            "Customer Profiles view backing the hub’s data."
          ],
          "related_data": [
            "Order history and current order status for the compromised customer.",
            "Subscription and rewards status and management options.",
            "Support interactions and FAQs linked to that profile."
          ],
          "notes": "Identity resolution errors could theoretically map the ecommerce account to the wrong profile, amplifying impact, but such misconfiguration is not documented here."
        },
        {
          "step_id": 4,
          "description": "Within the Customer Hub UI, the adversary performs any operations allowed to that signed-in customer (for example, initiating returns, modifying subscriptions, redeeming rewards), which generate further events into Klaviyo and may change data in integrated systems.",
          "related_capabilities": [
            "Customer Hub (Customer Experience Hub)",
            "Multi-channel Flows Execution Engine"
          ],
          "related_interfaces": [
            "Customer Hub actions for returns and subscription management.",
            "Flows that react to Customer Hub engagement events."
          ],
          "related_data": [
            "Events representing returns, subscription changes, or reward redemptions for that customer profile."
          ],
          "notes": "This remains constrained to a single customer identity; it does not directly expose other customers’ data or grant admin control of the tenant."
        }
      ],
      "capabilities_used": [
        "Customer Hub (Customer Experience Hub)",
        "Customer Profiles & Identity Resolution",
        "Klaviyo Service (Helpdesk + Customer Agent)",
        "Klaviyo Data Platform (Core CDP)",
        "Multi-channel Flows Execution Engine"
      ],
      "interfaces_used": [
        "Ecommerce platform customer account login and session handling (e.g., Shopify Customer Accounts).",
        "Customer Hub embedded frontend on the merchant’s site – https://www.klaviyo.com/products/customer-experience-hub/",
        "Customer Hub ecommerce CX integrations – https://www.klaviyo.com/products/customer-experience-hub/ecommerce-cx"
      ],
      "data_accessed": [
        "Order history, order status, and associated purchase data for the compromised customer.",
        "Details of subscriptions, returns, rewards, and any surfaced support interactions tied to that customer’s profile.",
        "Customer Hub engagement data for that customer (visits, clicks, actions)."
      ],
      "preconditions_required": [
        "The merchant has enabled Customer Hub and integrated it with their ecommerce platform accounts.",
        "The adversary has compromised a specific ecommerce customer account that is mapped to a Klaviyo profile via identity resolution.",
        "The ecommerce platform’s own protections (MFA, device checks) are either weak or have been bypassed by the adversary."
      ],
      "constraints_encountered": [],
      "evasion_considerations": [
        "Limit actions in Customer Hub to what a legitimate but slightly unusual customer might do to avoid merchant suspicion (for example, small changes to subscriptions rather than extreme or repeated actions).",
        "Avoid rapid or repeated logins from obviously anomalous IPs or locations that might trigger security controls on the ecommerce platform."
      ],
      "resulting_access": "Authorized, signed-in access to the Customer Hub experience for a single shopper, exposing that profile’s orders, subscriptions, rewards, and limited self-service operations. This is unauthorized from the customer’s perspective but is a low-privilege foothold relative to workspace admins or API keys.",
      "comments": "This vector leverages the fact that Customer Hub trusts ecommerce authentication. It does not provide tenant-level administrative access but does cross a privacy boundary for the individual customer and can generate additional events within Klaviyo."
    },
    {
      "can_achieve": true,
      "technique_name": "Phishing (credential/session theft via Klaviyo Helpdesk inbound channels)",
      "technique_stix_id": "T1566",
      "method_steps": [
        {
          "step_id": 1,
          "description": "The adversary crafts a phishing message containing a link to a fake SSO or Klaviyo login page (or a malicious OAuth consent flow) and sends it to a merchant’s public support address, SMS support number, or Instagram DM handle that is integrated into Klaviyo Helpdesk.",
          "related_capabilities": [
            "Klaviyo Helpdesk (Service)",
            "Social Marketing & Audience Sync",
            "SMS Marketing"
          ],
          "related_interfaces": [
            "Helpdesk channel integrations for email, SMS, WhatsApp, and Instagram DMs – https://www.klaviyo.com/solutions/customer-service/",
            "Klaviyo Helpdesk inbox UI – https://www.klaviyo.com/products/helpdesk/"
          ],
          "related_data": [
            "Inbound phishing message content and link as stored in the Helpdesk conversation record."
          ],
          "notes": "Helpdesk is used primarily as a viewing and response interface; the phishing infrastructure (fake login pages) is external."
        },
        {
          "step_id": 2,
          "description": "A support agent, while logged into Klaviyo via SSO, opens the phishing message in the Helpdesk UI and clicks the embedded link, navigating to the attacker-controlled phishing page.",
          "related_capabilities": [
            "Klaviyo Helpdesk (Service)"
          ],
          "related_interfaces": [
            "Helpdesk conversation view showing inbound email/SMS/DM content.",
            "Agent’s browser session that is also authenticated to Klaviyo’s SSO."
          ],
          "related_data": [
            "Agent’s active web session and cookies for Klaviyo and the IdP."
          ],
          "notes": "This is similar to traditional email phishing but delivered through the Helpdesk workspace rather than a separate mail client."
        },
        {
          "step_id": 3,
          "description": "On the phishing page, the agent is prompted to log in to the corporate IdP or to approve a fake OAuth consent. They enter SSO credentials and MFA tokens or interact with the consent screen, which the adversary captures in real time or uses to hijack the session.",
          "related_capabilities": [],
          "related_interfaces": [
            "Attacker-controlled phishing page designed to mimic the IdP or Klaviyo SSO/OAuth UI."
          ],
          "related_data": [
            "Stolen SSO username/password and MFA token, or captured session cookies/tokens.",
            "Potentially, OAuth authorization codes or tokens if a fake consent flow is used."
          ],
          "notes": "This step aligns with consent phishing and SSO phishing patterns documented for other cloud services."
        },
        {
          "step_id": 4,
          "description": "Using the stolen credentials or tokens, the adversary authenticates to Klaviyo (UI or API) as the support agent or another privileged user, obtaining an initial foothold similar to the Cloud Accounts or Valid Accounts vectors.",
          "related_capabilities": [
            "Klaviyo Data Platform (Core CDP)",
            "Developer & API Key Management"
          ],
          "related_interfaces": [
            "Klaviyo web app login and SSO flow.",
            "JSON:API endpoints if the attacker uses tokens directly against the API."
          ],
          "related_data": [
            "New authenticated session into the Klaviyo tenant as the compromised user."
          ],
          "notes": "Follow-on activity (enumerating data, creating keys, changing configuration) would fall under other tactics and is outside the scope of this initial-access description."
        }
      ],
      "capabilities_used": [
        "Klaviyo Helpdesk (Service)",
        "Social Marketing & Audience Sync",
        "SMS Marketing",
        "Klaviyo Data Platform (Core CDP)",
        "Developer & API Key Management"
      ],
      "interfaces_used": [
        "Helpdesk channel integrations for email, SMS, WhatsApp, and Instagram DMs – https://www.klaviyo.com/solutions/customer-service/",
        "Klaviyo Helpdesk inbox and conversation views – https://www.klaviyo.com/products/helpdesk/",
        "Klaviyo web app login and SSO flow.",
        "JSON:API endpoints documented in https://developers.klaviyo.com/en/reference/api_overview"
      ],
      "data_accessed": [
        "Stolen SSO credentials, MFA tokens, or application access tokens for a Helpdesk or admin user.",
        "Subsequent authenticated access into the tenant’s data and configuration as that user."
      ],
      "preconditions_required": [
        "The victim organization uses Klaviyo Helpdesk to ingest support email/SMS/DMs, so agents read untrusted content within the Klaviyo UI.",
        "The adversary knows or can guess the merchant’s support contact points integrated into Helpdesk.",
        "The agent is willing to click links in support messages (for example, to “verify an order” or “confirm account details”)."
      ],
      "constraints_encountered": [
        "MFA Required",
        "SSO-Only Authentication",
        "Rate Limiting",
        "CAPTCHA Protection"
      ],
      "evasion_considerations": [
        "Make phishing messages blend with typical customer support traffic (for example, referencing recent campaigns or promotions) to increase the chance agents click the link.",
        "Host phishing infrastructure on domains that look similar to the IdP or Klaviyo to reduce suspicion.",
        "Perform session hijacking in real time to bypass MFA without needing to persist the victim’s second factor."
      ],
      "resulting_access": "Cloud-account style initial access into the victim’s Klaviyo tenant by compromising a user (often a support agent) through phishing delivered via Helpdesk’s inbound channels, leading to an authenticated session or tokens usable against the UI or APIs.",
      "comments": "This vector leverages Klaviyo’s role as a support console: agents routinely handle untrusted external content within the Klaviyo UI, which can be exploited as a phishing delivery channel for SaaS account compromise."
    },
    {
      "can_achieve": false,
      "technique_name": "Default Accounts (built-in admin or default API credentials)",
      "technique_stix_id": "T1078.001",
      "method_steps": [],
      "capabilities_used": [],
      "interfaces_used": [],
      "data_accessed": [],
      "preconditions_required": [
        "Klaviyo would need to expose built-in default user accounts (for example, admin/admin) or factory-set API keys that remain active until changed.",
        "Those defaults would need to be documented or guessable and not forcibly rotated during tenant onboarding."
      ],
      "constraints_encountered": [
        "Email Verification Required",
        "Admin Approval Required"
      ],
      "evasion_considerations": [],
      "resulting_access": "",
      "comments": "The provided documentation and capability map do not indicate any built-in default user accounts or default API keys that are left active for customer tenants. Instead, API keys are created explicitly in the Developer & API Key Management UI and are not viewable after creation, and there is no mention of system-wide default workspace logins. Without evidence of default accounts, this technique is not realistically applicable as an initial access vector for Klaviyo."
    }
  ],
  "summary": "The dominant realistic initial access vectors for Klaviyo center on (1) cloud-account compromise of SSO-backed users or service tokens (Valid Accounts / Cloud Accounts), and (2) abuse of intentionally public ingestion surfaces (web forms, /client events/subscriptions, and client Reviews APIs).\n\nHigh-impact vectors include: compromising a Klaviyo user via SSO to obtain full UI access; abusing stolen private API keys or OAuth tokens (either directly or via compromised partners) to call JSON:API endpoints; and using consent-phishing against Klaviyo’s OAuth flows to grant a malicious app broad API access. Public /client endpoints and Reviews client APIs provide unauthenticated but tenant-specific write access that can poison events, profiles, subscriptions, and review data and thereby influence flows and segmentation, even without credentials. Additional, more limited vectors exist via compromised ecommerce customer accounts using Customer Hub, and via phishing delivered through Helpdesk inbound channels to steal SSO sessions.\n\nEnvironment constraints such as MFA, SSO-only authentication, IP allowlisting, rate limiting, CAPTCHA, and potential approval/verification for new users make brute-force or naive registration-based attacks unlikely, but they do not mitigate credential, session, or token theft, nor do they constrain the public /client surfaces that are designed to ingest data from arbitrary visitors. No evidence of exploitable default accounts was found, so that technique is assessed as not achievable for this application."
}